{
    "output": [
        "ISO 10360-5:2010, Geometrical product specifications (GPS) - Acceptance and reverification  tests \nfor coordinate measuring machines (CMM) - Part 5: CMMs using single and multiple stylus contacting \n3\tTerms\tand\tdefinitions\nFor the purposes of this document,  the following terms and definitions apply.\nNOTE In measuring mode, machine tools are used like CMMs.  Therefore,  definitions for probing systems \nperformance tests for CMMs apply also for machine tools.  However,  since not all  machine tool users are familiar \nwith the use of CMMs, this part of ISO 230 provides definitions specifically with machine tools in mind, making \nsure that they do not create any conflicts with CMM definitions.",
        "3.1 General terms\n3.1.1\nmachine coordinate system\nMCS\ncoordinate system fixed with respect to physical or calculated axes of a machine tool\n[SOURCE:  ISO 10360-1:2000,  2 .5  - modified.]",
        "3.1.2\nworkpiece coordinate system\nWCS\ncoordinate system fixed with respect to a workpiece\n[SOURCE:  ISO 10360-1:2000, 2 .4]",
        "3.1.3\nmeasuring volume\nthree-dimensional space encompassing all  linear coordinates that are accessible for measurement on \nthe machine tool\n[SOURCE:  ISO 10360-1:2000,  2 .3  - modified.]",
        "3.2  Terms relating to the probing system\n3.2 .1\nprobe\ndevice that senses a feature and generates the signal(s)  during probing\n[SOURCE:  ISO 10360-1:2000,  3 .1  - modified.]\nNote 1  to entry:  There are several types of probes used on machine tools and they use different technologies to \nachieve the same aim.\nNote 2  to entry:  Probes can either be \"switching\" types or \"proportional\"  types.  These are all available as either \n\"contacting\" or \"non-contacting\" systems.  Non-contacting systems are not part of the scope of this part of ISO 230.",
        "3.2 .1.1\nswitching probe\nprobe that gives a binary signal as a result of contact with a surface being measured (detected)",
        "3.2 .1.2\nproportional probe\nprobe that gives a signal (analogue or digital)  proportional to a displacement of the stylus tip",
        "probe that needs material contact with a surface being measured (detected)  in order to function\n[SOURCE:  ISO 10360-1:2000, 3 .2  - modified.]\nEXAMPLE Electrical circuit breakage,  strain gauge.\nNote 1  to entry:  The contacting feed speed applied to obtain the material contact can influence the performance \nof such probes.  Proper contacting feed speed is  specified in the manufacturer's/supplier's  instructions.\nNote 2  to entry:  For best performance,  the contacting feed speed applied during measurement is  the same as the \nfeed speed applied during probe qualification.",
        "3.2 .1.4\nnon-contacting probe\nprobe that needs no material contact with a surface being measured in order to function\n[SOURCE:  ISO 10360-1:2000, 3 .3  - modified.]\nEXAMPLE Optical and laser systems, inductive and capacitive systems.\nNote 1  to entry:  Non-contacting probes are not included in the scope of this part of ISO 230.",
        "3.2 .2\nprobing system\nsystem consisting of a probe  (3 .2 .1) ,  signal transmission system (e.g.  optical,  radio,  wire) ,  signal \nconditioning hardware,  the probing hardware and software and, where present,  probe extensions,  \nprobe changing system, stylus and stylus extensions,  when used in conjunction with a suitable \nnumerically controlled machine tool\n[SOURCE:  ISO 10360-1:2000, 2 .6 - modified.]\nNote 1  to entry:  Tests specified in this part of ISO 230 are referred to probing systems consisting of contacting \nprobes equipped with a single stylus system that is  parallel to  the machine tool spindle axis average line,  as \ndepicted in Figure 2 .  For applications using stylus systems equipped with multiple styli (see Figure 3) ,  and for \napplication where measurement is  performed by using multiple orientations of the spindle axis average line with \nrespect to the WCS, additional tests are specified in ISO 10360-5.",
        "3.2 .3\nprobing\tsystem\tqualification\nestablishment of the parameters of a probing system (based on manufacturer's/supplier's instructions)  \nnecessary for subsequent measurements\nNote 1  to entry:  Effective stylus tip diameter (3 .2 .5)  and location of the stylus tip centre with respect to the MCS \nare typical parameters established by probing system qualification.\nNote 2  to entry:  Suppliers'  technical literature sometimes refers to probing system qualification with the \nexpression \"probing system calibration\";  this expression is  not appropriate.",
        "3.2 .4\npre-travel\ndistance between the point of first material contact of the probe stylus tip with the surface being \nmeasured (detected)  and the point where the probe signal is  generated\nNote 1  to entry:  Pre-travel is  affected by probe construction,  probing direction,  probing speed, switching force,  \nstylus system length and compliance,  time delay between probing signal and machine tool position transducer \nread-out,  etc.\nNote 2  to entry:  Pre-travel variation (commonly referred to as \"lobing\") ,  under specified probing conditions,  is  a \nvery important probing system characteristic.\nNote 3  to entry:  Some probe qualification techniques can significantly reduce the effects of probing system pre-\ntravel variation.",
        "effective stylus tip diameter\neffective stylus tip size\nstylus tip dimension used by some probing software to compensate for measured feature size,  etc.\nNote 1  to  entry:  The effective stylus tip diameter (size)  is  associated with probing system performance and is  \ndetermined by appropriate probing system qualification,  rather than by simply measuring the stylus tip size.",
        "3.2 .6\nstylus tip\nphysical element that establishes the contact with the object to measure\n[SOURCE:  ISO 10360-1:2000,  4.2  - modified.]",
        "3.2 .7\nstylus system\nsystem composed of a stylus and stylus extension(s)  (if any)\n[SOURCE:  ISO 10360-1:2000,  4.4 - modified.]\nNote 1  to entry:  Stylus extensions can reduce stylus system stiffness and can adversely influence probing system \nperformance.  Therefore,  performance tests are carried out using the particular stylus extension(s)  of interest.",
        "3.2 .8\nstylus system length\n<spherical stylus tip> distance from the centre of the stylus tip to the shoulder of the stylus system\nNote 1  to entry:  See Figure 1 .\nKey\na stylus system length\nFigure 1  - Stylus system length",
        "3.2 .9\nprobing tool\ndevice consisting of a probe and its stylus system, attached to a tool holder\nNote 1  to entry:  See Figure 2 .",
        "3.2 .10\nprobing-tool length\ndistance from the most protruding point of the stylus tip to the machine tool spindle reference surface \nor gauge line that connects to the probing tool\nNote 1  to entry:  See Figure 2 .",
        "Note 2  to entry:  Some probing systems establish the probing-tool length as the distance from the centre of the \nstylus tip surface to the machine tool spindle reference surface that connects to the probing tool.",
        "Note 3  to entry:  For solid-shank-type tool holders,  the spindle reference surface is  at the spindle cone gauge line.  \nFor other tool holders (hollow shank) ,  the spindle reference surface is  the spindle face.",
        "Note 4 to entry:  The procedure for establishing the length of the probing tool is  specified in \nmanufacturer's/supplier's instructions.\n1 spindle\n2 tool holder\n4 stylus\nL probing-tool length\nFigure 2  - Probing-tool length",
        "3.2 .11\nstylus tip offset\neffective distance from the centre of the stylus tip to the axis average line of the spindle,  in which the \nprobing tool is  mounted",
        "3.3  Terms relating to probing\n3.3.1\nprobing\nprobe\nmeasurement action that results in the determination of values (e.g.  coordinate values,  length values,  \nfalse/true values)\n[SOURCE:  ISO 10360-1:2000, 2 .7 - modified.]\nNote 1  to  entry:  Probing associated with the measurement of cutting tools does not necessarily result in the \ndetermination of coordinate values.\nNote 2  to entry:  Probing associated with tool breakage detection results in the determination of a false/true state.",
        "3.3.1.1\n1D probing\nmeasurement allowing for probing motion parallel to one machine coordinate system axis or to one \nworkpiece coordinate system axis at one time only\nNote 1  to entry:  1D measurement capability is  associated with the probing system performance,  not only with \nthe contacting probe capabilities.",
        "2D probing\nmeasurement allowing for probing motion along a vector in a plane\nNote 1  to entry:  Typical contacting probes that operate in the -X,  +X,  -Y,  +Y and -Z directions,  and in any \ncombination of such directions,  are sometimes referred to as 2 ,5D probes.  These contacting probes do not allow \nfor (or allow for very limited)  traction in the +Z direction.\nNote 2  to  entry:  Measurement in the +Z direction capability can be obtained by the use of stylus systems equipped \nwith multiple styli,  as  depicted in Figure 3 ,  where stylus tip 2  (moving in the +Z direction)  contacts the workpiece \nsurface and causes the probe to generate the signal as a consequence of the deflection in the -Z direction.\nNote 3  to entry:  Independent qualification for stylus tip 1  and for stylus tip 2 ,  and additional tests,  are specified \nin ISO 10360-5.",
        "1 stylus tip 1\n2 stylus tip 2\n3 spindle\n4 tool holder\n5 probe\n6 workpiece\nFigure 3  - Probing-tool equipped with 2  styli",
        "3.3.1.3\n3D probing\nmeasurement allowing for probing motion along any vector in space",
        "3.3.2\nprobing repeatability\ndegree of closeness of coordinate values provided by the probing system when it is  repeatedly applied \nto the same measurand under the same test conditions\nNote 1  to entry:  This definition specifically refers to the scope of this part of ISO 230 and the probing systems \nunder test;  it is  not extended to the general definition associated with the metrological characteristics defined in \nother International Standards.\nNote 2  to entry:  Probing repeatability can be expressed quantitatively in terms of the dispersion characteristics \nof the measured values or by the range of measured values.\nNote 3  to entry:  Probing repeatability relates to the complete probing system. It is  not comparable with \"probe \nrepeatability\" as defined in the probe suppliers'  handbooks.\nerror within which the range of the radii of a reference artefact can be determined by a machine tool \nusing one stylus system\nNote 1  to entry:  The symbol,  PFTU,  is  taken from ISO 10360-5:2010, 3 .6 and 3 .9.  The character P indicates that \nthe error is  related primarily to the probing system performance,  the character F indicates that it is  a form error,  \nthe character T refers to a contacting (tactile)  probing system and the character U indicates the use of a single \n(unique)  stylus.\nNote 2  to entry:  A typical reference artefact for 2D probing is  a ring calibrated for form. A typical reference \nartefact for 3D probing is  a sphere calibrated for form.\nNote 3  to  entry:  2D probing error is addressed in 6.5  and 3D probing error is  addressed in 6 .6.",
        "3.4 Terms relating to scanning probes (See Annex B)\n3.4.1\nrest position\nposition of the centre of the probe's  stylus  tip  when it is  stationary and not deflected by contact \nwith a surface\nNote 1  to entry:  The rest position is  a nominal position that is  established during qualification.  The actual rest \nposition at any time typically varies slightly from this value.",
        "3.4.2\nmaximum\tscanning\tdeflection\nmaximum deflection that can be applied to the centre of the probe's  stylus tip during a scanning \nmeasurement specified by the manufacturer\nNote 1  to  entry:  The maximum scanning deflection can vary with direction of deflection (x,y,z) .",
        "3.4.3\nprobe over-travel limit\nmaximum deflection of the centre of the probe stylus tip from the rest position that can be applied \nwithout causing damage to the probe stylus assembly",
        "3.4.4\nminimum\tscanning\tdeflection\nminimum deflection of the centre of the stylus tip from its  rest position that is  allowed during a \nscanning measurement\nNote 1  to entry:  Deflection is  programmed to be large enough to ensure that the stylus tip maintains contact \nwith the surface throughout the measurement.",
        "3.4.5\nscanning measurement range\nmaximum allowed distance between the nominal scan line and the actual scan line,  as  specified by the \nmanufacturer/supplier\nNote 1  to entry:  This distance may be expressed separately for the different axes of the probe,  e.g.  +-  0,3  mm in X \nand Y,  +-  0,2  mm in Z .\nNote 2  to entry:  The scanning measurement range is  less than the difference between the maximum scanning \ndeflection and the minimum scanning deflection for a number of reasons,  including\n- deviation from the pre-defined tool-path caused by machine tool path following errors,\n- approximations during tool-path generation (e.g.  approximating a curve by straight line segments) ,  and\n- additional probe deflection caused by movement along the surface (e.g.  friction,  local surface normal \ndeviations,  surface finish) .",
        "stylus tip normal acceleration\nacceleration of the centre of the stylus  tip  relative to  the surface being measured,  normal to  the \ntarget surface\nNote 1  to entry:  Stylus tip normal acceleration is  sometimes considered to limit the scanning feed speed for \nfeatures that have sharp scanning path variations,  and would therefore demand high rates of acceleration from \nthe machine tool axes.  Scanning performance is  affected mostly by acceleration normal to the surface being \nmeasured, as machine position errors in the direction of the target scan line do not usually lead to significant \nmeasurement errors.",
        "3.4.7\nindicated tip centre point\nindicated position of the centre of the stylus tip during a measurement\nNote 1  to entry:  This is  also known as an \"indicated measured point\" (see ISO 10360-1:2000, 2 .12) .",
        "3.4.8\nscanning sphere centre position reproducibility\nmaximum variation of the sphere centre positions obtained through multiple measurements compared \nto the sphere centre position obtained by the first measurement",
        "3.4.9\npre-defined\tpath\tscanning\nmethod of scanning in which the motion of the probing system between two defined end points is  \ndirected by a target scan line\n[SOURCE:  ISO 10360-1:2000, 7.5]\nNote 1  to  entry:  In this method of scanning,  feedback from the probing system is  not used to direct the motion of \nthe probing system.",
        "4 Preliminary remarks\n4.1\tInfluences\ton\tthe\tmeasurement\tperformance\tof\tthe\tprobing\tsystem\nMeasurement performance of the probing system includes the machine tool characteristics over a \nlimited,  small volume and shall not be simply derived from the stand-alone probe specifications.\nThe main influences on performance of probing systems of a machine tool are the following:\na)  repeatability of machine tool;\nb)  geometric accuracy of machine tool,  i .e.  positioning accuracy (including resolution,  backlash) ,  \nstraightness,  roll,  pitch,  yaw error motion,  squareness between axes,  etc.;\nc)  contamination of surfaces being measured (detected);\nd)  probing error and repeatability of probing system, including probing-tool changing and relocation;\nf)  temperature influences on machine tool,  probing system, artefact and workpiece/tool,  including \ndrift of moving axes and spindles;\ng)  feed speed and accelerations during measurement;\nh)  standoff and overtravel distances;\n8 (C) ISO 2016 - All rights reserved\ni)  time delay and time delay variation between probing signal and read-out of machine tool \nposition transducers;\nj )  surface of workpiece/tool probed.\nWorkpiece probing repeatability shall be checked in accordance with the tests in 6.2 ;  probing-tool \nlocation repeatability shall be checked in accordance with the test in 6.4;  tool setting repeatability shall \nbe checked in accordance with the tests in 7.3 .\nTesting for performance of workpiece probing system and geometric accuracy of the machine tool (in a \nlimited,  small volume)  is  given in 6.5  and 6.6.\nTesting for time delay variation between probing signal and read-out of machine position transducers \nis  given in 6.9;  feature size measurement performance tests are given in 6.10.\nTemperature influences are best observed using procedures given in 5.2  and in ISO 230-3 .",
        "4.2  Measurement units\nIn this part of ISO 230,  all linear dimensions and deviations are expressed in millimetres.  All  angular \ndimensions are expressed in degrees.  Angular deviations are,  in principle,  expressed in ratios but \nin some cases,  microradians or arc-seconds may be used for clarification purposes.  The following \nexpression should be used for conversion of the units of angular deviations or tolerances:\n0,010/1  000 =  10  mrad ~ 2\"",
        "4.3  Reference to ISO 230-1\nTo apply this part of ISO 230,  reference should be made to ISO 230-1,  especially for the installation of \nthe machine before testing.",
        "4.4 Recommended instrumentation and test equipment\nThe measuring instruments indicated in the tests described in the following clauses are examples \nonly.  Other instruments measuring the same quantities and having the same or smaller measurement \nuncertainty may be used.  Linear displacement sensors shall have a resolution of 0,001  mm or better.",
        "4.5 Machine conditions prior to testing\nBefore starting the measurements,  the machine tool geometric performance shall be assessed in \naccordance with relevant International Standards (e.g.  ISO 230-1,  ISO 230-2 ,  ISO 230-3,  ISO 10791-1) .\nNOTE Appropriate national standards can apply.\nIn addition,  the procedures for probe configuration and qualification shall be performed according to \nthe conditions specified by the manufacturer/supplier.",
        "4.6 Testing sequence\nThe sequence in which the tests are presented in this part of ISO 230  does not define the practical order \nof testing.  The tests described in Clauses 5,  6 and 7  may be performed either singly or in any combination.",
        "4.7 Tests to be performed\nWhen testing a machine,  it is  neither always necessary nor possible to carry out all the tests described in \nthis part of ISO 230.  When the tests are required for acceptance purposes,  it is  up to the user to choose,  \nin agreement with the manufacturer/supplier,  those tests which are of interest.  These tests shall be \nclearly stated when ordering a machine.  Mere reference to this part of ISO 230 for the acceptance tests,  \nwithout specifying the tests that shall be carried out,  and without agreement on the relevant expenses,  \ncannot be considered binding for any contracting party.",
        "4.8 Sources of test uncertainty\nThe tests described in this part of ISO 230 reveal the characteristics of the probing system as a \nmeasuring instrument.  Therefore,  they are characteristically different from the tests described in \nother parts of ISO 230.  For example,  when testing the repeatability of positioning of a numerically \ncontrolled machine tool axis,  the aim is  to determine the repeatability of a specific machine tool \ncharacteristic under specified repeated measurement conditions.  It shall be considered that this part of \nISO 230 focuses on the determination of the performances of a specific measuring system:  the probing \nsystem itself;  therefore,  consideration is  made to estimate test uncertainty components rather than \nmeasurement uncertainty components as specified by ISO/TR 230-9.\nValuable information may be gathered from ISO/TS 23165.\nThe main contributors to  the test uncertainty for probing system measurement performance tests \nare as  follows:\n- the uncertainty of the calibration of the reference artefact,  i.e.  test ring or test sphere, where applicable;\n- the alignment of the reference ring(s) ,  where applicable;\n- the fixturing of the reference artefact,  where applicable;\n- the compensation of thermally induced errors, when measuring at temperatures outside the \nmanufacturer's/supplier's environmental temperature guidelines,  performed in accordance with 5.1;\nNOTE If tests are performed at temperatures complying with the manufacturer's/supplier's  guidelines \nor if no environmental temperature guidelines are given,  the test results properly represent the metrological \ncharacteristics of the probing system under test;  therefore,  there is  no contribution to the test uncertainty.\n- the environmental temperature variation error (ETVE or drift)  during the time of measurement,  \nrespectively the repeatability of the measurements due to the actual test environment exceeding \nthe manufacturer's/supplier's environmental temperature guidelines.",
        "4.9 Reporting of test results\nRelevant parameters of the test shall be reported, including the following:\na)  identification of machine tool;\nb)  identification of measuring software;\nc)  identification of probe/sensor;\nd)  identification of stylus system components and length;\ne)  probe switching force setting,  where applicable;\nf)  position and orientation of the probe/sensor,  if not fixed by design of the machine tool;\ng)  type,  dimension and identification of artefact or tool measured;\nh)  location of the artefact in the machine tool measuring volume, where applicable;\ni)  feed speed during probe qualification and during test;\nj)  probing distance during probe qualification and during test;\nk)  probing points number and distribution;\nl)  programmed spindle speed, where applicable;\nm)  relevant machine temperatures and ambient temperatures;\nn)  warm-up cycle.",
        "5\tThermal\tinfluences\nAccording to ISO 1,  the reference temperature for industrial dimensional measurements is  20  degC;  \ntherefore,  the measuring instruments and the measured objects should be in equilibrium with the \nenvironment where the temperature is  kept at 20 degC .  If the environment is  at a temperature other than \n20 degC,  nominal differential thermal expansion (NDE)  correction between the measurement system and \nthe measured object shall be made to correct the results to correspond to 20  degC .  Built-in NDE correction,  \nused for the normal operation of the machine tool,  shall be used;  additional NDE correction,  just for the \nmeasurements,  shall not be used to correct the thermal distortions of machine position transducers.",
        "5.2  Environmental temperature variation error (ETVE)  test\nAn ETVE test (as specified in ISO 230-3:2007, Clause 5)  shall be conducted prior to the probe evaluation \ntests.  The duration of the ETVE test should be agreed on between the manufacturer/supplier and user \nand should include the anticipated probing time.\nETVE tests are designed to reveal the effects of environmental temperature changes on the machine.  \nThey shall not be used for machine comparison.\nThe manufacturer/supplier (of the machine tool or of the probing system)  shall define the thermal \nenvironment in which the specified probing system performance can be achieved.  It shall be \nthe responsibility of the user to provide an acceptable thermal environment for the probing \noperation.  However,  if the user follows the guidelines provided by the probing system/machine \nmanufacturer/supplier,  or if no guidelines are provided, the responsibility for probing performance \naccording to the specification reverts to the machine tool or probing system manufacturer/supplier.\nIf probing capability is  added to an existing machine,  specification for thermal environment is  subject \nto an agreement between the manufacturer/supplier and the user.\nThe ETVE test shall be performed probing a sphere/a ring/a plane several times and evaluating the \nchange of the sphere centre/circle centre coordinates or the plane location.  The test should last for a \nperiod that equates to the nominal duration of the probing system tests.\nThe presentation of the results shall be in accordance with ISO 230-3:2007, 5 .3 .",
        "5.3  Other thermal distortion tests\nIf the probing system is applied just after machining operations or between machining operations,  the \neffects of cooling of the machine tool,  especially the machine tool spindle,  shall be considered.  In such \ncases,  a temperature variation error test shall be carried out after warming up of the main spindle \nand/or machine tool axes,  e.g.  by performing movements of a typical machining operation prior to \nmeasurements.  The machine tool movements that shall be performed (for instance spindle speed, \nduration of movement,  movement of axes,  feed speeds)  for the temperature variation error test are \nsubject to agreement between the manufacturer/supplier and user and shall consider the typical \noperations of the machine tool.\nIndividual performance tests in Clauses 6 and 7  may be carried out after performing typical \nmovements corresponding to machining operations,  which are subject to agreement between the \nmanufacturer/supplier and user.",
        "6 Probing of workpiece\n6.1 General\nProbes used on machining centres for the probing of workpiece are typically connected to the machine \ntool spindle.  For many probing applications,  the centre of the stylus tip should be located on the spindle \naxis average line in order to allow for proper identification of the workpiece coordinate system (WCS)  \nwith respect to the machine coordinate system (MCS) .  In other typical applications (for example:  \nmeasurement of the distance between two nominally parallel machined surfaces,  measurement of the \ndiameter of a hole or a boss,  etc.) ,  where the alignment of the stylus tip to the spindle axis average line \nis  not of primary concern, care should be taken to ensure that the spindle orientation with respect to \nthe MCS does not change during subsequent probing in order to avoid the stylus tip offset becoming a \nsignificant component of probing error.\nPrior to test execution,  stylus tip on-centre adjustment shall be performed according to the \nmanufacturer's/supplier's instructions.  The adjustment procedure shall be repeated whenever the \nstylus system connection to the probe is  altered.  This includes disassembling and re-assembling the \nsame stylus tip as different assembling torques can possibly change the stylus tip centre position.\nProbing system qualification shall be performed according to the manufacturer's/supplier's  instructions \nand shall be repeated after stylus tip on-centre adjustment.\nSuppliers'  technical literature sometimes refers to probing system qualification with the expression \n\"probing system calibration\";  this  expression is  not appropriate and should be avoided.\nTests in this part of ISO 230 are presented assuming that the probing system is  aligned with the machine \ntool Z-axis of motion and that the stylus tip centre is  aligned with the spindle axis average line,  assumed \nto be nominally parallel to the Z-axis of motion.  For applications using tilting or indexing heads,  for any \nnew orientation,  probing system qualification shall be performed again.  For such applications,  use of \nISO 10360-5  is  recommended.\nThe user is  free,  where applicable,  to choose the location in which to mount the reference artefact \nwithin the specified measuring volume.  However,  the reference artefact shall not be placed at a location \nused for the probing system qualification.\nThe reference artefact should always be mounted and clamped to ensure sufficient setup rigidity when \nsubmitted to the specific probing system switching force,  yet avoiding deformation of the artefact.  \nMachine tool probe switching force may vary from as little as 0,2  N for strain gauge switching probes \nto a few newtons for conventional switching probes.  Switching force for the Z-axis direction is  typically \nsignificantly higher than the X-  and Y-axis direction switching force.",
        "6.2  Probing repeatability\n6.2.1  General\nTypical workpiece probing systems for machining centres offer measuring capabilities designed to \nperform quick, simplified in-process measurements and measurement of the workpiece after machining,  \nbut while still  on the machine.  Such systems usually provide information on the size and the location of \nworkpiece features,  such as holes,  bosses,  web, pockets,  corners and single-point surface measurements,  \nbut they usually do not provide evaluation of form error of the measured workpiece feature.\nEnhanced machine tool probing systems exist that offer complex measurement capabilities,  such as \nmeasurement of free-form deviation from the mathematical model.  Other probing systems allow for the \nimplementation of measurement strategies that are typically available only on CMMs.\nProbing repeatability should,  in principle,  be associated with every single measuring task that can be \nperformed by a specific probing system.  This approach would lead to a significant testing effort that is  \nconsidered to be unjustified.\nA workpiece probing system is typically used for workpiece position and orientation measurements \naimed at locating the WCS with respect to the MCS, and for simple feature location and size measurements.  \nProbing repeatability tests are therefore specified for flat-surface location measurements,  and cylinder \nand sphere centre location measurements.\nProbing repeatability for size measurements is  addressed in 6.10.",
        "6.2.2  Probing repeatability test for single-point surface measurement, RSPT,X,  RSPT,Y  and RSPT,Z   \n(RSingle_PoinT,X,Y,Z)\n6.2.2.1  General\nIt shall be noted that single-point surface measurement is  an extremely simplified measuring method.  \nThe determination of the coordinates of a single point of a (flat)  surface can be assumed to individually \nrepresent the (flat)  surface itself only when the orientation and position of the surface with respect to \nthe relevant coordinate system are known.\n6.2.2.2  Test setup and procedure\nSelect a test artefact (block)  with at least three flat surfaces  nominally square to  each other.  For \nmost applications,  a standard gauge block,  with side surfaces'  flatness  within 0,080  mm is  adequate \nfor this  test.\nNOTE The test artefact referred to in 6.7.2  can also be suitable for this test.\nAlign the test artefact to the MCS in order to orient the three planes square to the X-,  Y-  and Z-axis,  \nrespectively.\nAcquire and record the X-axis coordinate of a contact point approaching the test artefact surface in the \nX-axis direction.  Repeat the acquisition and the recording of the X-axis coordinate values nine times for \na total of ten measurements.\nRepeat the procedure for the Y-axis and for the Z-axis.\n6.2.2.3  Analysis of results\nCompute RSPT,X  as  the range of recorded values for the X-axis coordinate.\nCompute RSPT,Y as  the range of recorded values for the Y-axis coordinate.\nCompute RSPT,Z  as  the range of recorded values for the Z-axis coordinate.",
        "6.2.3  Probing repeatability test for circle centre location, RCIR,X  and RCIR,Y (RCIRcle,X,Y)\n6.2.3.1  Test setup and procedure\nSet up a reference ring with a bore diameter of approximately 25  mm and align it to the MCS in order \nthat the axis of the ring bore is  parallel to the Z-axis of the machine.\nMeasure the centre coordinates of the reference ring bore by probing it with four points.  Establish a \nWCS datum point at the measured centre.\nRepeat the measurement ten times,  recording the bore centre X-  and Y-  axis coordinates.\nCompute RCIR,X  as  the range of recorded values for the X-axis coordinate of the centre.\nCompute RCIR,Y as  the range of recorded values for the Y-axis coordinate of the centre.",
        "6.2.4 Probing repeatability test for sphere centre location, RSPH,X,  RSPH,Y and RSPH,Z  (RSPHere,  X,Y,Z)\n6.2.4.1  Test setup and procedure\nSet up a reference sphere with a nominal diameter of approximately 25  mm.\nMeasure the centre coordinates of the reference sphere by probing it with five points according to the \nmanufacturer's/supplier's instructions.  Establish a WCS datum point at the measured centre of the \nreference sphere.\nRepeat the measurement ten times,  recording the sphere centre X-,  Y-  and Z-axis coordinates.\n6.2.4.2  Analysis of results\nCompute RSPH,X  as  the range of recorded values for the X-axis coordinate of the sphere centre.\nCompute RSPH,Y as  the range of recorded values for the Y-axis coordinate of the sphere centre.\nCompute RSPH,Z  as  the range of recorded values for the Z-axis coordinate of the sphere centre.",
        "6.3  Stylus tip offset test, A\n6.3.1  General\nPrior to test execution,  the stylus tip shall be centred to the spindle axis average line according to the \nmanufacturer's/supplier's instructions.\nSome enhanced probing system allow for automatic detection and compensation of stylus tip offset.  \nIf such performance exists,  the relevant manufacturer's/supplier's procedure shall be executed before \ntest execution.\n6.3.2  Test setup and procedure\nLocate a reference ring (or a reference sphere)  within the machine tool measuring volume.  When a \nreference ring is  being used,  align it to the MCS in order that the axis of the ring bore is  parallel to the \nZ-axis of the machine.\nCentre the reference ring bore (or the sphere)  to the spindle axis average line by using a linear \ndisplacement sensor and establish a WCS datum point at the identified centre.\nMeasure the centre coordinates of the reference ring bore (or the centre of the equator of the reference \nsphere)  by probing it with four points.  Repeat the measurement ten times,  recording the centre X-  and \nY-axis coordinates.\n6.3.3  Analysis of results\nCalculate X0  as  the average of the ten measured X-axis coordinates and Y0  as  the average of the ten \nmeasured Y-axis coordinates.\nThe offset,  A ,  of the stylus tip to the spindle axis average line,  is  given by Formula (1) :\nA X Y= +\n2  (1)\nThe calculated value for A  shall be noted as a possible component to subsequent tests measurement \nuncertainty.\nNOTE Stylus tip offset determined by this procedure includes the probing error,  PFTU,2D  (see 6.5) .",
        "6.4 Probing-tool location repeatability test,  RPTL,X,  RPTL,Y and RPTL,Z  (RProbing-Tool_\nThe aim of this test is  to evaluate the repeatability of the relocation of the probing tool with respect to \nthe MCS after a manual or an automatic tool change.\n6.4.2  Test setup and procedure\nSet up a reference ring with a bore diameter of approximately 25  mm and align it to the MCS in order \nthat the axis of the ring bore is  parallel to the Z-axis of the machine.\na)  Measure the centre coordinates of the reference ring bore by probing it with four points and \nmeasure the reference ring top surface by single-point probing.  Establish a WCS datum point at the \nmeasured centre of the reference ring and at the measured reference ring top surface.\nb)  Repeat the measurement,  recording the bore centre X-  and Y-axis coordinates and the Z-axis \ncoordinate.\nc)  Remove and relocate the probing tool.  If intended use foresees the use of an automatic tool changer,-\nbefore the probe is  returned to the spindle,  the tool changer shall be indexed by at least one position \nand returned in order to include the repeatability of this system.\nd)  Repeat the procedure nine times,  starting from item b) ,  in order to perform a total of ten \nmeasurements.\nIn some high-speed milling applications,  the tool holder is  not provided with driving dogs.  In such \napplications,  the relative angular position between the spindle and the probing tool is  not controlled.  \nIt is  therefore recommended to complement item c)  by subsequently incrementing the relative angular \nposition by approximately 15deg.\nA reference sphere may be used instead of the reference ring,  unless otherwise stated by the \nmanufacturer/supplier.  When using a reference sphere,  the sphere shall be probed with five points.  The \nWCS datum point shall be established at the measured centre of the sphere.\n6.4.3  Analysis of results\nCompute RPTL,X  as  the range of the recorded values of the X-axis coordinate of the bore centre.\nCompute RPTL,Y as  the range of the recorded values of the Y-axis coordinate of the bore centre.\nCompute RPTL,Z  as  the range of the recorded values of the Z-axis coordinates of the top surface.\nIf a reference sphere is  used,  RPTL,X,  RPTL,Y and RPTL,Z  shall be computed as the range of the recorded \nvalues of X,  Y and Z coordinates of the sphere centre.",
        "6.5 2D probing error test,  PFTU,2D  (PForm_Tactile_Unique,2D)\n6.5.1  General\nThe aim of this test is  to evaluate the 2D probing error of a particular probing system by measuring a \nreference ring calibrated for form. This error is  strongly influenced by the probing system pre-travel \nvariation,  which is  itself influenced by\na)  probing system and machine tool repeatability,\nb)  probe switching force,\nc)  stylus system length and construction,\ne)  approaching distance for measurement points,\nf)  probe qualification,\ng)  variation of time delay between probing signal and read-out of machine tool position transducers,\nh)  vibrations,  and\ni)  thermal drifts.\nNOTE Some enhanced probing systems can apply software compensation to minimize pre-travel variation.\nFigure 4  shows a representation of 2D probing error for a typical probing system.\nRelevant parameters,  such as probe switching force,  stylus system component length and material \ncomposition (e.g.  steel,  ceramics,  carbon fibre) ,  measurement feed speed and approaching distance \nfor measuring points shall be conforming to the manufacturer's/supplier's  specification.  If some \nparameters are not specified,  the user shall select them according to the intended use.\nThe number of probing points shall be agreed on between the manufacturer/supplier and the user,  \ntaking into account the intended use and the capabilities of the probing system. It is  nevertheless \nrecommended to acquire the coordinates of 36 points equally spaced along the ring circumference.\n6.5.2  Test setup and procedure\nSet up a reference ring with a bore diameter of approximately 25  mm and align it to the MCS in order \nthat the axis of the ring bore is  parallel to the Z-axis of the machine.\nMeasure the centre coordinates of the reference ring bore by probing it with four points.  Establish a \nWCS datum point at the measured centre of the reference ring.\nNext,  probe the reference ring in radial directions with the acquisition of the chosen number of points \nequally spaced along the ring circumference, recording the X- and Y-axis coordinates of every single point.\n6.5.3  Analysis of results\nThe centre of the measured circle is  computed using the manufacturer/supplier-recommended \nalgorithms (e.g.  the least square best fit) .  The coordinates of this centre shall be subtracted from the \nX- and Y-  coordinates of each point.  For each of the measured points,  radial distance,  r,  to  the centre is  \ncalculated as the square root of the sum of the squares of these coordinate differences.\nCalculate the probing error,  PFTU,2D,  as  the range of the measured radial distances,  rmax  -  rmin .\nThe probing error,  PFTU,2D,  can be represented on a polar plot (see Figure 4) .\nFigure 4 - Example of polar plot of PFTU,2D  values for a 36-point test",
        "6.6 3D probing error test,  PFTU,3D  (PForm_Tactile_Unique,3D)\nThis test is  similar to the test specified in 6.5  but its  aim is  to test the performance of a probing system \nwith 3D capabilities.  The general information presented in 6.5 .1  is  also applicable,  but the reference \nartefact is  a sphere calibrated for form.\nTypical probing systems propose sphere measurement by a very limited number of probing points \n(usually four or five points) .  Although intended use shall be taken into due account,  it is  considered \nthat the execution of the test described in this clause can provide valuable information for a better \nunderstanding of the probing system performance.\nThe number of probing points shall be agreed on between the manufacturer/supplier and the user,  \ntaking into account the intended use and the capabilities of the probing system. It is  nevertheless \nrecommended to acquire the coordinates of 25  points approximately evenly distributed over at least a \nhemisphere of the test sphere.\n6.6.2  Test setup and procedure\nA reference sphere with a nominal diameter of approximately 25  mm shall be used.  The form of the \nreference sphere shall be calibrated, since the form error influences the test results,  and shall be taken \ninto account for proving conformance or non-conformance with the specifications.\nMeasure the centre coordinates of the reference sphere by probing it with five points.  Establish a WCS \ndatum point at the measured centre of the reference sphere.\nProbe the reference sphere in 3D radial vector directions with the acquisition of the chosen number \nof points,  which are approximately evenly distributed over at least a hemisphere of the test sphere.  \nTheir position shall be at the discretion of the user and, if not specified,  the following probing pattern is  \nrecommended (see Figure 5):\na)  one point on the pole (defined by the direction of the spindle axis)  of the reference sphere;\nb)  four points (equally spaced)  22 ,5deg below the pole;\nc)  eight points (equally spaced)  45deg below the pole and rotated 22 ,5deg relative to the previous group;\nd)  four points (equally spaced)  67,5deg below the pole and rotated 22 ,5deg relative to the previous group;\ne)  eight points (equally spaced)  90deg below the pole (i.e.  on the equator)  and rotated 22 ,5deg relative to \nthe previous group.\nThe number of probing points and the recommended target positions have been selected for \ncompatibility with ISO 10360-5:2010, 6.2 .  For some applications,  this test may be performed by probing \n48 points,  approximately evenly distributed over at least a hemisphere of the test sphere.\n1 pole\nFigure 5  - 3D target contact points for 3D probing error test PFTU,3D\n6.6.3  Analysis of test results\nUsing all  available measurements,  the sphere centre is  computed using the manufacturer/supplier-\nrecommended algorithms (e.g.  the least square best fit) .  The coordinates of this centre shall be \nsubtracted from the X-,  Y-  and Z-axis coordinates of each point.  For each point,  radial distance,  r,  to the \ncentre is  calculated as the square root of the sum of the squares of these coordinate differences.\nCalculate the probing error PFTU,3D  as  the range of radial distances rmax  -  rmin .",
        "6.7 Workpiece position and orientation tests, EPLA,Z,  ELIN,Y,  ECOR,X,  ECOR,Y and ECOR,Z  (E \nPLAne,Z) ,  (E LINe,Y) ,  (E CORner coordinates,X,Y,Z)\n6.7.1 General\nIn many applications,  probing on a machine tool is  used to reference a workpiece within the MCS and to \nlocate it with respect to the spindle axis average line.  These tests are designed to evaluate this ability of \nBest practice suggests that the proper identification of the WCS with respect to the MCS is  performed in \nIf some steps of the suggested sequence are not performed (sometimes justified by projected time \nsaving) ,  assumptions are made that (if not corresponding to the real situation)  can result in improper \nWCS identification.\n6.7.1.1\t Identification\tof\tthe\tWCS\treference\tplane\nOn a machining centre,  the workpiece is  connected to the machine tool table (or connected to a support \nwhich is  connected to the machine table) .\nThere would be no need to identify the WCS reference plane (assumed to be parallel to the XY plane)  if \nit can be assumed that\na)  the machine tool table (or the workpiece support)  is  flat and parallel to the X-  and Y-axes of motion \n(that define the machine tool XY coordinate plane) ,\nb)  the bottom surface of the workpiece is  parallel to its reference surface,  and\nc)  there are no disturbing elements (e.g.  scratches,  dirt,  residual chips,  etc.)  influencing the connection \nbetween the workpiece and the table (or support) .\nWhen some of these conditions are not fulfilled,  it can be advantageous to measure the workpiece \nreference plane in order to identify it,  as  an alternative to physically adjusting the workpiece itself.\nTypical probing systems allow for measurement of a (nominally flat)  workpiece reference surface by \nprobing three points.  Other sophisticated probing systems can offer the option to define the workpiece \nreference surface by multiple probing on a (known)  surface,  comparing the measured surface points to \nthe mathematical model for the surface and applying best-fit strategies.\n6.7.1.2\t Identification\tof\tthe\tWCS\torientation\tin\tthe\treference\tplane\nTypical probing systems allow for alignment of the WCS orientation in the reference plane by defining \na line passing through two measured points on a (nominally)  flat surface or passing through the centre \ncoordinates of two cylindrical or spherical workpiece features.\nIt shall be noted that,  if the workpiece reference plane was not adjusted to be parallel to the machine \ntool XY coordinate plane (or measured and compensated for) ,  the measurement of a line would not \nproperly identify the WCS orientation in the reference plane.\n6.7.1.3  Location of the WCS datum point\nTypical probing systems allow, at least,  for the location of a datum point by combining the following \ncapabilities:\na)  setting of individual axes datum points by probing a point on a plane;\nb)  setting of the X-  and Y-axis  datum point on the corner between two planes or on the centre of a \nhole or boss;\nc)  setting of the X-,  Y-  and Z-axis datum point on the centre coordinate of a sphere or on a corner \nidentified as the intersection of three planes.\n6.7.1.4\t Influence\tof\tprobing\tsystem\tcharacteristics\ton\tworkpiece\tcoordinate\tsystem\t(WCS)\t\nidentification\n6.7.1.4.1  The main probing system characteristics that influence the identification of the WCS are\na)  probing system repeatability (see 6.2) ,\nb)  stylus tip offset error with respect to the spindle axis average line (see 6.3) ,\nc)  probing-tool location repeatability (see 6.4) ,\nd)  probing error (see 6.5  and 6.6) ,\ne)  effective stylus tip diameter (see 6.10) ,\nf)  variation of time delay between probing signal  and read-out of machine tool  position \ntransducers  (see 6 .9) ,\ng)  probe qualification,  and\nh)  thermal drifts.\nTable 1  presents a simplified representation of the influence of main characteristics on some common \nmeasuring tasks to possibly help define probing strategies.\nNOTE 1  Probing repeatability,  variation of time delay,  probe qualification and thermal drifts are not listed in \nTable 1  because,  in practical terms, they influence all  measuring tasks.\nNOTE 2  Blank cells  denote a very weak or insignificant influence of the specific characteristic on the \nmeasuring task.\nNOTE 3  Assumption is  made that WCS identification procedure is  performed without intermediate probing-\ntool changes.\nTable\t1\t-\tSimplified\trepresentation\tof\tthe\tinfluence\tof\tprobing\tsystem  \ncharacteristics on measuring tasks\nMeasuring task\nStylus tip \noffseta\nProbing-tool \nlocation  \nrepeatabilityb\nProbing \nerrorc\nEffective \nstylus tip di-\nameterd\nSingle point surface detection strong X,  Y strong strong X,  Y strong\nAngle of XY reference plane\nAngle of a line by two points\nAngle of a line passing through two centres\nLocation of a line by two points strong X,  Y strong strong strong\nLocation of a corner on a plane strong X,  Y strong X,  Y strong strong\nLocation of a corner as intersection of three \nplanes\nstrong X,  Y strong strong strong\nCentre location for a hole or boss strong X,  Y strong medium\nCentre location of a sphere strong X,  Y strong medium\na  See 6 .3 .\nb  See 6 .4.\nc  See 6 .5  and 6 .6.\nd  See 6 .10.\n6.7.1.4.2  Analysis of Table 1  and good practice would suggest the following:"
    ],
    "input": "ISO 10360-5:2010, Geometrical product specifications (GPS) - Acceptance and reverification  tests \nfor coordinate measuring machines (CMM) - Part 5: CMMs using single and multiple stylus contacting \n3\tTerms\tand\tdefinitions\nFor the purposes of this document,  the following terms and definitions apply.\nNOTE In measuring mode, machine tools are used like CMMs.  Therefore,  definitions for probing systems \nperformance tests for CMMs apply also for machine tools.  However,  since not all  machine tool users are familiar \nwith the use of CMMs, this part of ISO 230 provides definitions specifically with machine tools in mind, making \nsure that they do not create any conflicts with CMM definitions.\n3.1 General terms\n3.1.1\nmachine coordinate system\nMCS\ncoordinate system fixed with respect to physical or calculated axes of a machine tool\n[SOURCE:  ISO 10360-1:2000,  2 .5  - modified.]\n3.1.2\nworkpiece coordinate system\nWCS\ncoordinate system fixed with respect to a workpiece\n[SOURCE:  ISO 10360-1:2000, 2 .4]\n3.1.3\nmeasuring volume\nthree-dimensional space encompassing all  linear coordinates that are accessible for measurement on \nthe machine tool\n[SOURCE:  ISO 10360-1:2000,  2 .3  - modified.]\n3.2  Terms relating to the probing system\n3.2 .1\nprobe\ndevice that senses a feature and generates the signal(s)  during probing\n[SOURCE:  ISO 10360-1:2000,  3 .1  - modified.]\nNote 1  to entry:  There are several types of probes used on machine tools and they use different technologies to \nachieve the same aim.\nNote 2  to entry:  Probes can either be \"switching\" types or \"proportional\"  types.  These are all available as either \n\"contacting\" or \"non-contacting\" systems.  Non-contacting systems are not part of the scope of this part of ISO 230.\n3.2 .1.1\nswitching probe\nprobe that gives a binary signal as a result of contact with a surface being measured (detected)\n3.2 .1.2\nproportional probe\nprobe that gives a signal (analogue or digital)  proportional to a displacement of the stylus tip\n\n\nprobe that needs material contact with a surface being measured (detected)  in order to function\n[SOURCE:  ISO 10360-1:2000, 3 .2  - modified.]\nEXAMPLE Electrical circuit breakage,  strain gauge.\nNote 1  to entry:  The contacting feed speed applied to obtain the material contact can influence the performance \nof such probes.  Proper contacting feed speed is  specified in the manufacturer's/supplier's  instructions.\nNote 2  to entry:  For best performance,  the contacting feed speed applied during measurement is  the same as the \nfeed speed applied during probe qualification.\n3.2 .1.4\nnon-contacting probe\nprobe that needs no material contact with a surface being measured in order to function\n[SOURCE:  ISO 10360-1:2000, 3 .3  - modified.]\nEXAMPLE Optical and laser systems, inductive and capacitive systems.\nNote 1  to entry:  Non-contacting probes are not included in the scope of this part of ISO 230.\n3.2 .2\nprobing system\nsystem consisting of a probe  (3 .2 .1) ,  signal transmission system (e.g.  optical,  radio,  wire) ,  signal \nconditioning hardware,  the probing hardware and software and, where present,  probe extensions,  \nprobe changing system, stylus and stylus extensions,  when used in conjunction with a suitable \nnumerically controlled machine tool\n[SOURCE:  ISO 10360-1:2000, 2 .6 - modified.]\nNote 1  to entry:  Tests specified in this part of ISO 230 are referred to probing systems consisting of contacting \nprobes equipped with a single stylus system that is  parallel to  the machine tool spindle axis average line,  as \ndepicted in Figure 2 .  For applications using stylus systems equipped with multiple styli (see Figure 3) ,  and for \napplication where measurement is  performed by using multiple orientations of the spindle axis average line with \nrespect to the WCS, additional tests are specified in ISO 10360-5.\n3.2 .3\nprobing\tsystem\tqualification\nestablishment of the parameters of a probing system (based on manufacturer's/supplier's instructions)  \nnecessary for subsequent measurements\nNote 1  to entry:  Effective stylus tip diameter (3 .2 .5)  and location of the stylus tip centre with respect to the MCS \nare typical parameters established by probing system qualification.\nNote 2  to entry:  Suppliers'  technical literature sometimes refers to probing system qualification with the \nexpression \"probing system calibration\";  this expression is  not appropriate.\n3.2 .4\npre-travel\ndistance between the point of first material contact of the probe stylus tip with the surface being \nmeasured (detected)  and the point where the probe signal is  generated\nNote 1  to entry:  Pre-travel is  affected by probe construction,  probing direction,  probing speed, switching force,  \nstylus system length and compliance,  time delay between probing signal and machine tool position transducer \nread-out,  etc.\nNote 2  to entry:  Pre-travel variation (commonly referred to as \"lobing\") ,  under specified probing conditions,  is  a \nvery important probing system characteristic.\nNote 3  to entry:  Some probe qualification techniques can significantly reduce the effects of probing system pre-\ntravel variation.\n\n\neffective stylus tip diameter\neffective stylus tip size\nstylus tip dimension used by some probing software to compensate for measured feature size,  etc.\nNote 1  to  entry:  The effective stylus tip diameter (size)  is  associated with probing system performance and is  \ndetermined by appropriate probing system qualification,  rather than by simply measuring the stylus tip size.\n3.2 .6\nstylus tip\nphysical element that establishes the contact with the object to measure\n[SOURCE:  ISO 10360-1:2000,  4.2  - modified.]\n3.2 .7\nstylus system\nsystem composed of a stylus and stylus extension(s)  (if any)\n[SOURCE:  ISO 10360-1:2000,  4.4 - modified.]\nNote 1  to entry:  Stylus extensions can reduce stylus system stiffness and can adversely influence probing system \nperformance.  Therefore,  performance tests are carried out using the particular stylus extension(s)  of interest.\n3.2 .8\nstylus system length\n<spherical stylus tip> distance from the centre of the stylus tip to the shoulder of the stylus system\nNote 1  to entry:  See Figure 1 .\nKey\na stylus system length\nFigure 1  - Stylus system length\n3.2 .9\nprobing tool\ndevice consisting of a probe and its stylus system, attached to a tool holder\nNote 1  to entry:  See Figure 2 .\n3.2 .10\nprobing-tool length\ndistance from the most protruding point of the stylus tip to the machine tool spindle reference surface \nor gauge line that connects to the probing tool\nNote 1  to entry:  See Figure 2 .\nNote 2  to entry:  Some probing systems establish the probing-tool length as the distance from the centre of the \nstylus tip surface to the machine tool spindle reference surface that connects to the probing tool.\nNote 3  to entry:  For solid-shank-type tool holders,  the spindle reference surface is  at the spindle cone gauge line.  \nFor other tool holders (hollow shank) ,  the spindle reference surface is  the spindle face.\nNote 4 to entry:  The procedure for establishing the length of the probing tool is  specified in \nmanufacturer's/supplier's instructions.\n\n\n1 spindle\n2 tool holder\n4 stylus\nL probing-tool length\nFigure 2  - Probing-tool length\n3.2 .11\nstylus tip offset\neffective distance from the centre of the stylus tip to the axis average line of the spindle,  in which the \nprobing tool is  mounted\n3.3  Terms relating to probing\n3.3.1\nprobing\nprobe\nmeasurement action that results in the determination of values (e.g.  coordinate values,  length values,  \nfalse/true values)\n[SOURCE:  ISO 10360-1:2000, 2 .7 - modified.]\nNote 1  to  entry:  Probing associated with the measurement of cutting tools does not necessarily result in the \ndetermination of coordinate values.\nNote 2  to entry:  Probing associated with tool breakage detection results in the determination of a false/true state.\n3.3.1.1\n1D probing\nmeasurement allowing for probing motion parallel to one machine coordinate system axis or to one \nworkpiece coordinate system axis at one time only\nNote 1  to entry:  1D measurement capability is  associated with the probing system performance,  not only with \nthe contacting probe capabilities.\n2D probing\nmeasurement allowing for probing motion along a vector in a plane\nNote 1  to entry:  Typical contacting probes that operate in the -X,  +X,  -Y,  +Y and -Z directions,  and in any \ncombination of such directions,  are sometimes referred to as 2 ,5D probes.  These contacting probes do not allow \nfor (or allow for very limited)  traction in the +Z direction.\n\n\nNote 2  to  entry:  Measurement in the +Z direction capability can be obtained by the use of stylus systems equipped \nwith multiple styli,  as  depicted in Figure 3 ,  where stylus tip 2  (moving in the +Z direction)  contacts the workpiece \nsurface and causes the probe to generate the signal as a consequence of the deflection in the -Z direction.\nNote 3  to entry:  Independent qualification for stylus tip 1  and for stylus tip 2 ,  and additional tests,  are specified \nin ISO 10360-5.\n1 stylus tip 1\n2 stylus tip 2\n3 spindle\n4 tool holder\n5 probe\n6 workpiece\nFigure 3  - Probing-tool equipped with 2  styli\n3.3.1.3\n3D probing\nmeasurement allowing for probing motion along any vector in space\n3.3.2\nprobing repeatability\ndegree of closeness of coordinate values provided by the probing system when it is  repeatedly applied \nto the same measurand under the same test conditions\nNote 1  to entry:  This definition specifically refers to the scope of this part of ISO 230 and the probing systems \nunder test;  it is  not extended to the general definition associated with the metrological characteristics defined in \nother International Standards.\nNote 2  to entry:  Probing repeatability can be expressed quantitatively in terms of the dispersion characteristics \nof the measured values or by the range of measured values.\nNote 3  to entry:  Probing repeatability relates to the complete probing system. It is  not comparable with \"probe \nrepeatability\" as defined in the probe suppliers'  handbooks.\n\n\nerror within which the range of the radii of a reference artefact can be determined by a machine tool \nusing one stylus system\nNote 1  to entry:  The symbol,  PFTU,  is  taken from ISO 10360-5:2010, 3 .6 and 3 .9.  The character P indicates that \nthe error is  related primarily to the probing system performance,  the character F indicates that it is  a form error,  \nthe character T refers to a contacting (tactile)  probing system and the character U indicates the use of a single \n(unique)  stylus.\nNote 2  to entry:  A typical reference artefact for 2D probing is  a ring calibrated for form. A typical reference \nartefact for 3D probing is  a sphere calibrated for form.\nNote 3  to  entry:  2D probing error is addressed in 6.5  and 3D probing error is  addressed in 6 .6.\n3.4 Terms relating to scanning probes (See Annex B)\n3.4.1\nrest position\nposition of the centre of the probe's  stylus  tip  when it is  stationary and not deflected by contact \nwith a surface\nNote 1  to entry:  The rest position is  a nominal position that is  established during qualification.  The actual rest \nposition at any time typically varies slightly from this value.\n3.4.2\nmaximum\tscanning\tdeflection\nmaximum deflection that can be applied to the centre of the probe's  stylus tip during a scanning \nmeasurement specified by the manufacturer\nNote 1  to  entry:  The maximum scanning deflection can vary with direction of deflection (x,y,z) .\n3.4.3\nprobe over-travel limit\nmaximum deflection of the centre of the probe stylus tip from the rest position that can be applied \nwithout causing damage to the probe stylus assembly\n3.4.4\nminimum\tscanning\tdeflection\nminimum deflection of the centre of the stylus tip from its  rest position that is  allowed during a \nscanning measurement\nNote 1  to entry:  Deflection is  programmed to be large enough to ensure that the stylus tip maintains contact \nwith the surface throughout the measurement.\n3.4.5\nscanning measurement range\nmaximum allowed distance between the nominal scan line and the actual scan line,  as  specified by the \nmanufacturer/supplier\nNote 1  to entry:  This distance may be expressed separately for the different axes of the probe,  e.g.  +-  0,3  mm in X \nand Y,  +-  0,2  mm in Z .\nNote 2  to entry:  The scanning measurement range is  less than the difference between the maximum scanning \ndeflection and the minimum scanning deflection for a number of reasons,  including\n- deviation from the pre-defined tool-path caused by machine tool path following errors,\n- approximations during tool-path generation (e.g.  approximating a curve by straight line segments) ,  and\n\n\n- additional probe deflection caused by movement along the surface (e.g.  friction,  local surface normal \ndeviations,  surface finish) .\nstylus tip normal acceleration\nacceleration of the centre of the stylus  tip  relative to  the surface being measured,  normal to  the \ntarget surface\nNote 1  to entry:  Stylus tip normal acceleration is  sometimes considered to limit the scanning feed speed for \nfeatures that have sharp scanning path variations,  and would therefore demand high rates of acceleration from \nthe machine tool axes.  Scanning performance is  affected mostly by acceleration normal to the surface being \nmeasured, as machine position errors in the direction of the target scan line do not usually lead to significant \nmeasurement errors.\n3.4.7\nindicated tip centre point\nindicated position of the centre of the stylus tip during a measurement\nNote 1  to entry:  This is  also known as an \"indicated measured point\" (see ISO 10360-1:2000, 2 .12) .\n3.4.8\nscanning sphere centre position reproducibility\nmaximum variation of the sphere centre positions obtained through multiple measurements compared \nto the sphere centre position obtained by the first measurement\n3.4.9\npre-defined\tpath\tscanning\nmethod of scanning in which the motion of the probing system between two defined end points is  \ndirected by a target scan line\n[SOURCE:  ISO 10360-1:2000, 7.5]\nNote 1  to  entry:  In this method of scanning,  feedback from the probing system is  not used to direct the motion of \nthe probing system.\n4 Preliminary remarks\n4.1\tInfluences\ton\tthe\tmeasurement\tperformance\tof\tthe\tprobing\tsystem\nMeasurement performance of the probing system includes the machine tool characteristics over a \nlimited,  small volume and shall not be simply derived from the stand-alone probe specifications.\nThe main influences on performance of probing systems of a machine tool are the following:\na)  repeatability of machine tool;\nb)  geometric accuracy of machine tool,  i .e.  positioning accuracy (including resolution,  backlash) ,  \nstraightness,  roll,  pitch,  yaw error motion,  squareness between axes,  etc.;\nc)  contamination of surfaces being measured (detected);\nd)  probing error and repeatability of probing system, including probing-tool changing and relocation;\nf)  temperature influences on machine tool,  probing system, artefact and workpiece/tool,  including \ndrift of moving axes and spindles;\ng)  feed speed and accelerations during measurement;\nh)  standoff and overtravel distances;\n8 (C) ISO 2016 - All rights reserved\n\n\ni)  time delay and time delay variation between probing signal and read-out of machine tool \nposition transducers;\nj )  surface of workpiece/tool probed.\nWorkpiece probing repeatability shall be checked in accordance with the tests in 6.2 ;  probing-tool \nlocation repeatability shall be checked in accordance with the test in 6.4;  tool setting repeatability shall \nbe checked in accordance with the tests in 7.3 .\nTesting for performance of workpiece probing system and geometric accuracy of the machine tool (in a \nlimited,  small volume)  is  given in 6.5  and 6.6.\nTesting for time delay variation between probing signal and read-out of machine position transducers \nis  given in 6.9;  feature size measurement performance tests are given in 6.10.\nTemperature influences are best observed using procedures given in 5.2  and in ISO 230-3 .\n4.2  Measurement units\nIn this part of ISO 230,  all linear dimensions and deviations are expressed in millimetres.  All  angular \ndimensions are expressed in degrees.  Angular deviations are,  in principle,  expressed in ratios but \nin some cases,  microradians or arc-seconds may be used for clarification purposes.  The following \nexpression should be used for conversion of the units of angular deviations or tolerances:\n0,010/1  000 =  10  mrad ~ 2\"\n4.3  Reference to ISO 230-1\nTo apply this part of ISO 230,  reference should be made to ISO 230-1,  especially for the installation of \nthe machine before testing.\n4.4 Recommended instrumentation and test equipment\nThe measuring instruments indicated in the tests described in the following clauses are examples \nonly.  Other instruments measuring the same quantities and having the same or smaller measurement \nuncertainty may be used.  Linear displacement sensors shall have a resolution of 0,001  mm or better.\n4.5 Machine conditions prior to testing\nBefore starting the measurements,  the machine tool geometric performance shall be assessed in \naccordance with relevant International Standards (e.g.  ISO 230-1,  ISO 230-2 ,  ISO 230-3,  ISO 10791-1) .\nNOTE Appropriate national standards can apply.\nIn addition,  the procedures for probe configuration and qualification shall be performed according to \nthe conditions specified by the manufacturer/supplier.\n4.6 Testing sequence\nThe sequence in which the tests are presented in this part of ISO 230  does not define the practical order \nof testing.  The tests described in Clauses 5,  6 and 7  may be performed either singly or in any combination.\n4.7 Tests to be performed\nWhen testing a machine,  it is  neither always necessary nor possible to carry out all the tests described in \nthis part of ISO 230.  When the tests are required for acceptance purposes,  it is  up to the user to choose,  \nin agreement with the manufacturer/supplier,  those tests which are of interest.  These tests shall be \nclearly stated when ordering a machine.  Mere reference to this part of ISO 230 for the acceptance tests,  \n\n\nwithout specifying the tests that shall be carried out,  and without agreement on the relevant expenses,  \ncannot be considered binding for any contracting party.\n4.8 Sources of test uncertainty\nThe tests described in this part of ISO 230 reveal the characteristics of the probing system as a \nmeasuring instrument.  Therefore,  they are characteristically different from the tests described in \nother parts of ISO 230.  For example,  when testing the repeatability of positioning of a numerically \ncontrolled machine tool axis,  the aim is  to determine the repeatability of a specific machine tool \ncharacteristic under specified repeated measurement conditions.  It shall be considered that this part of \nISO 230 focuses on the determination of the performances of a specific measuring system:  the probing \nsystem itself;  therefore,  consideration is  made to estimate test uncertainty components rather than \nmeasurement uncertainty components as specified by ISO/TR 230-9.\nValuable information may be gathered from ISO/TS 23165.\nThe main contributors to  the test uncertainty for probing system measurement performance tests \nare as  follows:\n- the uncertainty of the calibration of the reference artefact,  i.e.  test ring or test sphere, where applicable;\n- the alignment of the reference ring(s) ,  where applicable;\n- the fixturing of the reference artefact,  where applicable;\n- the compensation of thermally induced errors, when measuring at temperatures outside the \nmanufacturer's/supplier's environmental temperature guidelines,  performed in accordance with 5.1;\nNOTE If tests are performed at temperatures complying with the manufacturer's/supplier's  guidelines \nor if no environmental temperature guidelines are given,  the test results properly represent the metrological \ncharacteristics of the probing system under test;  therefore,  there is  no contribution to the test uncertainty.\n- the environmental temperature variation error (ETVE or drift)  during the time of measurement,  \nrespectively the repeatability of the measurements due to the actual test environment exceeding \nthe manufacturer's/supplier's environmental temperature guidelines.\n4.9 Reporting of test results\nRelevant parameters of the test shall be reported, including the following:\na)  identification of machine tool;\nb)  identification of measuring software;\nc)  identification of probe/sensor;\nd)  identification of stylus system components and length;\ne)  probe switching force setting,  where applicable;\nf)  position and orientation of the probe/sensor,  if not fixed by design of the machine tool;\ng)  type,  dimension and identification of artefact or tool measured;\nh)  location of the artefact in the machine tool measuring volume, where applicable;\ni)  feed speed during probe qualification and during test;\nj)  probing distance during probe qualification and during test;\nk)  probing points number and distribution;\nl)  programmed spindle speed, where applicable;\n\n\nm)  relevant machine temperatures and ambient temperatures;\nn)  warm-up cycle.\n5\tThermal\tinfluences\nAccording to ISO 1,  the reference temperature for industrial dimensional measurements is  20  degC;  \ntherefore,  the measuring instruments and the measured objects should be in equilibrium with the \nenvironment where the temperature is  kept at 20 degC .  If the environment is  at a temperature other than \n20 degC,  nominal differential thermal expansion (NDE)  correction between the measurement system and \nthe measured object shall be made to correct the results to correspond to 20  degC .  Built-in NDE correction,  \nused for the normal operation of the machine tool,  shall be used;  additional NDE correction,  just for the \nmeasurements,  shall not be used to correct the thermal distortions of machine position transducers.\n5.2  Environmental temperature variation error (ETVE)  test\nAn ETVE test (as specified in ISO 230-3:2007, Clause 5)  shall be conducted prior to the probe evaluation \ntests.  The duration of the ETVE test should be agreed on between the manufacturer/supplier and user \nand should include the anticipated probing time.\nETVE tests are designed to reveal the effects of environmental temperature changes on the machine.  \nThey shall not be used for machine comparison.\nThe manufacturer/supplier (of the machine tool or of the probing system)  shall define the thermal \nenvironment in which the specified probing system performance can be achieved.  It shall be \nthe responsibility of the user to provide an acceptable thermal environment for the probing \noperation.  However,  if the user follows the guidelines provided by the probing system/machine \nmanufacturer/supplier,  or if no guidelines are provided, the responsibility for probing performance \naccording to the specification reverts to the machine tool or probing system manufacturer/supplier.\nIf probing capability is  added to an existing machine,  specification for thermal environment is  subject \nto an agreement between the manufacturer/supplier and the user.\nThe ETVE test shall be performed probing a sphere/a ring/a plane several times and evaluating the \nchange of the sphere centre/circle centre coordinates or the plane location.  The test should last for a \nperiod that equates to the nominal duration of the probing system tests.\nThe presentation of the results shall be in accordance with ISO 230-3:2007, 5 .3 .\n5.3  Other thermal distortion tests\nIf the probing system is applied just after machining operations or between machining operations,  the \neffects of cooling of the machine tool,  especially the machine tool spindle,  shall be considered.  In such \ncases,  a temperature variation error test shall be carried out after warming up of the main spindle \nand/or machine tool axes,  e.g.  by performing movements of a typical machining operation prior to \nmeasurements.  The machine tool movements that shall be performed (for instance spindle speed, \nduration of movement,  movement of axes,  feed speeds)  for the temperature variation error test are \nsubject to agreement between the manufacturer/supplier and user and shall consider the typical \noperations of the machine tool.\nIndividual performance tests in Clauses 6 and 7  may be carried out after performing typical \nmovements corresponding to machining operations,  which are subject to agreement between the \nmanufacturer/supplier and user.\n\n\n6 Probing of workpiece\n6.1 General\nProbes used on machining centres for the probing of workpiece are typically connected to the machine \ntool spindle.  For many probing applications,  the centre of the stylus tip should be located on the spindle \naxis average line in order to allow for proper identification of the workpiece coordinate system (WCS)  \nwith respect to the machine coordinate system (MCS) .  In other typical applications (for example:  \nmeasurement of the distance between two nominally parallel machined surfaces,  measurement of the \ndiameter of a hole or a boss,  etc.) ,  where the alignment of the stylus tip to the spindle axis average line \nis  not of primary concern, care should be taken to ensure that the spindle orientation with respect to \nthe MCS does not change during subsequent probing in order to avoid the stylus tip offset becoming a \nsignificant component of probing error.\nPrior to test execution,  stylus tip on-centre adjustment shall be performed according to the \nmanufacturer's/supplier's instructions.  The adjustment procedure shall be repeated whenever the \nstylus system connection to the probe is  altered.  This includes disassembling and re-assembling the \nsame stylus tip as different assembling torques can possibly change the stylus tip centre position.\nProbing system qualification shall be performed according to the manufacturer's/supplier's  instructions \nand shall be repeated after stylus tip on-centre adjustment.\nSuppliers'  technical literature sometimes refers to probing system qualification with the expression \n\"probing system calibration\";  this  expression is  not appropriate and should be avoided.\nTests in this part of ISO 230 are presented assuming that the probing system is  aligned with the machine \ntool Z-axis of motion and that the stylus tip centre is  aligned with the spindle axis average line,  assumed \nto be nominally parallel to the Z-axis of motion.  For applications using tilting or indexing heads,  for any \nnew orientation,  probing system qualification shall be performed again.  For such applications,  use of \nISO 10360-5  is  recommended.\nThe user is  free,  where applicable,  to choose the location in which to mount the reference artefact \nwithin the specified measuring volume.  However,  the reference artefact shall not be placed at a location \nused for the probing system qualification.\nThe reference artefact should always be mounted and clamped to ensure sufficient setup rigidity when \nsubmitted to the specific probing system switching force,  yet avoiding deformation of the artefact.  \nMachine tool probe switching force may vary from as little as 0,2  N for strain gauge switching probes \nto a few newtons for conventional switching probes.  Switching force for the Z-axis direction is  typically \nsignificantly higher than the X-  and Y-axis direction switching force.\n6.2  Probing repeatability\n6.2.1  General\nTypical workpiece probing systems for machining centres offer measuring capabilities designed to \nperform quick, simplified in-process measurements and measurement of the workpiece after machining,  \nbut while still  on the machine.  Such systems usually provide information on the size and the location of \nworkpiece features,  such as holes,  bosses,  web, pockets,  corners and single-point surface measurements,  \nbut they usually do not provide evaluation of form error of the measured workpiece feature.\nEnhanced machine tool probing systems exist that offer complex measurement capabilities,  such as \nmeasurement of free-form deviation from the mathematical model.  Other probing systems allow for the \nimplementation of measurement strategies that are typically available only on CMMs.\nProbing repeatability should,  in principle,  be associated with every single measuring task that can be \nperformed by a specific probing system.  This approach would lead to a significant testing effort that is  \nconsidered to be unjustified.\n\n\nA workpiece probing system is typically used for workpiece position and orientation measurements \naimed at locating the WCS with respect to the MCS, and for simple feature location and size measurements.  \nProbing repeatability tests are therefore specified for flat-surface location measurements,  and cylinder \nand sphere centre location measurements.\nProbing repeatability for size measurements is  addressed in 6.10.\n6.2.2  Probing repeatability test for single-point surface measurement, RSPT,X,  RSPT,Y  and RSPT,Z   \n(RSingle_PoinT,X,Y,Z)\n6.2.2.1  General\nIt shall be noted that single-point surface measurement is  an extremely simplified measuring method.  \nThe determination of the coordinates of a single point of a (flat)  surface can be assumed to individually \nrepresent the (flat)  surface itself only when the orientation and position of the surface with respect to \nthe relevant coordinate system are known.\n6.2.2.2  Test setup and procedure\nSelect a test artefact (block)  with at least three flat surfaces  nominally square to  each other.  For \nmost applications,  a standard gauge block,  with side surfaces'  flatness  within 0,080  mm is  adequate \nfor this  test.\nNOTE The test artefact referred to in 6.7.2  can also be suitable for this test.\nAlign the test artefact to the MCS in order to orient the three planes square to the X-,  Y-  and Z-axis,  \nrespectively.\nAcquire and record the X-axis coordinate of a contact point approaching the test artefact surface in the \nX-axis direction.  Repeat the acquisition and the recording of the X-axis coordinate values nine times for \na total of ten measurements.\nRepeat the procedure for the Y-axis and for the Z-axis.\n6.2.2.3  Analysis of results\nCompute RSPT,X  as  the range of recorded values for the X-axis coordinate.\nCompute RSPT,Y as  the range of recorded values for the Y-axis coordinate.\nCompute RSPT,Z  as  the range of recorded values for the Z-axis coordinate.\n6.2.3  Probing repeatability test for circle centre location, RCIR,X  and RCIR,Y (RCIRcle,X,Y)\n6.2.3.1  Test setup and procedure\nSet up a reference ring with a bore diameter of approximately 25  mm and align it to the MCS in order \nthat the axis of the ring bore is  parallel to the Z-axis of the machine.\nMeasure the centre coordinates of the reference ring bore by probing it with four points.  Establish a \nWCS datum point at the measured centre.\nRepeat the measurement ten times,  recording the bore centre X-  and Y-  axis coordinates.\nCompute RCIR,X  as  the range of recorded values for the X-axis coordinate of the centre.\nCompute RCIR,Y as  the range of recorded values for the Y-axis coordinate of the centre.\n\n\n6.2.4 Probing repeatability test for sphere centre location, RSPH,X,  RSPH,Y and RSPH,Z  (RSPHere,  X,Y,Z)\n6.2.4.1  Test setup and procedure\nSet up a reference sphere with a nominal diameter of approximately 25  mm.\nMeasure the centre coordinates of the reference sphere by probing it with five points according to the \nmanufacturer's/supplier's instructions.  Establish a WCS datum point at the measured centre of the \nreference sphere.\nRepeat the measurement ten times,  recording the sphere centre X-,  Y-  and Z-axis coordinates.\n6.2.4.2  Analysis of results\nCompute RSPH,X  as  the range of recorded values for the X-axis coordinate of the sphere centre.\nCompute RSPH,Y as  the range of recorded values for the Y-axis coordinate of the sphere centre.\nCompute RSPH,Z  as  the range of recorded values for the Z-axis coordinate of the sphere centre.\n6.3  Stylus tip offset test, A\n6.3.1  General\nPrior to test execution,  the stylus tip shall be centred to the spindle axis average line according to the \nmanufacturer's/supplier's instructions.\nSome enhanced probing system allow for automatic detection and compensation of stylus tip offset.  \nIf such performance exists,  the relevant manufacturer's/supplier's procedure shall be executed before \ntest execution.\n6.3.2  Test setup and procedure\nLocate a reference ring (or a reference sphere)  within the machine tool measuring volume.  When a \nreference ring is  being used,  align it to the MCS in order that the axis of the ring bore is  parallel to the \nZ-axis of the machine.\nCentre the reference ring bore (or the sphere)  to the spindle axis average line by using a linear \ndisplacement sensor and establish a WCS datum point at the identified centre.\nMeasure the centre coordinates of the reference ring bore (or the centre of the equator of the reference \nsphere)  by probing it with four points.  Repeat the measurement ten times,  recording the centre X-  and \nY-axis coordinates.\n6.3.3  Analysis of results\nCalculate X0  as  the average of the ten measured X-axis coordinates and Y0  as  the average of the ten \nmeasured Y-axis coordinates.\nThe offset,  A ,  of the stylus tip to the spindle axis average line,  is  given by Formula (1) :\nA X Y= +\n2  (1)\nThe calculated value for A  shall be noted as a possible component to subsequent tests measurement \nuncertainty.\nNOTE Stylus tip offset determined by this procedure includes the probing error,  PFTU,2D  (see 6.5) .\n\n\n6.4 Probing-tool location repeatability test,  RPTL,X,  RPTL,Y and RPTL,Z  (RProbing-Tool_\nThe aim of this test is  to evaluate the repeatability of the relocation of the probing tool with respect to \nthe MCS after a manual or an automatic tool change.\n6.4.2  Test setup and procedure\nSet up a reference ring with a bore diameter of approximately 25  mm and align it to the MCS in order \nthat the axis of the ring bore is  parallel to the Z-axis of the machine.\na)  Measure the centre coordinates of the reference ring bore by probing it with four points and \nmeasure the reference ring top surface by single-point probing.  Establish a WCS datum point at the \nmeasured centre of the reference ring and at the measured reference ring top surface.\nb)  Repeat the measurement,  recording the bore centre X-  and Y-axis coordinates and the Z-axis \ncoordinate.\nc)  Remove and relocate the probing tool.  If intended use foresees the use of an automatic tool changer,-\nbefore the probe is  returned to the spindle,  the tool changer shall be indexed by at least one position \nand returned in order to include the repeatability of this system.\nd)  Repeat the procedure nine times,  starting from item b) ,  in order to perform a total of ten \nmeasurements.\nIn some high-speed milling applications,  the tool holder is  not provided with driving dogs.  In such \napplications,  the relative angular position between the spindle and the probing tool is  not controlled.  \nIt is  therefore recommended to complement item c)  by subsequently incrementing the relative angular \nposition by approximately 15deg.\nA reference sphere may be used instead of the reference ring,  unless otherwise stated by the \nmanufacturer/supplier.  When using a reference sphere,  the sphere shall be probed with five points.  The \nWCS datum point shall be established at the measured centre of the sphere.\n6.4.3  Analysis of results\nCompute RPTL,X  as  the range of the recorded values of the X-axis coordinate of the bore centre.\nCompute RPTL,Y as  the range of the recorded values of the Y-axis coordinate of the bore centre.\nCompute RPTL,Z  as  the range of the recorded values of the Z-axis coordinates of the top surface.\nIf a reference sphere is  used,  RPTL,X,  RPTL,Y and RPTL,Z  shall be computed as the range of the recorded \nvalues of X,  Y and Z coordinates of the sphere centre.\n6.5 2D probing error test,  PFTU,2D  (PForm_Tactile_Unique,2D)\n6.5.1  General\nThe aim of this test is  to evaluate the 2D probing error of a particular probing system by measuring a \nreference ring calibrated for form. This error is  strongly influenced by the probing system pre-travel \nvariation,  which is  itself influenced by\na)  probing system and machine tool repeatability,\nb)  probe switching force,\nc)  stylus system length and construction,\n\n\ne)  approaching distance for measurement points,\nf)  probe qualification,\ng)  variation of time delay between probing signal and read-out of machine tool position transducers,\nh)  vibrations,  and\ni)  thermal drifts.\nNOTE Some enhanced probing systems can apply software compensation to minimize pre-travel variation.\nFigure 4  shows a representation of 2D probing error for a typical probing system.\nRelevant parameters,  such as probe switching force,  stylus system component length and material \ncomposition (e.g.  steel,  ceramics,  carbon fibre) ,  measurement feed speed and approaching distance \nfor measuring points shall be conforming to the manufacturer's/supplier's  specification.  If some \nparameters are not specified,  the user shall select them according to the intended use.\nThe number of probing points shall be agreed on between the manufacturer/supplier and the user,  \ntaking into account the intended use and the capabilities of the probing system. It is  nevertheless \nrecommended to acquire the coordinates of 36 points equally spaced along the ring circumference.\n6.5.2  Test setup and procedure\nSet up a reference ring with a bore diameter of approximately 25  mm and align it to the MCS in order \nthat the axis of the ring bore is  parallel to the Z-axis of the machine.\nMeasure the centre coordinates of the reference ring bore by probing it with four points.  Establish a \nWCS datum point at the measured centre of the reference ring.\nNext,  probe the reference ring in radial directions with the acquisition of the chosen number of points \nequally spaced along the ring circumference, recording the X- and Y-axis coordinates of every single point.\n6.5.3  Analysis of results\nThe centre of the measured circle is  computed using the manufacturer/supplier-recommended \nalgorithms (e.g.  the least square best fit) .  The coordinates of this centre shall be subtracted from the \nX- and Y-  coordinates of each point.  For each of the measured points,  radial distance,  r,  to  the centre is  \ncalculated as the square root of the sum of the squares of these coordinate differences.\nCalculate the probing error,  PFTU,2D,  as  the range of the measured radial distances,  rmax  -  rmin .\nThe probing error,  PFTU,2D,  can be represented on a polar plot (see Figure 4) .\n\n\nFigure 4 - Example of polar plot of PFTU,2D  values for a 36-point test\n6.6 3D probing error test,  PFTU,3D  (PForm_Tactile_Unique,3D)\nThis test is  similar to the test specified in 6.5  but its  aim is  to test the performance of a probing system \nwith 3D capabilities.  The general information presented in 6.5 .1  is  also applicable,  but the reference \nartefact is  a sphere calibrated for form.\nTypical probing systems propose sphere measurement by a very limited number of probing points \n(usually four or five points) .  Although intended use shall be taken into due account,  it is  considered \nthat the execution of the test described in this clause can provide valuable information for a better \nunderstanding of the probing system performance.\nThe number of probing points shall be agreed on between the manufacturer/supplier and the user,  \ntaking into account the intended use and the capabilities of the probing system. It is  nevertheless \nrecommended to acquire the coordinates of 25  points approximately evenly distributed over at least a \nhemisphere of the test sphere.\n6.6.2  Test setup and procedure\nA reference sphere with a nominal diameter of approximately 25  mm shall be used.  The form of the \nreference sphere shall be calibrated, since the form error influences the test results,  and shall be taken \ninto account for proving conformance or non-conformance with the specifications.\nMeasure the centre coordinates of the reference sphere by probing it with five points.  Establish a WCS \ndatum point at the measured centre of the reference sphere.\nProbe the reference sphere in 3D radial vector directions with the acquisition of the chosen number \nof points,  which are approximately evenly distributed over at least a hemisphere of the test sphere.  \nTheir position shall be at the discretion of the user and, if not specified,  the following probing pattern is  \nrecommended (see Figure 5):\na)  one point on the pole (defined by the direction of the spindle axis)  of the reference sphere;\nb)  four points (equally spaced)  22 ,5deg below the pole;\nc)  eight points (equally spaced)  45deg below the pole and rotated 22 ,5deg relative to the previous group;\nd)  four points (equally spaced)  67,5deg below the pole and rotated 22 ,5deg relative to the previous group;\ne)  eight points (equally spaced)  90deg below the pole (i.e.  on the equator)  and rotated 22 ,5deg relative to \nthe previous group.\n\n\nThe number of probing points and the recommended target positions have been selected for \ncompatibility with ISO 10360-5:2010, 6.2 .  For some applications,  this test may be performed by probing \n48 points,  approximately evenly distributed over at least a hemisphere of the test sphere.\n1 pole\nFigure 5  - 3D target contact points for 3D probing error test PFTU,3D\n6.6.3  Analysis of test results\nUsing all  available measurements,  the sphere centre is  computed using the manufacturer/supplier-\nrecommended algorithms (e.g.  the least square best fit) .  The coordinates of this centre shall be \nsubtracted from the X-,  Y-  and Z-axis coordinates of each point.  For each point,  radial distance,  r,  to the \ncentre is  calculated as the square root of the sum of the squares of these coordinate differences.\nCalculate the probing error PFTU,3D  as  the range of radial distances rmax  -  rmin .\n6.7 Workpiece position and orientation tests, EPLA,Z,  ELIN,Y,  ECOR,X,  ECOR,Y and ECOR,Z  (E \nPLAne,Z) ,  (E LINe,Y) ,  (E CORner coordinates,X,Y,Z)\n6.7.1 General\nIn many applications,  probing on a machine tool is  used to reference a workpiece within the MCS and to \nlocate it with respect to the spindle axis average line.  These tests are designed to evaluate this ability of \n\n\nBest practice suggests that the proper identification of the WCS with respect to the MCS is  performed in \nIf some steps of the suggested sequence are not performed (sometimes justified by projected time \nsaving) ,  assumptions are made that (if not corresponding to the real situation)  can result in improper \nWCS identification.\n6.7.1.1\t Identification\tof\tthe\tWCS\treference\tplane\nOn a machining centre,  the workpiece is  connected to the machine tool table (or connected to a support \nwhich is  connected to the machine table) .\nThere would be no need to identify the WCS reference plane (assumed to be parallel to the XY plane)  if \nit can be assumed that\na)  the machine tool table (or the workpiece support)  is  flat and parallel to the X-  and Y-axes of motion \n(that define the machine tool XY coordinate plane) ,\nb)  the bottom surface of the workpiece is  parallel to its reference surface,  and\nc)  there are no disturbing elements (e.g.  scratches,  dirt,  residual chips,  etc.)  influencing the connection \nbetween the workpiece and the table (or support) .\nWhen some of these conditions are not fulfilled,  it can be advantageous to measure the workpiece \nreference plane in order to identify it,  as  an alternative to physically adjusting the workpiece itself.\nTypical probing systems allow for measurement of a (nominally flat)  workpiece reference surface by \nprobing three points.  Other sophisticated probing systems can offer the option to define the workpiece \nreference surface by multiple probing on a (known)  surface,  comparing the measured surface points to \nthe mathematical model for the surface and applying best-fit strategies.\n6.7.1.2\t Identification\tof\tthe\tWCS\torientation\tin\tthe\treference\tplane\nTypical probing systems allow for alignment of the WCS orientation in the reference plane by defining \na line passing through two measured points on a (nominally)  flat surface or passing through the centre \ncoordinates of two cylindrical or spherical workpiece features.\nIt shall be noted that,  if the workpiece reference plane was not adjusted to be parallel to the machine \ntool XY coordinate plane (or measured and compensated for) ,  the measurement of a line would not \nproperly identify the WCS orientation in the reference plane.\n6.7.1.3  Location of the WCS datum point\nTypical probing systems allow, at least,  for the location of a datum point by combining the following \ncapabilities:\na)  setting of individual axes datum points by probing a point on a plane;\nb)  setting of the X-  and Y-axis  datum point on the corner between two planes or on the centre of a \nhole or boss;\nc)  setting of the X-,  Y-  and Z-axis datum point on the centre coordinate of a sphere or on a corner \nidentified as the intersection of three planes.\n\n\n6.7.1.4\t Influence\tof\tprobing\tsystem\tcharacteristics\ton\tworkpiece\tcoordinate\tsystem\t(WCS)\t\nidentification\n6.7.1.4.1  The main probing system characteristics that influence the identification of the WCS are\na)  probing system repeatability (see 6.2) ,\nb)  stylus tip offset error with respect to the spindle axis average line (see 6.3) ,\nc)  probing-tool location repeatability (see 6.4) ,\nd)  probing error (see 6.5  and 6.6) ,\ne)  effective stylus tip diameter (see 6.10) ,\nf)  variation of time delay between probing signal  and read-out of machine tool  position \ntransducers  (see 6 .9) ,\ng)  probe qualification,  and\nh)  thermal drifts.\nTable 1  presents a simplified representation of the influence of main characteristics on some common \nmeasuring tasks to possibly help define probing strategies.\nNOTE 1  Probing repeatability,  variation of time delay,  probe qualification and thermal drifts are not listed in \nTable 1  because,  in practical terms, they influence all  measuring tasks.\nNOTE 2  Blank cells  denote a very weak or insignificant influence of the specific characteristic on the \nmeasuring task.\nNOTE 3  Assumption is  made that WCS identification procedure is  performed without intermediate probing-\ntool changes.\nTable\t1\t-\tSimplified\trepresentation\tof\tthe\tinfluence\tof\tprobing\tsystem  \ncharacteristics on measuring tasks\nMeasuring task\nStylus tip \noffseta\nProbing-tool \nlocation  \nrepeatabilityb\nProbing \nerrorc\nEffective \nstylus tip di-\nameterd\nSingle point surface detection strong X,  Y strong strong X,  Y strong\nAngle of XY reference plane\nAngle of a line by two points\nAngle of a line passing through two centres\nLocation of a line by two points strong X,  Y strong strong strong\nLocation of a corner on a plane strong X,  Y strong X,  Y strong strong\nLocation of a corner as intersection of three \nplanes\nstrong X,  Y strong strong strong\nCentre location for a hole or boss strong X,  Y strong medium\nCentre location of a sphere strong X,  Y strong medium\na  See 6 .3 .\nb  See 6 .4.\nc  See 6 .5  and 6 .6.\nd  See 6 .10.\n6.7.1.4.2  Analysis of Table 1  and good practice would suggest the following:",
    "topic": "ISO_00230-10-2016-part2-ready.md"
}