{
    "output": [
        "HYBRID\nPREVIOUS VERSION PUBLISHED AS NHB 5300.4(3A-2)\nSOLDERED ELECTRICAL\nNational Aeronautics and\nSpace Administration\nREVISIONS\nREVISION DESCRIPTION DATE\nInitial Issue 12/15/97\n(FDG)\nChange 1 Typographical corrections to the headers12/8/00\non pages A10 and A12 (Changed      (WBHIII)\nAcceptable to Unacceptable)\nChange 2 Replaced erroneous figure 14 on page A-6 1/18/01\n(which was a duplicate of figure 8) with the (WBHIII)\ncorrect figure",
        "Effective Date: December 15 1997\nThis Standard provides a baseline for NASA project offices to use when preparing or evaluating\nprocess procedures for the manufacture of space flight hardware or mission critical ground\nsupport equipment.\nThis Standard:\na. Prescribes NASA's process and end-item requirements for reliable soldered electrical\nconnections.\nb. Establishes responsibilities for training personnel.\nc. Establishes responsibilities for documenting process procedures including supplier\ninnovations, special processes, and changes in technology.\nd. For the purpose of this Standard, the term supplier is defined as in-house NASA,\nNASA contractors, and subtier contractors.\nNASA Installations shall:\na. Review and invoke the provisions of this Standard for procurements involving hand\nsoldering of space flight hardware and mission critical ground support equipment.\nb. Review and invoke the provisions of this Standard for in-house operations involving\nhand soldering of space flight hardware and mission critical ground support\nequipment.\nc. Tailor specific provisions of this Standard to address program or unique contractual or\nmission requirements.\nd. Assure that NASA suppliers invoke this Standard on subcontractors, purchase orders,\nand on subtier suppliers where applicable.\ne. Furnish copies of this Standard in the quantities required to NASA suppliers and\nsubtier suppliers.\nQuestions concerning the application of this Standard to specific procurements shall be referred to\nthe procuring NASA installation, or its designated representative.\nThis Standard cancels NHB 5300.4(3A-2), \"Requirements for Soldered Electrical Connections.\"\nThis Standard shall not be rewritten or reissued in any other form not approved by NASA.\nOther processes not covered by this Standard may be required. The design, materials, and\nprocesses shall be defined in engineering documentation.",
        "Comments and suggestions for improving this Standard may be submitted using the form \"NASA\nTechnical Standard Improvement Proposal.\" A copy of the form is included in Appendix B.\nFrederick D. Gregory\nAssociate Administrator for\nSafety and Mission Assurance\nDISTRIBUTION:\nSDL1 (SIQ)",
        "NASA TECHNICAL STANDARDS FOR SPACE FLIGHT AND MISSION\nCRITICAL GROUND SUPPORT HARDWARE\nNASA Technical Standards can be found on the World Wide Web at URL address\nhttp://www/hq.nasa.gov/office/codeq/qdoc.pdf.\nTitle Number\nSoldered Electrical Connections NASA-STD-8739.3\nCrimping, Interconnecting Cables, Harnesses, and Wiring NASA-STD-8739.4\nFiber Optic Terminations, Cable Assemblies, and Installation NASA-STD-8739.5\nWorkmanship Standard for Staking and Conformal Coating of\nPrinted Wiring Boards and Electronic Assemblies\nNAS 5300.4(3J-1)\nWorkmanship Standard for Surface Mount Technology NAS 5300.4(3M)\nStandard for Electrostatic Discharge Control (Excluding\nElectrically Initiated Explosive Devices)\nNASA-STD-8739.7",
        "iv\nPARAGRAPH PAGE\n6. FACILITIES, EQUIPMENT, MATERIALS, AND PARTS.....................................6-1\n6.13 Solvents and Cleaners.....................................................................................6-6\n6.14 Personnel Protection ......................................................................................6-7\n7. PREPARATION FOR SOLDERING.......................................................................7-1\n7.1 Preparation of Soldering Tools .......................................................................7-1\n7.3 Preparation of Printed Wiring Boards, Terminals, and Solder Cups.................7-2\n9. ATTACHMENT OF CONDUCTORS TO TERMINALS ........................................9-1\nCONTENTS - CONT.\n11. HAND SOLDERING OF PRINTED WIRING ASSEMBLIES..............................11-1\n12.1 General ........................................................................................................12-1\n12.2 Preparation and Assembly ............................................................................12-2\n12.3 Process Parameters ......................................................................................12-2\n12.4 Wave Soldering............................................................................................12-2\n12.5 Cleaning.......................................................................................................12-3\n12.6 Inspection ....................................................................................................12-3\n13. QUALITY ASSURANCE PROVISIONS..............................................................13-1\n13.5 Verification of Tools, Equipment, and Materials ...........................................13-3\n14.6 Sodium Chloride (NacI) Equivalent Ionic Contamination Test ......................14-2\nFigure 6-1. Comfort Zone -- Temperature Versus Humidity Requirements ...............................6-1\nFigure 8-5. Stress Relief Examples ...........................................................................................8-5\nFigure 8-6. Horizontal Mount...................................................................................................8-5\nFigure 8-7. Vertical Mount.......................................................................................................8-6\nFigure 8-8. Radial Leaded Parts................................................................................................8-6\nFigure 8-9. Hole Obstruction....................................................................................................8-7\nFigure 8-10. Stress Relief Part Termination ..............................................................................8-7\nFigure 8-11. Bend Angle ..........................................................................................................8-7\nFigure 9-5. Bottom Route Connections to Bifurcated Terminals ...............................................9-5\nFigure 9-6. Side Route Connections to Bifurcated Terminals ....................................................9-6\nviii\nLIST OF FIGURES - CONT.\nFigure 9-9. Continuous Run Wrapping--Bifurcated Terminals Alternate Procedure...................9-7\nFigure 9-10. Connections to Hook Terminals ...........................................................................9-8\nFigure 9-11. Connections to Pierced Terminals.........................................................................9-8\nFigure 9-12. Connections to Solder Cups (Connector Type).....................................................9-9\nFigure 9-13. Connections to Swaged Type Solder Cup.............................................................9-9\nFigure 10-1  Solder-Ball Termination .....................................................................................10-2\nFigure 11-1. Heel Fillet...........................................................................................................11-2\nLIST OF TABLES\nTable 7-1. Solder Contaminant Levels  Maximum Allowable Percent\nLIST OF APPENDICES\nAPPENDIX A: ACCEPTABLE AND UNACCEPTABLE SOLDER CONNECTIONS ........A-1\nAPPENDIX B: NASA TECHNICAL STANDARD IMPROVEMENT PROPOSAL............. B-1",
        "1.1 Purpose\n1. This publication sets forth requirements for hand and wave soldering to obtain reliable\nelectrical connections. The prime consideration is the physical integrity of solder connections.\n2. Special requirements may exist that are not covered by or are not in conformance with\nthe requirements of this publication. Engineering documentation shall contain the detail for such\nrequirements, including modifications to existing hardware, and shall take precedence over\nappropriate portions of this publication when approved in writing by the procuring NASA Center\nprior to use.\n1.2 Applicability\n1. This publication applies to NASA programs involving soldering connections for flight\nhardware, mission critical ground support equipment, and elements thereof, and wherever invoked\n2. This publication does not define the soldering requirements for Surface Mount\nTechnology (SMT).",
        "CHAPTER 2 - APPLICABLE DOCUMENTS\n2.1 Applicable Specifications\nCopies of the following specifications, when required in connection with a specific procurement,\ncan be obtained from the procuring NASA Center or as directed by the contracting officer. Unless\notherwise specified, the issue in effect on the date of invitation for bids or requests for proposal\nshall apply. The following related documents form a part of this publication to the extent specified\nherein.\nFEDERAL SPECIFICATIONS:\nTT-I-735 Isopropyl Alcohol\nO-E-760 Ethyl Alcohol (Ethanol) Denatured Alcohol; Proprietary\nSolvents and Special Industrial Solvents\nO-M-232 \"Methanol (Methyl Alcohol)\"\nNASA SPECIFICATIONS:\nNHB 5300.4 (3L) Standard for Electrostatic Discharge Control (Excluding\nElectronically Initiated Explosive Devices)\nNHB 1700.1(V1) NASA Safety Policy and Requirements Document\nNHB 8060.1C Flammability, Odor, Offgassing and Compatibility\nRequirements and Test Procedures for Materials in\nEnvironments that Support Combustion\nNATIONAL STANDARDS:\nAmerican National Standards Institute (ANSI):\nANSI/J-STD-004 Requirements for Soldering Fluxes\nANSI/J-STD-006 Requirements for Electronic Grade Solder Alloys and\nFluxed and Non-Fluxed Solid Solders for Electronic\nSoldering Applications\nANSI/NCSL Z540-1-1994 General Requirements for Calibration Laboratories\nand Measuring and Test Equipment\nAmerican Society for Testing and Materials (ASTM):\nASTM/D1007 Standard Specification for Secondary Butyl Alcohol\n2.2 Other Documents:\nIndustrial Ventilation: A Manual of Recommended Practice.\nPublished by the American Conference of Governmental Industrial Hygienists;\n1330 Kemper Meadow Drive; Cincinnati, OH 45240.\nURL http://www.acgih.org\nOccupational Safety and Health Administration, 29 CFR.",
        "CHAPTER 3 - DEFINITIONS AND ACRONYMS\n3.1. Definitions\nThe following definitions apply to terms used in this Standard.\nArticle. A unit of hardware or any portion thereof required by the contract.\nAssembly. A functional subdivision of a component, consisting of parts or subassemblies that\nperform functions necessary for the operation of the component as a whole. Examples: regulator\nassembly, power amplifier assembly, gyro assembly, etc.\nAxial lead. Lead wire extending from a component or module body along its longitudinal axis.\nBifurcated (split) Terminal. A terminal with a slot or split opening in which conductors are\nplaced before soldering.\nBirdcage. A defect in stranded wire where the strands in the stripped portion between the\ncovering of an insulated conductor and a soldered connection (or an end-tinned lead) have\nseparated from the normal lay of the strands.\nBlister. Raised areas on the surface of the laminate caused by the pressure of volatile substances\nentrapped within the laminate.\nBlow Hole. A cavity in the solder surface whose opening has an irregular and jagged form,\nwithout a smooth surface.\nBridging. A buildup of solder between components, conductors, and/or base substrate forming an\nundesired conductive path.\nCertification. The act of verifying and documenting that personnel have completed required\ntraining and have demonstrated specified proficiency and have met other specified requirements.\nCircumferential Separation. A crack or void in the plating extending around the entire\ncircumference of a PTH, or in the solder fillet around the conductor, in the solder fillet around an\neyelet, or at the interface between a solder fillet and a land.\nCold Flow. Movement of insulation (e.g. Teflon) caused by pressure.\nCold Solder Connection. A solder connection exhibiting poor wetting and a grayish, porous\nappearance due to insufficient heat, inadequate cleaning before to soldering, or excessive\nimpurities in the solder.\nComponent. A functional subdivision of a system, generally a self-contained combination of\nassemblies performing a function necessary for the system's operation. Examples: power supply,\ntransmitter, gyro package, etc.\nConduction Soldering. Method of soldering which employs a soldering iron for transfer of heat\nConductor. A lead, solid or stranded, or printed wiring path serving as an electrical connection.\nConformal Coating. A thin electrically nonconductive protective coating that conforms to the\nconfiguration of the covered assembly.\nConnection. An electrical termination that was soldered. A solder joint.\nConstruction Analysis. The process of destructively disassembling, testing, and inspecting a\ndevice for the purpose of determining conformance with applicable design, process, and\nworkmanship requirements. This process is also known as Destructive Physical Analysis (DPA).\nContaminant. An impurity or foreign substance present in a material that affects one or more\nproperties of the material. A contaminant may be either ionic or nonionic. An ionic, or polar\ncompound, forms free ions when dissolved in water, making the water a more conductive path. A\nnon-ionic substance does not form free ions, nor increase the water's conductivity. Ionic\ncontaminants are usually processing residue such as flux activators, finger prints, and etching or\nplating salts.\nCrazing. An internal condition occurring in the laminate base material in which the glass fibers\nare separated from the resin.\nCup Terminal. A hollow, cylindrical terminal to accommodate one or more conductors.\nDelamination. A separation between plies within a base material or any planar separation within\na multilayer PWB.\nDeviation. A specific authorization, granted before the fact, to depart from a particular\nrequirement of specifications or related documents.\nDewetting. The condition in a soldered area in which the liquid solder has not adhered intimately,\nbut has receded, characterized by an abrupt boundary between solder and conductor, or solder\nand terminal/termination area leaving irregularly shaped mounds of solder separated by areas\ncovered with a thin solder film.\nDisturbed Solder Joint. Unsatisfactory connection resulting from relative motion between the\nconductor and termination during solidification of the solder.\nDross. Oxide and other contaminants that form on the surface of molten solder.\nEgress. An opening that provides a pathway from the interior of an enclosed space.\nEncapsulating Compound. An electrically nonconductive compound used to completely enclose\nand fill in voids between electrical components or parts.\nExcessive Solder Joint. Unsatisfactory solder connection wherein the solder obscures the\nconfiguration of the connection.\nEyelet. A hollow tube inserted in a terminal or PWB to provide mechanical support for\ncomponent leads or for electrical connection.\nFlatpack. A part with two straight rows of leads (normally on 0.050 inch centers) that are parallel\nFillet. A smooth concave buildup of material between two surfaces; e.g., a fillet of solder between\na conductor and a solder pad or terminal.\nFlux. A chemically-active compound which, when heated, removes minor surface oxidation,\nminimizes oxidation of the basis metal, and promotes the formation of an intermetallic layer\nbetween solder and basis metal.\nFractured Solder Joint. A joint showing evidence of cracking, resulting from movement\nbetween the conductor and termination, after solidification of the solder.\nHaloing. Mechanically-induced fracturing or delaminating on or below the surface of the base\nPWB material; it is usually exhibited by a light area around holes, other machined areas, or both.\nHook Terminal. A terminal formed in a hook shape.\nInsufficient Solder Connection. A solder connection characterized by incomplete coverage of\none or more of the metal surfaces being joined or by incomplete solder fillets.\nInterfacial Connection. A conductor that connects conductive patterns between opposite sides\nof a PWB.\nInterlayer Connection. An electrical connection between conductive patterns in different layers\nof a PWB.\nJoint. A solder joint; a termination.\nLifted Land. A land that has lifted or separated from the base material, whether or not any resin\nis lifted with the land.\nMission Essential Support Equipment. Equipment used in a closed loop with the system, where\nfailure of this equipment would degrade the mission or imperil personnel. This category includes\nitems of ground support equipment whose functions are necessary to support the count down\nphase and those items of ground support equipment used in pre-count down phases whose\nproblems can create a safety hazard, cause damage to flight hardware, or inability to detect a\nproblem on the flight hardware.\nMeasling. Discrete white spots below the surface of the base material, usually caused by\nmoisture, pressure, and/or thermally induced stress.\nNick. A cut or notch on a conductor.\nNonwetting. A condition whereby a surface has contacted molten solder, but the solder has not\nadhered to all of the surface; basis metal remains exposed.\nOffgassing. The release of volatile parts from a substance when placed in a vacuum environment\nthat may affect crew members.\nOutgassing. The release of volatile parts from a substance when placed in a vacuum environment.\nOverheated Joint. An unsatisfactory solder joint, characterized by rough solder surface; dull,\nchalky, grainy, porous or pitted.\nPad. A portion of a conductive pattern used as a soldering area. Also called a land.\nPart. An element of a component, assembly, or subassembly that is not normally subject to\nfurther subdivision or disassembly without destruction of designed use.\nPart Lead. The solid conductor attached to a part.\nPierced (Perforated) Terminal. A terminal containing a hole through which conductors are\nplaced before soldering.\nPinhole. A solder connection with a small hole penetrating from the surface of the solder to a\nvoid of indeterminate size within the solder connection.\nPit. A relatively small recess in the solder surface, the bottom of which is visible from all angles of\nvision.\nPlated-Through-Hole. A plated-through hole is one formed by a deposition of metal on the\ninside surface of a through-hole. Also known as a supported hole. The configuration is used to\nprovide additional mechanical strength to the soldered termination or to provide an electrical\ninterconnection on a multilayer PWB.\nPorous Solder Joint. A joint having a grainy or gritty surface.\nPotting Compound. An electrically nonconductive compound used to partially encapsulate or for\na filler between parts, conductors, or assemblies.\nPrinted Wiring Assembly. The PWA consists of the PWB, components, and associated\nhardware and materials.\nPrinted Wiring Board. A pattern of conductors printed (screened) onto the surface of an\ninsulating base to provide interconnection for parts.\nRadial Lead. Lead wire extending from a component or module body along its latitudinal axis.\nRadial Split. A crack or other separation in the flange of an eyelet or other circular connector,\nwhich extends outward from the center. Such cracking is usually the result of swaging or other\nsetting process as the item is embraced in a printed wiring board.\nRepair. Operations performed on a nonconforming article to place it in usable condition. Repair\nis distinguished from rework in that alternate processes rather than reprocessing are employed.\nResistance Soldering. Method of soldering by passing a current between two electrodes through\nthe area to be soldered.\nRework. The reprocessing of articles or material that will make it conform to drawings,\nspecifications, and contract.\nRosin Solder Joint. Unsatisfactory connection that has entrapped rosin flux. This entrapment is\nusually due to insufficient heat or insufficient time at soldering temperature, or both, not enabling\nthe rosin to rise to the surface of the solder. This results in insufficient bonding and/or high\nelectrical resistance.\nSolder. A nonferrous, fusible metallic alloy used to join metallic surfaces.\nSolderability. The property of a surface that allows it to be wetted by a molten solder.\nSolder Connection. An electrical/mechanical connection that employs solder for the joining of\ntwo or more metal surfaces.\nSolder Mask. Coating material used to mask or protect selected areas of a pattern from the\naction of an etchant, solder, or plating.\nSolder Pad. Termination area on a printed wiring conductor.\nSolder Spatter. Extraneous irregular-shape solder fragments.\nSolder Spike. A cone shaped peak or sharp point of solder usually formed by the premature\ncooling and solidification of solder on removal of the heat source.\nSoldering. The process of joining clean metallic surfaces through the use of solder without direct\nfusion of the base metals.\nStaking Compound. An electrically nonconductive adhesive material used for additional support\nafter a component has been attached by mechanical or soldering process.\nStraight Pin Terminal. A round post-type smooth terminal, with no grooves.\nStraight-Through Termination. A conductor termination extending through a PWB without\nsubsequent forming of the lead.\nStress Relief. The formed portion of a conductor that provides sufficient length to minimize\nstress between terminations.\nStud Termination. An unbendable conductor termination extending through a PWB.\nSupplier. In-house NASA, NASA contractors, and subtier contractors.\nSurface Mounting. The electrical connection of components to the surface of a conductive\npattern that does not utilize part holes.\nSupportive Hole. A hole in a printed board that has its inside surface plated or otherwise\nreinforced.\nTerminal. A tie point device used for making electrical connection.\nTermination. The point at which electrical conductors are joined.\nTermination Area. A conductive surface on a PWB used for making electrical connections (also\nreferred to as a solder pad).\nThermal Shunt. A device with good heat dissipation characteristics used to conduct heat away\nfrom an article being soldered.\nTinning. The coating of a surface with a uniform layer of solder.\nTubelet. A tubular metal part. Its ends may or may not be flared.\nTurret Terminal. A round post-type grooved stud around which conductors are fastened before\nsoldering.\nUnsupported Hole. A hole containing no plating or other type of conductive reinforcement.\nVia. A PTH used as an interlayer connection, but in which there is no intention to insert a\ncomponent or other reinforcing material.\nVoid. A space enclosed on all sides by the solder.\nWave Soldering. A process wherein PWAs are brought in contact with the surface of\ncontinuously flowing and circulating solder.\nWetting. Flow and adhesion of a liquid to a solid surface, characterized by smooth, even edges,\nand a low dihedral angle.\nWicking. A flow of molten solder, flux, or cleaning solution by capillary action.",
        "3.2. Acronyms\nThe following acronyms apply to terms used in this Standard.\nACS American Chemical Society\nANSI American National Standards Institute\nASTM American Society for Testing and Materials\nAWG American Wire Gage\nCFR Code of Federal Regulation\nCVCM Collected Volatile Condensable Material\nDWV Dielectric Withstanding Voltage\nEEE Electrical, Electronic, and Electromechanical\nEMI Electromagnetic Interference\nESD Electrostatic Discharge\nESDS Electrostatic Discharge Sensitive\nFEP Fluorinated Ethylene Propylene\nGHz Gigahertz\nGSFC Goddard Space Flight Center\nIR Insulation Resistance\nJPL Jet Propulsion Laboratory\nlm/m2 Lumens per Square Meter\nMSDS Material Safety Data Sheet\nNaCl Sodium Chloride\nNAS NASA Assurance Standard\nNASA National Aeronautic and Space Administration\nNASA-STD NASA Standard\nNHB NASA Handbook\nNIST National Institute of Standards and Technology\nOD Outside Diameter\nOSHA Occupational Safety and Health Administration\nPTH Plated Through Hole\nPWA Printed Wiring Assembly\nPWB Printed Wiring Board\nRF Radio Frequency\nRFI Radio Frequency Interference\nRH Relative Humidity\nRMS Root Mean Squared\nSMT Surface Mount Technology\nTML Total Mass Loss",
        "1. Implementation. NASA quality assurance personnel will advise and assist suppliers,\nNASA personnel, and delegated agencies in the proper and effective implementation of the\nprovisions of this publication. Effective implementation includes establishing a system that will\nidentify each inspection point and maintain records.\n2. Changes in Requirements. When related requirements or changes in requirements\nare specified, NASA quality assurance personnel will assure that the Government agency\ndelegated to inspect at the supplier's site of fabrication has received full instructions so that the\nwork will be inspected to actual contract requirements.\n3. Nonstandard Processes, Materials, or Parts. When the supplier intends to use\nprocesses, materials, or parts not covered by this publication, the supplier shall document the\ndetails of fabrication and inspection, including acceptance and rejection criteria, and shall provide\nappropriate test data. Such documentation shall be approved by the procuring NASA Center prior\nto use.\n4. Internal Conditions. Unless parts are manufactured specifically to comply with\ncontracts or subcontracts citing this publication, internal connections of parts (as parts are defined\nin Appendix B) are not subject to the requirements of this publication. The supplier shall assure\nthat parts have suitable internal solder connections that will not unsolder or deteriorate when\ntinning is performed or external connections are made.\n5. Work Should Be Halted. If at any time, during any phase of the part mounting and/or\nthe soldering operation, a condition should arise that the operator feels may damage or in any way\naffect the reliability of the hardware, the work should be halted until that condition is reviewed\nand resolved.\n6. Material Safety Data Sheets (MSDS). MSDS shall be available for solders, fluxes,\nsolvents, and cleaners used in the area.",
        "4.2. Approval of Departures From This Standard\n1. Departures from this Standard require written approval from the cognizant NASA\ncontracting officer. The supplier is responsible for assuring that any departures from this\npublication are evaluated by, coordinated with, and submitted to the procuring NASA Center for\napproval prior to use or implementation.\n2. For in-house NASA projects, this publication requires written approval by the in-\nhouse NASA project management to deviate from the provisions herein.",
        "4.3. Reliable Soldered Connections\n1. Reliable soldered connections result from proper design; control of tools, materials,\nprocesses, and work environments; use of properly trained and skilled personnel; and careful\nworkmanship.\n2. The following requirements and design objectives should be used to ensure the reliable\nsoldered connections required by NASA:\na. Stress relief should be inherent in the design to avoid detrimental thermal and\nmechanical stresses on the solder connections.\nb. Where stress relief is not used, a plated-through hole (PTH) is mandatory.\nc. Materials selection should provide minimal thermal expansion coefficient mismatch\nat the constraint points of the parts mounting configuration.\nd. Parts mounting design requirements shall allow full visual or nondestructive\ninspection of all soldered connections.",
        "4.4. Documentation\n1. The supplier shall document the methods and procedures proposed to incorporate the\nrequirements of this publication into the design, fabrication, and inspection of solder connections\ninvolved in the contract or purchase order.\n2. Documents required herein, except as specified by paragraph 4.1-3, shall be submitted\nto the procuring NASA Center or its designated representative as required by the contract or\npurchase order. Applicable supplier soldering program documents, or portions thereof, accepted\non other NASA contracts shall be included whenever possible to avoid duplication of effort.",
        "4.5. Rework And Repair\n1. Rework. Rework is permissible unless excluded by other provisions of the contract.\nAll rework shall meet the requirements of this Standard and approved engineering documentation.\n2. Repair is not rework. Repairs shall be made only in compliance with applicable\ncontractual requirements and after authorization for each incident by the procuring NASA Center.\nRepairs shall be accomplished using documented methods previously approved by the procuring\nNASA Center. For in-house NASA projects, repairs shall be authorized for each incident by the\nProject Office and Quality Management, as appropriate.",
        "CHAPTER 5 - TRAINING AND CERTIFICATION PROGRAM\n1. The supplier is responsible for maintaining a documented training program that meets\n2. The supplier shall assure that the electronics packaging design personnel are familiar\nwith the requirements of this Standard, soldering techniques, and other pertinent requirements of\nthe contract. The supplier shall implement and document a training program that provides the\nnecessary training of soldering and inspection personnel in parts mounting and connections\nrequirements, soldering techniques, and use of equipment and procedures pertinent to their\nresponsibilities in performance of the contract requirements. The supplier is responsible for\ncertifying and maintaining the certification of each individual who solders, inspects, or instructs.\n3. Operators, inspectors, and instructors shall be qualified to fulfill all requirements of\nthis Standard that relate to their assigned tasks. Demonstration of proficiency and understanding\nof the requirements is a requisite for certification and recertification. Evidence of certification\nstatus shall be maintained in the work area.",
        "5.2 Vision Requirements\n1. The supplier is responsible for ensuring that all personnel who perform or inspect\nsoldered electrical connections meet the following vision test requirements as a prerequisite to\ntraining, certification, and recertification. The vision requirements may be met with corrected\nvision (personal eyeglasses). The vision tests shall be administered every 2 years by a qualified eye\nexaminer, accepted by the procuring supplier, using standard instruments and techniques. Results\nof the visual examinations shall be maintained and available for review.\n2. The following are minimum vision requirements:\na. Far Vision. Snellen Chart 20/50.\nb. Near Vision. Jaeger 1 at 35.5cm (14 inches), reduced Snellen 20/20, or\nequivalent.\nc. Color Vision. Ability to distinguish red, green, blue, and yellow colors as\nprescribed in Dvorine Charts, Ishihara Plates, or AO-HRR Tests.\nNOTE: A PRACTICAL TEST USING COLOR CODED WIRES AND/OR COLOR CODED\nELECTRICAL PARTS, AS APPLICABLE, IS ACCEPTABLE FOR COLOR\nVISION TESTING.",
        "5.3 Certification Levels\n1. Level A NASA instructors are certified by the NASA Training and Certification\nBoard. Level A NASA instructors have the authority to train Level B instructors, operators, and\ninspectors. Upon successful course completion, a certificate shall be issued.\n2. Certification of Level B instructors will be provided by the supplier based on\nsuccessful completion of training by a Level A NASA instructor. Level B instructors are\nauthorized to train operators and inspectors employed at their organization and subtier\ncontractors.\n3. Certification of inspectors shall be provided by the supplier based on successful\ncompletion of training by a Level A NASA instructor or Level B supplier instructor. An inspector\nis trained and certified to inspect for conformance with the requirements of this Standard.\n4. Certification of operators shall be provided by the supplier based on successful\ncompletion of training by a Level A NASA instructor or Level B supplier instructor. An operator\nis trained and certified to perform solder connections in conformance with the requirements of this\nStandard. When operators are certified to perform limited operations or processes, it shall be\nstated on the certification card.",
        "5.4 Training Program Requirements\n1. The supplier is responsible for training and certification of operators and inspectors in\nsoldering processes and associated processing equipment.\n2. The supplier training program documentation shall be submitted to the procuring\nNASA Center as directed by contract. A NASA Generic Soldered Electrical Connections Training\nPlan from the NASA Training Centers is available for use as a guideline.\n3. The training program shall:\na. Identify the criteria for qualification and certification of Level B instructors,\noperators, and inspectors.\nb. Document the methods and procedures proposed to fulfill the requirements of this\nStandard.\nc. Use visual standards consisting of satisfactory work samples or visual aids that\nclearly illustrate the quality characteristics of soldered connections applicable to the contract.\nd. Use applicable illustrations in this Standard, supplemented as necessary, for visual\nstandards. Standards of unacceptable conditions may also be used for clarification or comparison.\ne. Make applicable standards readily available.\n4. Wave Soldering Process Training Requirements. The supplier is responsible for\ntraining and certifying the wave soldering process instructors and operators.",
        "1. The supplier training program documentation shall describe the training and\ncertification program proposed to satisfy the requirements herein for the types of solder\nconnections to be made. This description shall include the following, as applicable:\na. Qualifications of instructors.\nb. Procedures for training, including who will be trained and for what purpose, (e.g.,\noperator, inspector).\nc. Lesson plan(s)/student standards.\nd. Hours of instruction.\ne. Procedures for certification and recertification.\nf. Procedures for recording training, recertification, and method of\nidentifying/recalling trained personnel.\ng. Certification criteria.\n2. Records of training and certification shall become part of the supplier's quality data\nand shall be retained for a minimum of 5 years.\n3. Evidence of certification status, including limitations, shall be available in the work\narea.",
        "5.6 Maintenance of Certification Status\n1. Maintenance of certification for instructors, operators, and inspectors requires\ncontinuous proficiency.\n2. Recertification of Level B instructors shall include the successful completion of\nretraining by a Level A NASA instructor. Recertification of operators and inspectors shall include\nsuccessful completion of retraining by a Level A NASA instructor or a Level B supplier\ninstructor.\n3. Recertification shall be required when:\na. Proficiency requirements herein are not met.\n(1) Instructors - proficiency unacceptable.\n(2) Operators - unsatisfactory quality of articles fabricated.\n(3) Inspectors - unsatisfactory quality of inspection.\n(4) Quality/quantitative data demonstrates a need for recertification.\nb. New soldering or inspection techniques have been approved that require different\nskills.\nc. Work period interruption of greater than 6 months occurs.\nd. Two years has elapsed since last certification.\n4. Certification shall be revoked when:\na. Certificate holder fails recertification.\nb. Certificate holder fails to meet visual acuity requirements of paragraph 5.2.\nc. Employment is terminated.\nd. Supplier training program fails to meet requirements set forth herein or set forth\notherwise in the contract.",
        "5.7 Training Resources\n1. Training of Level B instructors is available at either the Goddard Space Flight Center\n(GSFC) or Jet Propulsion Laboratory (JPL). The NASA Generic Soldered Electrical Connections\nTraining Plan will be supplied to instructors at the time of course completion.\na. GSFC\nTraining Center\nCode 300.1\nGreenbelt, MD 20771\n(301)731-8632\nFAX (301)731-8628\nb. JPL\nTraining Center\nMS83-204\n4800 Oak Grove Drive\nPasadena, CA 91109\n(818)354-6730\nFAX (818)393-0090\n2. Suppliers may train operator or inspector personnel in-house for certification or\nrecertification using certified instructors and approved soldering training programs, or arrange for\nthis training at one of the NASA-conducted schools.\n3. A fee is required. Contact either training center for information.",
        "CHAPTER 6 - FACILITIES, EQUIPMENT, MATERIALS, AND PARTS\n6.1 Facility Cleanliness\nThe work area shall be maintained in a clean and orderly condition. Smoking, eating, and drinking\nin soldering areas and at individual work stations shall not be permitted. Nonessential tools and\nmaterials shall not be permitted at the workstation.",
        "6.2 Environmental Conditions\n1. Controlled Environment. The soldering area shall have a controlled environment that\nlimits the entry of contamination. It shall be documented that the temperature and humidity of this\narea are monitored and maintained within the limits defined as the comfort zone in Figure 6-1.\nFigure 6-1.  Comfort Zone -- Temperature Versus Humidity Requirements\n2. Special Environmental Requirements. Parts or equipment being processed that\nrequire more stringent control of environmental conditions than those stated above shall have\nthese requirements and controls identified and specified on the engineering documentation.\n3. Ventilation System. Areas used for cleaning parts, and areas where toxic or volatile\nvapors are generated, shall have a ventilation system for removing air contaminants. The\nventilation system shall comply with the recommendations and guidelines of the Occupational\nSafety and Health Administration (OSHA) requirements, 29CFR.\n4. Field Operations. In field operations where the required controlled environment\nconditions cannot be effectively achieved, special precautions shall be taken to maximize the\nquality of solder connections and minimize the effects of the uncontrolled environment on the\noperation being performed on the hardware. These precautions shall be identified in the"
    ],
    "input": "HYBRID\nPREVIOUS VERSION PUBLISHED AS NHB 5300.4(3A-2)\nSOLDERED ELECTRICAL\nNational Aeronautics and\nSpace Administration\n\n\nREVISIONS\nREVISION DESCRIPTION DATE\nInitial Issue 12/15/97\n(FDG)\nChange 1 Typographical corrections to the headers12/8/00\non pages A10 and A12 (Changed      (WBHIII)\nAcceptable to Unacceptable)\nChange 2 Replaced erroneous figure 14 on page A-6 1/18/01\n(which was a duplicate of figure 8) with the (WBHIII)\ncorrect figure\n\n\nEffective Date: December 15 1997\nThis Standard provides a baseline for NASA project offices to use when preparing or evaluating\nprocess procedures for the manufacture of space flight hardware or mission critical ground\nsupport equipment.\nThis Standard:\na. Prescribes NASA's process and end-item requirements for reliable soldered electrical\nconnections.\nb. Establishes responsibilities for training personnel.\nc. Establishes responsibilities for documenting process procedures including supplier\ninnovations, special processes, and changes in technology.\nd. For the purpose of this Standard, the term supplier is defined as in-house NASA,\nNASA contractors, and subtier contractors.\nNASA Installations shall:\na. Review and invoke the provisions of this Standard for procurements involving hand\nsoldering of space flight hardware and mission critical ground support equipment.\nb. Review and invoke the provisions of this Standard for in-house operations involving\nhand soldering of space flight hardware and mission critical ground support\nequipment.\nc. Tailor specific provisions of this Standard to address program or unique contractual or\nmission requirements.\nd. Assure that NASA suppliers invoke this Standard on subcontractors, purchase orders,\nand on subtier suppliers where applicable.\ne. Furnish copies of this Standard in the quantities required to NASA suppliers and\nsubtier suppliers.\nQuestions concerning the application of this Standard to specific procurements shall be referred to\nthe procuring NASA installation, or its designated representative.\nThis Standard cancels NHB 5300.4(3A-2), \"Requirements for Soldered Electrical Connections.\"\nThis Standard shall not be rewritten or reissued in any other form not approved by NASA.\nOther processes not covered by this Standard may be required. The design, materials, and\nprocesses shall be defined in engineering documentation.\n\n\nComments and suggestions for improving this Standard may be submitted using the form \"NASA\nTechnical Standard Improvement Proposal.\" A copy of the form is included in Appendix B.\nFrederick D. Gregory\nAssociate Administrator for\nSafety and Mission Assurance\nDISTRIBUTION:\nSDL1 (SIQ)\n\n\nNASA TECHNICAL STANDARDS FOR SPACE FLIGHT AND MISSION\nCRITICAL GROUND SUPPORT HARDWARE\nNASA Technical Standards can be found on the World Wide Web at URL address\nhttp://www/hq.nasa.gov/office/codeq/qdoc.pdf.\nTitle Number\nSoldered Electrical Connections NASA-STD-8739.3\nCrimping, Interconnecting Cables, Harnesses, and Wiring NASA-STD-8739.4\nFiber Optic Terminations, Cable Assemblies, and Installation NASA-STD-8739.5\nWorkmanship Standard for Staking and Conformal Coating of\nPrinted Wiring Boards and Electronic Assemblies\nNAS 5300.4(3J-1)\nWorkmanship Standard for Surface Mount Technology NAS 5300.4(3M)\nStandard for Electrostatic Discharge Control (Excluding\nElectrically Initiated Explosive Devices)\nNASA-STD-8739.7\n\n\niv\nPARAGRAPH PAGE\n\n\n6. FACILITIES, EQUIPMENT, MATERIALS, AND PARTS.....................................6-1\n6.13 Solvents and Cleaners.....................................................................................6-6\n6.14 Personnel Protection ......................................................................................6-7\n7. PREPARATION FOR SOLDERING.......................................................................7-1\n7.1 Preparation of Soldering Tools .......................................................................7-1\n7.3 Preparation of Printed Wiring Boards, Terminals, and Solder Cups.................7-2\n9. ATTACHMENT OF CONDUCTORS TO TERMINALS ........................................9-1\n\n\nCONTENTS - CONT.\n11. HAND SOLDERING OF PRINTED WIRING ASSEMBLIES..............................11-1\n12.1 General ........................................................................................................12-1\n12.2 Preparation and Assembly ............................................................................12-2\n12.3 Process Parameters ......................................................................................12-2\n12.4 Wave Soldering............................................................................................12-2\n12.5 Cleaning.......................................................................................................12-3\n12.6 Inspection ....................................................................................................12-3\n13. QUALITY ASSURANCE PROVISIONS..............................................................13-1\n13.5 Verification of Tools, Equipment, and Materials ...........................................13-3\n14.6 Sodium Chloride (NacI) Equivalent Ionic Contamination Test ......................14-2\n\n\nFigure 6-1. Comfort Zone -- Temperature Versus Humidity Requirements ...............................6-1\nFigure 8-5. Stress Relief Examples ...........................................................................................8-5\nFigure 8-6. Horizontal Mount...................................................................................................8-5\nFigure 8-7. Vertical Mount.......................................................................................................8-6\nFigure 8-8. Radial Leaded Parts................................................................................................8-6\nFigure 8-9. Hole Obstruction....................................................................................................8-7\nFigure 8-10. Stress Relief Part Termination ..............................................................................8-7\nFigure 8-11. Bend Angle ..........................................................................................................8-7\nFigure 9-5. Bottom Route Connections to Bifurcated Terminals ...............................................9-5\nFigure 9-6. Side Route Connections to Bifurcated Terminals ....................................................9-6\n\n\nviii\nLIST OF FIGURES - CONT.\nFigure 9-9. Continuous Run Wrapping--Bifurcated Terminals Alternate Procedure...................9-7\nFigure 9-10. Connections to Hook Terminals ...........................................................................9-8\nFigure 9-11. Connections to Pierced Terminals.........................................................................9-8\nFigure 9-12. Connections to Solder Cups (Connector Type).....................................................9-9\nFigure 9-13. Connections to Swaged Type Solder Cup.............................................................9-9\nFigure 10-1  Solder-Ball Termination .....................................................................................10-2\nFigure 11-1. Heel Fillet...........................................................................................................11-2\nLIST OF TABLES\nTable 7-1. Solder Contaminant Levels  Maximum Allowable Percent\nLIST OF APPENDICES\nAPPENDIX A: ACCEPTABLE AND UNACCEPTABLE SOLDER CONNECTIONS ........A-1\nAPPENDIX B: NASA TECHNICAL STANDARD IMPROVEMENT PROPOSAL............. B-1\n\n\n1.1 Purpose\n1. This publication sets forth requirements for hand and wave soldering to obtain reliable\nelectrical connections. The prime consideration is the physical integrity of solder connections.\n2. Special requirements may exist that are not covered by or are not in conformance with\nthe requirements of this publication. Engineering documentation shall contain the detail for such\nrequirements, including modifications to existing hardware, and shall take precedence over\nappropriate portions of this publication when approved in writing by the procuring NASA Center\nprior to use.\n1.2 Applicability\n1. This publication applies to NASA programs involving soldering connections for flight\nhardware, mission critical ground support equipment, and elements thereof, and wherever invoked\n2. This publication does not define the soldering requirements for Surface Mount\nTechnology (SMT).\n\n\n\n\n\nCHAPTER 2 - APPLICABLE DOCUMENTS\n2.1 Applicable Specifications\nCopies of the following specifications, when required in connection with a specific procurement,\ncan be obtained from the procuring NASA Center or as directed by the contracting officer. Unless\notherwise specified, the issue in effect on the date of invitation for bids or requests for proposal\nshall apply. The following related documents form a part of this publication to the extent specified\nherein.\nFEDERAL SPECIFICATIONS:\nTT-I-735 Isopropyl Alcohol\nO-E-760 Ethyl Alcohol (Ethanol) Denatured Alcohol; Proprietary\nSolvents and Special Industrial Solvents\nO-M-232 \"Methanol (Methyl Alcohol)\"\nNASA SPECIFICATIONS:\nNHB 5300.4 (3L) Standard for Electrostatic Discharge Control (Excluding\nElectronically Initiated Explosive Devices)\nNHB 1700.1(V1) NASA Safety Policy and Requirements Document\nNHB 8060.1C Flammability, Odor, Offgassing and Compatibility\nRequirements and Test Procedures for Materials in\nEnvironments that Support Combustion\nNATIONAL STANDARDS:\nAmerican National Standards Institute (ANSI):\nANSI/J-STD-004 Requirements for Soldering Fluxes\nANSI/J-STD-006 Requirements for Electronic Grade Solder Alloys and\nFluxed and Non-Fluxed Solid Solders for Electronic\nSoldering Applications\nANSI/NCSL Z540-1-1994 General Requirements for Calibration Laboratories\nand Measuring and Test Equipment\nAmerican Society for Testing and Materials (ASTM):\nASTM/D1007 Standard Specification for Secondary Butyl Alcohol\n\n\n2.2 Other Documents:\nIndustrial Ventilation: A Manual of Recommended Practice.\nPublished by the American Conference of Governmental Industrial Hygienists;\n1330 Kemper Meadow Drive; Cincinnati, OH 45240.\nURL http://www.acgih.org\nOccupational Safety and Health Administration, 29 CFR.\n\n\nCHAPTER 3 - DEFINITIONS AND ACRONYMS\n3.1. Definitions\nThe following definitions apply to terms used in this Standard.\nArticle. A unit of hardware or any portion thereof required by the contract.\nAssembly. A functional subdivision of a component, consisting of parts or subassemblies that\nperform functions necessary for the operation of the component as a whole. Examples: regulator\nassembly, power amplifier assembly, gyro assembly, etc.\nAxial lead. Lead wire extending from a component or module body along its longitudinal axis.\nBifurcated (split) Terminal. A terminal with a slot or split opening in which conductors are\nplaced before soldering.\nBirdcage. A defect in stranded wire where the strands in the stripped portion between the\ncovering of an insulated conductor and a soldered connection (or an end-tinned lead) have\nseparated from the normal lay of the strands.\nBlister. Raised areas on the surface of the laminate caused by the pressure of volatile substances\nentrapped within the laminate.\nBlow Hole. A cavity in the solder surface whose opening has an irregular and jagged form,\nwithout a smooth surface.\nBridging. A buildup of solder between components, conductors, and/or base substrate forming an\nundesired conductive path.\nCertification. The act of verifying and documenting that personnel have completed required\ntraining and have demonstrated specified proficiency and have met other specified requirements.\nCircumferential Separation. A crack or void in the plating extending around the entire\ncircumference of a PTH, or in the solder fillet around the conductor, in the solder fillet around an\neyelet, or at the interface between a solder fillet and a land.\nCold Flow. Movement of insulation (e.g. Teflon) caused by pressure.\nCold Solder Connection. A solder connection exhibiting poor wetting and a grayish, porous\nappearance due to insufficient heat, inadequate cleaning before to soldering, or excessive\nimpurities in the solder.\nComponent. A functional subdivision of a system, generally a self-contained combination of\nassemblies performing a function necessary for the system's operation. Examples: power supply,\ntransmitter, gyro package, etc.\nConduction Soldering. Method of soldering which employs a soldering iron for transfer of heat\n\n\nConductor. A lead, solid or stranded, or printed wiring path serving as an electrical connection.\nConformal Coating. A thin electrically nonconductive protective coating that conforms to the\nconfiguration of the covered assembly.\nConnection. An electrical termination that was soldered. A solder joint.\nConstruction Analysis. The process of destructively disassembling, testing, and inspecting a\ndevice for the purpose of determining conformance with applicable design, process, and\nworkmanship requirements. This process is also known as Destructive Physical Analysis (DPA).\nContaminant. An impurity or foreign substance present in a material that affects one or more\nproperties of the material. A contaminant may be either ionic or nonionic. An ionic, or polar\ncompound, forms free ions when dissolved in water, making the water a more conductive path. A\nnon-ionic substance does not form free ions, nor increase the water's conductivity. Ionic\ncontaminants are usually processing residue such as flux activators, finger prints, and etching or\nplating salts.\nCrazing. An internal condition occurring in the laminate base material in which the glass fibers\nare separated from the resin.\nCup Terminal. A hollow, cylindrical terminal to accommodate one or more conductors.\nDelamination. A separation between plies within a base material or any planar separation within\na multilayer PWB.\nDeviation. A specific authorization, granted before the fact, to depart from a particular\nrequirement of specifications or related documents.\nDewetting. The condition in a soldered area in which the liquid solder has not adhered intimately,\nbut has receded, characterized by an abrupt boundary between solder and conductor, or solder\nand terminal/termination area leaving irregularly shaped mounds of solder separated by areas\ncovered with a thin solder film.\nDisturbed Solder Joint. Unsatisfactory connection resulting from relative motion between the\nconductor and termination during solidification of the solder.\nDross. Oxide and other contaminants that form on the surface of molten solder.\nEgress. An opening that provides a pathway from the interior of an enclosed space.\nEncapsulating Compound. An electrically nonconductive compound used to completely enclose\nand fill in voids between electrical components or parts.\nExcessive Solder Joint. Unsatisfactory solder connection wherein the solder obscures the\nconfiguration of the connection.\nEyelet. A hollow tube inserted in a terminal or PWB to provide mechanical support for\ncomponent leads or for electrical connection.\n\n\nFlatpack. A part with two straight rows of leads (normally on 0.050 inch centers) that are parallel\nFillet. A smooth concave buildup of material between two surfaces; e.g., a fillet of solder between\na conductor and a solder pad or terminal.\nFlux. A chemically-active compound which, when heated, removes minor surface oxidation,\nminimizes oxidation of the basis metal, and promotes the formation of an intermetallic layer\nbetween solder and basis metal.\nFractured Solder Joint. A joint showing evidence of cracking, resulting from movement\nbetween the conductor and termination, after solidification of the solder.\nHaloing. Mechanically-induced fracturing or delaminating on or below the surface of the base\nPWB material; it is usually exhibited by a light area around holes, other machined areas, or both.\nHook Terminal. A terminal formed in a hook shape.\nInsufficient Solder Connection. A solder connection characterized by incomplete coverage of\none or more of the metal surfaces being joined or by incomplete solder fillets.\nInterfacial Connection. A conductor that connects conductive patterns between opposite sides\nof a PWB.\nInterlayer Connection. An electrical connection between conductive patterns in different layers\nof a PWB.\nJoint. A solder joint; a termination.\nLifted Land. A land that has lifted or separated from the base material, whether or not any resin\nis lifted with the land.\nMission Essential Support Equipment. Equipment used in a closed loop with the system, where\nfailure of this equipment would degrade the mission or imperil personnel. This category includes\nitems of ground support equipment whose functions are necessary to support the count down\nphase and those items of ground support equipment used in pre-count down phases whose\nproblems can create a safety hazard, cause damage to flight hardware, or inability to detect a\nproblem on the flight hardware.\nMeasling. Discrete white spots below the surface of the base material, usually caused by\nmoisture, pressure, and/or thermally induced stress.\nNick. A cut or notch on a conductor.\nNonwetting. A condition whereby a surface has contacted molten solder, but the solder has not\nadhered to all of the surface; basis metal remains exposed.\nOffgassing. The release of volatile parts from a substance when placed in a vacuum environment\nthat may affect crew members.\n\n\nOutgassing. The release of volatile parts from a substance when placed in a vacuum environment.\nOverheated Joint. An unsatisfactory solder joint, characterized by rough solder surface; dull,\nchalky, grainy, porous or pitted.\nPad. A portion of a conductive pattern used as a soldering area. Also called a land.\nPart. An element of a component, assembly, or subassembly that is not normally subject to\nfurther subdivision or disassembly without destruction of designed use.\nPart Lead. The solid conductor attached to a part.\nPierced (Perforated) Terminal. A terminal containing a hole through which conductors are\nplaced before soldering.\nPinhole. A solder connection with a small hole penetrating from the surface of the solder to a\nvoid of indeterminate size within the solder connection.\nPit. A relatively small recess in the solder surface, the bottom of which is visible from all angles of\nvision.\nPlated-Through-Hole. A plated-through hole is one formed by a deposition of metal on the\ninside surface of a through-hole. Also known as a supported hole. The configuration is used to\nprovide additional mechanical strength to the soldered termination or to provide an electrical\ninterconnection on a multilayer PWB.\nPorous Solder Joint. A joint having a grainy or gritty surface.\nPotting Compound. An electrically nonconductive compound used to partially encapsulate or for\na filler between parts, conductors, or assemblies.\nPrinted Wiring Assembly. The PWA consists of the PWB, components, and associated\nhardware and materials.\nPrinted Wiring Board. A pattern of conductors printed (screened) onto the surface of an\ninsulating base to provide interconnection for parts.\nRadial Lead. Lead wire extending from a component or module body along its latitudinal axis.\nRadial Split. A crack or other separation in the flange of an eyelet or other circular connector,\nwhich extends outward from the center. Such cracking is usually the result of swaging or other\nsetting process as the item is embraced in a printed wiring board.\nRepair. Operations performed on a nonconforming article to place it in usable condition. Repair\nis distinguished from rework in that alternate processes rather than reprocessing are employed.\nResistance Soldering. Method of soldering by passing a current between two electrodes through\nthe area to be soldered.\nRework. The reprocessing of articles or material that will make it conform to drawings,\nspecifications, and contract.\n\n\nRosin Solder Joint. Unsatisfactory connection that has entrapped rosin flux. This entrapment is\nusually due to insufficient heat or insufficient time at soldering temperature, or both, not enabling\nthe rosin to rise to the surface of the solder. This results in insufficient bonding and/or high\nelectrical resistance.\nSolder. A nonferrous, fusible metallic alloy used to join metallic surfaces.\nSolderability. The property of a surface that allows it to be wetted by a molten solder.\nSolder Connection. An electrical/mechanical connection that employs solder for the joining of\ntwo or more metal surfaces.\nSolder Mask. Coating material used to mask or protect selected areas of a pattern from the\naction of an etchant, solder, or plating.\nSolder Pad. Termination area on a printed wiring conductor.\nSolder Spatter. Extraneous irregular-shape solder fragments.\nSolder Spike. A cone shaped peak or sharp point of solder usually formed by the premature\ncooling and solidification of solder on removal of the heat source.\nSoldering. The process of joining clean metallic surfaces through the use of solder without direct\nfusion of the base metals.\nStaking Compound. An electrically nonconductive adhesive material used for additional support\nafter a component has been attached by mechanical or soldering process.\nStraight Pin Terminal. A round post-type smooth terminal, with no grooves.\nStraight-Through Termination. A conductor termination extending through a PWB without\nsubsequent forming of the lead.\nStress Relief. The formed portion of a conductor that provides sufficient length to minimize\nstress between terminations.\nStud Termination. An unbendable conductor termination extending through a PWB.\nSupplier. In-house NASA, NASA contractors, and subtier contractors.\nSurface Mounting. The electrical connection of components to the surface of a conductive\npattern that does not utilize part holes.\nSupportive Hole. A hole in a printed board that has its inside surface plated or otherwise\nreinforced.\nTerminal. A tie point device used for making electrical connection.\nTermination. The point at which electrical conductors are joined.\n\n\nTermination Area. A conductive surface on a PWB used for making electrical connections (also\nreferred to as a solder pad).\nThermal Shunt. A device with good heat dissipation characteristics used to conduct heat away\nfrom an article being soldered.\nTinning. The coating of a surface with a uniform layer of solder.\nTubelet. A tubular metal part. Its ends may or may not be flared.\nTurret Terminal. A round post-type grooved stud around which conductors are fastened before\nsoldering.\nUnsupported Hole. A hole containing no plating or other type of conductive reinforcement.\nVia. A PTH used as an interlayer connection, but in which there is no intention to insert a\ncomponent or other reinforcing material.\nVoid. A space enclosed on all sides by the solder.\nWave Soldering. A process wherein PWAs are brought in contact with the surface of\ncontinuously flowing and circulating solder.\nWetting. Flow and adhesion of a liquid to a solid surface, characterized by smooth, even edges,\nand a low dihedral angle.\nWicking. A flow of molten solder, flux, or cleaning solution by capillary action.\n\n\n3.2. Acronyms\nThe following acronyms apply to terms used in this Standard.\nACS American Chemical Society\nANSI American National Standards Institute\nASTM American Society for Testing and Materials\nAWG American Wire Gage\nCFR Code of Federal Regulation\nCVCM Collected Volatile Condensable Material\nDWV Dielectric Withstanding Voltage\nEEE Electrical, Electronic, and Electromechanical\nEMI Electromagnetic Interference\nESD Electrostatic Discharge\nESDS Electrostatic Discharge Sensitive\nFEP Fluorinated Ethylene Propylene\nGHz Gigahertz\nGSFC Goddard Space Flight Center\nIR Insulation Resistance\nJPL Jet Propulsion Laboratory\nlm/m2 Lumens per Square Meter\nMSDS Material Safety Data Sheet\nNaCl Sodium Chloride\nNAS NASA Assurance Standard\nNASA National Aeronautic and Space Administration\nNASA-STD NASA Standard\nNHB NASA Handbook\nNIST National Institute of Standards and Technology\nOD Outside Diameter\nOSHA Occupational Safety and Health Administration\nPTH Plated Through Hole\nPWA Printed Wiring Assembly\nPWB Printed Wiring Board\n\n\nRF Radio Frequency\nRFI Radio Frequency Interference\nRH Relative Humidity\nRMS Root Mean Squared\nSMT Surface Mount Technology\nTML Total Mass Loss\n\n\n1. Implementation. NASA quality assurance personnel will advise and assist suppliers,\nNASA personnel, and delegated agencies in the proper and effective implementation of the\nprovisions of this publication. Effective implementation includes establishing a system that will\nidentify each inspection point and maintain records.\n2. Changes in Requirements. When related requirements or changes in requirements\nare specified, NASA quality assurance personnel will assure that the Government agency\ndelegated to inspect at the supplier's site of fabrication has received full instructions so that the\nwork will be inspected to actual contract requirements.\n3. Nonstandard Processes, Materials, or Parts. When the supplier intends to use\nprocesses, materials, or parts not covered by this publication, the supplier shall document the\ndetails of fabrication and inspection, including acceptance and rejection criteria, and shall provide\nappropriate test data. Such documentation shall be approved by the procuring NASA Center prior\nto use.\n4. Internal Conditions. Unless parts are manufactured specifically to comply with\ncontracts or subcontracts citing this publication, internal connections of parts (as parts are defined\nin Appendix B) are not subject to the requirements of this publication. The supplier shall assure\nthat parts have suitable internal solder connections that will not unsolder or deteriorate when\ntinning is performed or external connections are made.\n5. Work Should Be Halted. If at any time, during any phase of the part mounting and/or\nthe soldering operation, a condition should arise that the operator feels may damage or in any way\naffect the reliability of the hardware, the work should be halted until that condition is reviewed\nand resolved.\n6. Material Safety Data Sheets (MSDS). MSDS shall be available for solders, fluxes,\nsolvents, and cleaners used in the area.\n4.2. Approval of Departures From This Standard\n1. Departures from this Standard require written approval from the cognizant NASA\ncontracting officer. The supplier is responsible for assuring that any departures from this\npublication are evaluated by, coordinated with, and submitted to the procuring NASA Center for\napproval prior to use or implementation.\n2. For in-house NASA projects, this publication requires written approval by the in-\nhouse NASA project management to deviate from the provisions herein.\n\n\n4.3. Reliable Soldered Connections\n1. Reliable soldered connections result from proper design; control of tools, materials,\nprocesses, and work environments; use of properly trained and skilled personnel; and careful\nworkmanship.\n2. The following requirements and design objectives should be used to ensure the reliable\nsoldered connections required by NASA:\na. Stress relief should be inherent in the design to avoid detrimental thermal and\nmechanical stresses on the solder connections.\nb. Where stress relief is not used, a plated-through hole (PTH) is mandatory.\nc. Materials selection should provide minimal thermal expansion coefficient mismatch\nat the constraint points of the parts mounting configuration.\nd. Parts mounting design requirements shall allow full visual or nondestructive\ninspection of all soldered connections.\n4.4. Documentation\n1. The supplier shall document the methods and procedures proposed to incorporate the\nrequirements of this publication into the design, fabrication, and inspection of solder connections\ninvolved in the contract or purchase order.\n2. Documents required herein, except as specified by paragraph 4.1-3, shall be submitted\nto the procuring NASA Center or its designated representative as required by the contract or\npurchase order. Applicable supplier soldering program documents, or portions thereof, accepted\non other NASA contracts shall be included whenever possible to avoid duplication of effort.\n4.5. Rework And Repair\n1. Rework. Rework is permissible unless excluded by other provisions of the contract.\nAll rework shall meet the requirements of this Standard and approved engineering documentation.\n2. Repair is not rework. Repairs shall be made only in compliance with applicable\ncontractual requirements and after authorization for each incident by the procuring NASA Center.\nRepairs shall be accomplished using documented methods previously approved by the procuring\nNASA Center. For in-house NASA projects, repairs shall be authorized for each incident by the\nProject Office and Quality Management, as appropriate.\n\n\nCHAPTER 5 - TRAINING AND CERTIFICATION PROGRAM\n1. The supplier is responsible for maintaining a documented training program that meets\n2. The supplier shall assure that the electronics packaging design personnel are familiar\nwith the requirements of this Standard, soldering techniques, and other pertinent requirements of\nthe contract. The supplier shall implement and document a training program that provides the\nnecessary training of soldering and inspection personnel in parts mounting and connections\nrequirements, soldering techniques, and use of equipment and procedures pertinent to their\nresponsibilities in performance of the contract requirements. The supplier is responsible for\ncertifying and maintaining the certification of each individual who solders, inspects, or instructs.\n3. Operators, inspectors, and instructors shall be qualified to fulfill all requirements of\nthis Standard that relate to their assigned tasks. Demonstration of proficiency and understanding\nof the requirements is a requisite for certification and recertification. Evidence of certification\nstatus shall be maintained in the work area.\n5.2 Vision Requirements\n1. The supplier is responsible for ensuring that all personnel who perform or inspect\nsoldered electrical connections meet the following vision test requirements as a prerequisite to\ntraining, certification, and recertification. The vision requirements may be met with corrected\nvision (personal eyeglasses). The vision tests shall be administered every 2 years by a qualified eye\nexaminer, accepted by the procuring supplier, using standard instruments and techniques. Results\nof the visual examinations shall be maintained and available for review.\n2. The following are minimum vision requirements:\na. Far Vision. Snellen Chart 20/50.\nb. Near Vision. Jaeger 1 at 35.5cm (14 inches), reduced Snellen 20/20, or\nequivalent.\nc. Color Vision. Ability to distinguish red, green, blue, and yellow colors as\nprescribed in Dvorine Charts, Ishihara Plates, or AO-HRR Tests.\nNOTE: A PRACTICAL TEST USING COLOR CODED WIRES AND/OR COLOR CODED\nELECTRICAL PARTS, AS APPLICABLE, IS ACCEPTABLE FOR COLOR\nVISION TESTING.\n\n\n5.3 Certification Levels\n1. Level A NASA instructors are certified by the NASA Training and Certification\nBoard. Level A NASA instructors have the authority to train Level B instructors, operators, and\ninspectors. Upon successful course completion, a certificate shall be issued.\n2. Certification of Level B instructors will be provided by the supplier based on\nsuccessful completion of training by a Level A NASA instructor. Level B instructors are\nauthorized to train operators and inspectors employed at their organization and subtier\ncontractors.\n3. Certification of inspectors shall be provided by the supplier based on successful\ncompletion of training by a Level A NASA instructor or Level B supplier instructor. An inspector\nis trained and certified to inspect for conformance with the requirements of this Standard.\n4. Certification of operators shall be provided by the supplier based on successful\ncompletion of training by a Level A NASA instructor or Level B supplier instructor. An operator\nis trained and certified to perform solder connections in conformance with the requirements of this\nStandard. When operators are certified to perform limited operations or processes, it shall be\nstated on the certification card.\n5.4 Training Program Requirements\n1. The supplier is responsible for training and certification of operators and inspectors in\nsoldering processes and associated processing equipment.\n2. The supplier training program documentation shall be submitted to the procuring\nNASA Center as directed by contract. A NASA Generic Soldered Electrical Connections Training\nPlan from the NASA Training Centers is available for use as a guideline.\n3. The training program shall:\na. Identify the criteria for qualification and certification of Level B instructors,\noperators, and inspectors.\nb. Document the methods and procedures proposed to fulfill the requirements of this\nStandard.\nc. Use visual standards consisting of satisfactory work samples or visual aids that\nclearly illustrate the quality characteristics of soldered connections applicable to the contract.\nd. Use applicable illustrations in this Standard, supplemented as necessary, for visual\nstandards. Standards of unacceptable conditions may also be used for clarification or comparison.\ne. Make applicable standards readily available.\n4. Wave Soldering Process Training Requirements. The supplier is responsible for\ntraining and certifying the wave soldering process instructors and operators.\n\n\n1. The supplier training program documentation shall describe the training and\ncertification program proposed to satisfy the requirements herein for the types of solder\nconnections to be made. This description shall include the following, as applicable:\na. Qualifications of instructors.\nb. Procedures for training, including who will be trained and for what purpose, (e.g.,\noperator, inspector).\nc. Lesson plan(s)/student standards.\nd. Hours of instruction.\ne. Procedures for certification and recertification.\nf. Procedures for recording training, recertification, and method of\nidentifying/recalling trained personnel.\ng. Certification criteria.\n2. Records of training and certification shall become part of the supplier's quality data\nand shall be retained for a minimum of 5 years.\n3. Evidence of certification status, including limitations, shall be available in the work\narea.\n5.6 Maintenance of Certification Status\n1. Maintenance of certification for instructors, operators, and inspectors requires\ncontinuous proficiency.\n2. Recertification of Level B instructors shall include the successful completion of\nretraining by a Level A NASA instructor. Recertification of operators and inspectors shall include\nsuccessful completion of retraining by a Level A NASA instructor or a Level B supplier\ninstructor.\n3. Recertification shall be required when:\na. Proficiency requirements herein are not met.\n(1) Instructors - proficiency unacceptable.\n(2) Operators - unsatisfactory quality of articles fabricated.\n(3) Inspectors - unsatisfactory quality of inspection.\n(4) Quality/quantitative data demonstrates a need for recertification.\nb. New soldering or inspection techniques have been approved that require different\nskills.\n\n\nc. Work period interruption of greater than 6 months occurs.\nd. Two years has elapsed since last certification.\n4. Certification shall be revoked when:\na. Certificate holder fails recertification.\nb. Certificate holder fails to meet visual acuity requirements of paragraph 5.2.\nc. Employment is terminated.\nd. Supplier training program fails to meet requirements set forth herein or set forth\notherwise in the contract.\n5.7 Training Resources\n1. Training of Level B instructors is available at either the Goddard Space Flight Center\n(GSFC) or Jet Propulsion Laboratory (JPL). The NASA Generic Soldered Electrical Connections\nTraining Plan will be supplied to instructors at the time of course completion.\na. GSFC\nTraining Center\nCode 300.1\nGreenbelt, MD 20771\n(301)731-8632\nFAX (301)731-8628\nb. JPL\nTraining Center\nMS83-204\n4800 Oak Grove Drive\nPasadena, CA 91109\n(818)354-6730\nFAX (818)393-0090\n2. Suppliers may train operator or inspector personnel in-house for certification or\nrecertification using certified instructors and approved soldering training programs, or arrange for\nthis training at one of the NASA-conducted schools.\n3. A fee is required. Contact either training center for information.\n\n\nCHAPTER 6 - FACILITIES, EQUIPMENT, MATERIALS, AND PARTS\n6.1 Facility Cleanliness\nThe work area shall be maintained in a clean and orderly condition. Smoking, eating, and drinking\nin soldering areas and at individual work stations shall not be permitted. Nonessential tools and\nmaterials shall not be permitted at the workstation.\n6.2 Environmental Conditions\n1. Controlled Environment. The soldering area shall have a controlled environment that\nlimits the entry of contamination. It shall be documented that the temperature and humidity of this\narea are monitored and maintained within the limits defined as the comfort zone in Figure 6-1.\nFigure 6-1.  Comfort Zone -- Temperature Versus Humidity Requirements\n2. Special Environmental Requirements. Parts or equipment being processed that\nrequire more stringent control of environmental conditions than those stated above shall have\nthese requirements and controls identified and specified on the engineering documentation.\n3. Ventilation System. Areas used for cleaning parts, and areas where toxic or volatile\nvapors are generated, shall have a ventilation system for removing air contaminants. The\nventilation system shall comply with the recommendations and guidelines of the Occupational\nSafety and Health Administration (OSHA) requirements, 29CFR.\n4. Field Operations. In field operations where the required controlled environment\nconditions cannot be effectively achieved, special precautions shall be taken to maximize the\nquality of solder connections and minimize the effects of the uncontrolled environment on the\noperation being performed on the hardware. These precautions shall be identified in the",
    "topic": "NASA-STD-8739.3-part1-ready.md"
}