{
    "output": [
        "Experimental work on human tissue at cryogenic temperatures has demonstrated the ability of THz \nradiation to distinguish cancerous from noncancerous tissue in both frozen oral959 and lymphatic960 tissues, \nand to distinguish porcine striated muscle from adipose tissues frozen to below -33 degC.961  The possibility \nof identifying melanoma in frozen skin tissue has also been studied,962 and THz radiation has been used to \ncharacterize frozen brain tissue samples altered by Alzheimer's disease.963  The THz resonance of \nmethylated DNA from solid cancer cell lines, otherwise difficult to observe in aqueous solution, has been \nmeasured using the freezing technique.964",
        "The response of frozen or vitrified cryoprotectants to THz radiation has not yet been tested.  However, it \nhas been pointed out that it is the dielectric properties, not the conductive ones, that cause water to absorb \nterahertz frequencies.965  The main ingredients in the commonly used cryoprotectant solution M22 are",
        "959 Sim YC, Park JY, Ahn KM, Park C, Son JH. Terahertz imaging of excised oral cancer at frozen temperature. Biomed Opt \nExpress. 2013 Jul 23;4(8):1413-21; https://www.osapublishing.org/viewmedia.cfm?uri=boe-4-8-1413&seq=0.  Sim YC, Ahn \nKM, Park JY, Park C, Son JH. Temperature-Dependent Terahertz Imaging of Excised Oral Malignant Melanoma. IEEE J. \nBiomed. Health Inform. 2013 Apr 29;17(4):779-784; https://ieeexplore.ieee.org/document/6509416. \n960 Park JY, Choi HJ, Cheon H, Cho SW, Lee S, Son JH. Terahertz imaging of metastatic lymph nodes using spectroscopic \nintegration technique. Biomed Opt Express. 2017 Jan 25;8(2):1122-1129; \nhttps://www.osapublishing.org/viewmedia.cfm?uri=boe-8-2-1122&seq=0. \n961 Hoshina H, Hayashi A, Miyoshi N, Fukunaga Y, Otani C. Terahertz pulsed imaging of frozen biological tissues. Appl Phys \nLett. 2009 Mar 23;94(12):123901; http://www2.riken.jp/lab-www/THz-img/hoshina/PDF/Hoshina_APL_02.pdf. \n962 Vilagosh Z, Lajevardipour A, Wood AW. Computational phantom study of frozen melanoma imaging at 0.45 terahertz. \nBioelectromagnetics. 2019 Feb;40(2):118-127; https://www.ncbi.nlm.nih.gov/pubmed/30699238. \n963 Png GM, Falconer RJ, Fischer BM, Zakaria HA, Mickan SP, Middelberg AP, Abbott D. Terahertz spectroscopic \ndifferentiation of microstructures in protein gels. Opt Express. 2009 Jul 20;17(15):13102-15; \nhttps://www.osapublishing.org/viewmedia.cfm?uri=oe-17-15-13102&seq=0. \n964 Cheon H, Yang HJ, Lee SH, Kim YA, Son JH. Terahertz molecular resonance of cancer DNA. Sci Rep. 2016 Nov \n15;6:37103; https://www.nature.com/articles/srep37103. \n965 Armstrong CM. The truth about terahertz. IEEE Spectrum, 17 Aug 2012; https://spectrum.ieee.org/aerospace/military/the-\ntruth-about-terahertz. \nhttp://www2.riken.jp/lab-www/THz-img/hoshina/PDF/Hoshina_APL_02.pdf\nhttps://spectrum.ieee.org/aerospace/military/the-truth-about-terahertz\nhttps://spectrum.ieee.org/aerospace/military/the-truth-about-terahertz",
        "water, dimethyl sulfoxide, ethylene glycol, and formamide.966  Comparing the dielectric constants of the \nliquid and solid (frozen) forms, we find e liq = 78 and esolid = 3.2 for water,967 e liq = 46.7 and esolid = 2.5 for \nDMSO at 1.5 GHz,968 and e liq = 37 and esolid = 1.6 for ethylene glycol at 1.5 GHz,969 which suggests that \nfrozen M22 might be as transparent to THz radiation as is water-ice.  This looks like an excellent topic for a",
        "(2) Diffuse optical imaging (DOI)970 is a medical imaging modality which uses near infrared light \nto generate images of the body via near-infrared spectroscopy (NIRS)971 or fluorescence-based methods.972  \nWhen used to create 3D volumetric models of the imaged material, DOI is called diffuse optical \ntomography or DOT.  The technique normally measures the optical absorption spectrum of hemoglobin that \nvaries with its oxygenation status as blood circulates, so if applied in the usual manner would likely be \ninapplicable to cryopreserved patients who lack both blood circulation and red cells containing hemoglobin \n(due to blood washout).  However, different tissues exhibit different thermal conductivity,973 so it seems \npossible in theory to discern vascular structures as distinct from nonvascular tissue.",
        "(3) Fourier transform infrared spectro-microtomography974 is a nondestructive 3D imaging \napproach that reveals the distribution of distinctive chemical compositions throughout an intact biological \nor materials sample, using a synchrotron-based mid-infrared beamline at the University of Wisconsin-\nMadison Synchrotron Radiation Center.  However, it is unclear if this method can be scaled up to \naccommodate 10 cm sized blocks of cryopreserved tissue.",
        "(4) Electrical Impedance Tomography (EID)975 is a medical imaging technique in which the \nelectrical conductivity, permittivity, and impedance of a part of the body is inferred from surface electrode \nmeasurements and used to form a tomographic image of that part.  Electrical conductivity varies",
        "966 Fahy GM, Wowk B, Wu J, Phan J, Rasch C, Chang A, Zendejas E. Cryopreservation of organs by vitrification: \nperspectives and recent advances. Cryobiology. 2004 Apr;48(2):157-78; \nhttp://www.21cm.com/pdfs/cryopreservation_advances.pdf. \n967 https://www.quora.com/What-is-the-dielectric-constant-of-water-ice. \n968 \"Dielectric Chart,\" Univ. Washington; https://depts.washington.edu/eooptic/linkfiles/dielectric_chart%5B1%5D.pdf;  \nMacklis JD, Ketterer FD. Microwave properties of cryoprotectants. Cryobiology. 1978 Dec;15(6):627-35; \nhttps://pdfs.semanticscholar.org/b64a/ed2704a698072a3d121edb863232c7956e88.pdf. \n969 \"Dielectric Constants of Common Liquids,\" The Engineering Toolbox; https://www.engineeringtoolbox.com/liquid-\ndielectric-constants-d_1263.html;  Macklis JD, Ketterer FD. Microwave properties of cryoprotectants. Cryobiology. 1978 \nDec;15(6):627-35; https://pdfs.semanticscholar.org/b64a/ed2704a698072a3d121edb863232c7956e88.pdf. \n970 https://en.wikipedia.org/wiki/Diffuse_optical_imaging. \n971 Durduran T, Choe R, Baker WB, Yodh AG. Diffuse Optics for Tissue Monitoring and Tomography. Rep Prog Phys. 2010 \nJul;73(7):076701; https://www.ncbi.nlm.nih.gov/pmc/articles/PMC4482362. \n972 Boas G. Imaging Technologies: Diffuse Optical Imaging. Athinoula A. Martinos Center for Biomedical Imaging, Jan 2005; \nhttps://web.archive.org/web/20120616155545/http://www.nmr.mgh.harvard.edu/martinos/research/technologiesDOI.php. \n973 Giering K, Minet O, Lamprecht I, Muller G. Review of thermal properties of biological tissues. SPIE PM 1995;25:45-65; \nhttps://www.researchgate.net/profile/Olaf_Minet/publication/294698829_Review_of_Thermal_Properties_of_Biological_Tiss\nues/links/5b69f556299bf14c6d951e8e/Review-of-Thermal-Properties-of-Biological-Tissues.pdf. \n974 Martin MC, Dabat-Blondeau C, Unger M, Sedlmair J, Parkinson DY, Bechtel HA, Illman B, Castro JM, Keiluweit M, \nBuschke D, Ogle B, Nasse MJ, Hirschmugl CJ. 3D spectral imaging with synchrotron Fourier transform infrared spectro-\nmicrotomography. Nat Methods. 2013 Sep;10(9):861-4; https://www.fpl.fs.fed.us/documnts/pdf2013/fpl_2013_martin001.pdf. \n975 https://en.wikipedia.org/wiki/Electrical_impedance_tomography. \nhttp://www.21cm.com/pdfs/cryopreservation_advances.pdf\nhttps://www.quora.com/What-is-the-dielectric-constant-of-water-ice\nhttps://depts.washington.edu/eooptic/linkfiles/dielectric_chart%5B1%5D.pdf\nhttps://web.archive.org/web/20120616155545/http:/www.nmr.mgh.harvard.edu/martinos/research/technologiesDOI.php\nhttps://www.researchgate.net/profile/Olaf_Minet/publication/294698829_Review_of_Thermal_Properties_of_Biological_Tissues/links/5b69f556299bf14c6d951e8e/Review-of-Thermal-Properties-of-Biological-Tissues.pdf\nhttps://www.researchgate.net/profile/Olaf_Minet/publication/294698829_Review_of_Thermal_Properties_of_Biological_Tissues/links/5b69f556299bf14c6d951e8e/Review-of-Thermal-Properties-of-Biological-Tissues.pdf\nhttps://www.fpl.fs.fed.us/documnts/pdf2013/fpl_2013_martin001.pdf",
        "considerably among various biological tissues, and sufficient conductivity of frozen tissue, perhaps loaded \nwith cryoprotectant, would have to be established for this technique to be successful.  Also, in contrast to \nthe X-rays used in Computed Tomography that travel in straight lines, electric currents travel three \ndimensionally along the paths of least resistivity, so inevitably parts of the electric current leave the \ntransverse plane, greatly complicating 3D image reconstruction.  Nevertheless, radiofrequency imaging of \ntissues for cancer detection and identification is now commonplace.976",
        "4.2  Macrovascular Excavation \nOnce a 3D map of the large vessels of the vasculature of a cryopreserved human patient has been \nnoninvasively compiled (Section 4.1), the next step is to cleanly excavate the frozen water-ice or vitrified \ncryoprotectant from the interior of these vessels.  This excavation should clear ice from the lumena of all \nmajor blood vessels, lymph vessels, and cerebrospinal fluid channels and other intracerebral fluid \nchambers, probably replacing the removed contents with oxygen-free cold nitrogen gas or liquid nitrogen.  \nExcavation will extend from the heart chambers to the most distal termini of all vessels identified in the \nmap, including vessel diameters at least as small as 1 mm but ideally as small as 0.1 mm (Section 4.1). \nThe large-bore vasculature can be conveniently excavated at LN2 temperatures - either relatively quickly \nby map following (i.e., cartographic excavation;  Section 4.2.1) or more slowly by exploratory methods if \nnecessary (i.e., exploratory excavation;  Section 4.2.2).  For many cryopatients, some combination of both \nmethods may be required if the maps of the large-bore vasculature are not entirely complete.",
        "4.2.1  Cartographic Excavation \nExcavation nanorobots are employed to remove mainly frozen water-ice or vitrification cryoprotectant \nmaterials977 from all major blood vessels identified on the large-vessel 3D vascular map, a process that may \nbe called cartographic excavation.  Due to the presence of the map, there can be some reasonable assurance \nthat most major vessels, including the lymphatics,978 will have been identified and can be excavated, and it \nwill be possible to calculate the safest pathways between termini of broken vessels that have been bisected \nand separated by up to 0.1 mm due to cracking (Section 3.4.3).  For the few large vessels that might be \nmissed during the scan, they can be found later either by excavation upward in size from the capillary beds \nreaching the other (missing) side of the vessel, or, in the case of vessel segments completely isolated by \nseparate breaks on either side and not detected by the original scan, by capillary bed analysis that should \ndetect blocks of tissue that appear to lack sufficient vascularization, followed by exploratory excavation \n(Section 4.2.2) of those few blocks of tissue. \nIf only a 1 mm vascular map was available, this excavation would involve clearing out ~11,541 arterial \nvessels (including aorta, large arteries, main artery branches, and terminal artery branches) of lumenal",
        "976 Kaufman Z, Paran H, Haas I, Malinger P, Zehavi T, Karni T, Pappo I, Sandbank J, Diment J, Allweis T. Mapping breast \ntissue types by miniature radio-frequency near-field spectroscopy sensor in ex-vivo freshly excised specimens. BMC Med \nImaging. 2016 Oct 10;16(1):57; https://www.ncbi.nlm.nih.gov/pmc/articles/PMC5057390/. \n977 Some large blood clots may also need to be removed. \n\"Lymphatic System\"; http://www.nanomedicine.com/NMI/8.2.1.3.htm.",
        "volume ~500 cm3, plus another ~11,541 venous vessels (including vena cava, large veins, main venous \nbranches, and terminal veins)979 of lumenal volume ~3350 cm3,980 for a blood vessel excavation volume of \n~3850 cm3, out of the total ~5400 cm3 blood volume.  The excavation must also clear out ~12 large \nlymphatic vessels (including the thoracic duct, right lymphatic duct, main trunks, and cisterna chylii) and \n~100 minor lymphatic trunks of lumenal volume ~11 cm3,981 the entire cardiac chamber volume of ~450 \ncm3, and the entire ~150 cm3 volume of cerebrospinal fluid,982 giving a total clearance volume of Vice,1mm ~ \n4461 cm3. \nIf a 0.1 mm-resolution vascular map is available, the excavation will include an additional ~4,500,000 \narterioles of lumenal volume ~70 cm3 and ~4,500,000 venules of lumenal volume ~355 cm3, increasing the \nblood vessel excavation volume by ~425 cm3 to a grand total of ~4275 cm3 for the blood vessels, out of the \ntotal ~5400 cm3 blood volume.  To this must be added ~618,700 lymphonodal collecting ducts of lumenal \nvolume ~363 cm3 and ~68,000,000 lymphatic precollecting ducts of lumenal volume ~1200 cm3, \nrepresenting another ~1563 cm3 of lymphatic volume, making a grand total of ~1574 cm3, out of the total \n~3300 cm3 lymphatic system volume.  These extra vessels add ~1988 cm3, increasing the total clearance \nvolume to Vice,0.1mm ~ 6449 cm3.  All these volumes would be ~43 times smaller983 if only the brain is \nconsidered. \nNote that these excavation volumes refer to fully-patent liquid-filled vessels in living patients and might \nchange in as yet unmeasured amounts due to:  (A) a volume increase due to the osmotic outflow of water \nfrom tissues into blood vessels during the cryopreservation process (e.g., brain blood vessels are maximally \ndilated during cryoprotectant perfusion);  (B) a volume change ranging from +9% expansion for pure water \nas it freezes at 0 degC (273 K) to -5% contraction of pure M22 \ncryoprotective solution as it solidifies during cooling from 0 degC \nto -150 degC (123 K) (see chart, Section 5.2.3.1(B));  or (C) an \nincrease or decrease in vessel mechanical patency compared to \nliving vasculature, after perfusion with cryoprotectant and \nsubsequent solidification of lumenal contents during \ncryopreservation.  Measuring and modeling the exact changes \nwould be a useful experimental project for future research. \nThe excavation nanorobots may be conceptualized as a \nloosely-space-filling utility fog984 (image, left) that advances",
        "979 The venous tree including the hepatic portal system (https://en.wikipedia.org/wiki/Hepatic_portal_system) and the \nhypophyseal portal system (https://en.wikipedia.org/wiki/Hypophyseal_portal_system), which transport venous blood between \ntwo capillary beds. \n980 Freitas RA Jr. Nanomedicine, Volume I: Basic Capabilities, Landes Bioscience, Georgetown TX, 1999, Table 8.1, \n\"Approximate Quantification of the Human Arteriovenous System\"; http://www.nanomedicine.com/NMI/Tables/8.1.jpg. \n981 Freitas RA Jr. Nanomedicine, Volume I: Basic Capabilities, Landes Bioscience, Georgetown TX, 1999, Table 8.5, \n\"Approximate Quantification of the Human Lymphatic System\"; http://www.nanomedicine.com/NMI/Tables/8.5.jpg. \n982 Freitas RA Jr. Nanomedicine, Volume I: Basic Capabilities, Landes Bioscience, Georgetown TX, 1999, Table 8.9, \"Mass, \nVolume, and Scale Size of the Organs of the Human Body\"; http://www.nanomedicine.com/NMI/Tables/8.9.jpg. \n983 [average human brain volume ~1.4 L (https://en.wikipedia.org/wiki/Brain_size)] / [average human body volume ~ 60 L \n(http://www.nanomedicine.com/NMI/8.2.5.htm)] = 1/43. \n984 Hall JS. Utility fog: A universal physical substance. Vision 21: Interdisciplinary Science and Engineering in the Era of \nCyberspace, NASA-Lewis Research Center (N94-27367), Dec 1993, pp. 115-126; \nhttps://ntrs.nasa.gov/archive/nasa/casi.ntrs.nasa.gov/19940022864.pdf.  See also:  https://www.autogeny.org/Ufog.html and \nhttps://ntrs.nasa.gov/archive/nasa/casi.ntrs.nasa.gov/19940022864.pdf",
        "slowly from the entry point(s) throughout the vascular space to be cleared, filling that space as it moves \nforward like an extensible \"mining worm\".  Active robots at the forward end follow the map and remove \nbits of ice, clearing the vessel lumen all the way to the cold-immobilized endothelial cell surfaces lining the \nvessel walls.  The bits of ice are transported rearward through relatively inactive robots comprising the \nbody of the \"worm\" and thence out of the body.  Excavation proceeds until all vessels identified in the map \nhave been cleared of ice and replaced with liquid nitrogen.  Entry points can include any convenient large \nvessel located near the skin surface, or accessible via open respiratory volumes, or even the heart.  During \ncryopreservation the entry point for washout is the femoral artery (for whole-body) or the carotid artery (for \nneuro) and the cannula is normally left in place,985 providing a convenient entry point for tunneling \nnanorobots. \nThe hepatic portal vein986 is a special case because it does not carry blood directly from the arterial to the \nvenous circuit, but rather connects two capillary beds, carrying blood to the liver987 from the \ngastrointestinal tract, the gallbladder, the pancreas, and the spleen.  Because the large 6-12 mm diameter988 \nportal vein is not directly accessible from large vessels on either the arterial or venous side of the \ncirculation, special arrangements might be made for its early excavation, possibly employing a targeted \nnanosyringe (Section 4.12.2.8) or nanocatheter (Section 4.12.3.1) apparatus.  The only other portal \nsystem989 found in humans, the hypophyseal portal system990 that transports hormones between the \nhypothalamus and the anterior pituitary in the brain, has venules that are 300 mm long and 32 mm in \ndiameter (in rats)991 that will be excavated along with the rest of the microvasculature (Section 4.4), hence \nrequire no special handling here.  The efferent arterioles992 in the human kidney that carry blood from the \nglomerular capillaries to a second peritubular capillary network, sometimes mistaken for the renal portal \nsystem993 that is found only in non-mammalian kidneys, are also microscale in size and will be excavated \nlater in due course (Section 4.4). \nAnother interesting minor challenge is how the nanorobots will nondestructively pass through numerous \nvenous,994 lymphatic,995 and heart996 valves, most of which consist of simple bicuspid flaps of tissue that",
        "985 https://www.alcor.org/library/alcor-human-cryopreservation-protocol/. \n986 https://en.wikipedia.org/wiki/Portal_vein. \n987 The liver receives 75% of its blood supply from the hepatic portal vein and 25% from the regular arterial circulation; \nhttps://en.wikipedia.org/wiki/Liver#Blood_supply. \n988 Wanless IR, Huang WY. \"Vascular Disorders,\" in:  Burt AD, Portmann BC, Ferrell LD, eds., MacSween's Pathology of \nthe Liver, 6th Edition, 2012, pp. 601-643; https://www.sciencedirect.com/science/article/pii/B978070203398800012X. \n989 https://en.wikipedia.org/wiki/Portal_venous_system. \n990 https://en.wikipedia.org/wiki/Hypophyseal_portal_system. \n991 Gross PM, Joneja MG, Pang JJ, Polischuk TM, Shaver SW, Wainman DS. Topography of short portal vessels in the rat \npituitary gland: a scanning electron-microscopic and morphometric study of corrosion cast replicas. Cell Tissue Res. 1993 \nApr;272(1):79-88; https://pubmed.ncbi.nlm.nih.gov/8481959/. \n992 https://en.wikipedia.org/wiki/Efferent_arteriole. \n993 https://en.wikipedia.org/wiki/Renal_portal_system. \n994 Caggiati A. The venous valves of the lower limbs. Phlebolymphology 2013;20(2):87-95; \nhttps://www.phlebolymphology.org/wp-content/uploads/2014/09/Phlebolymphology78.pdf.  See also:  \nhttps://www.jobst.com/mainnavigation/leg-health/veins-valves.html and https://en.wikipedia.org/wiki/Vein. \n995 Scallan JP, Zawieja SD, Castorena-Gonzalez JA, Davis MJ. Lymphatic pumping: mechanics, mechanisms and malfunction. \nJ Physiol. 2016 Oct 15;594(20):5749-5768; https://www.ncbi.nlm.nih.gov/pmc/articles/PMC5063934/.  See also:  \nhttps://www.phlebolymphology.org/wp-content/uploads/2014/09/Phlebolymphology78.pdf\nhttps://www.jobst.com/mainnavigation/leg-health/veins-valves.html",
        "will be frozen solid in the cryopreserved patient.  Future research should determine the typical states of \nthese valves following cryopreservation.997  If valves are typically blocked open with bits of interposed ice, \nthen robot passage should be easy once the bits of ice are cleared away.  If valves are completely sealed, \nthen a small amount of valve tissue holing or trimming by the robots might be required, mindful that only a \nfew microns of clearance may be needed for successful excavation operations to proceed.  Precapillary \nsphincters998 (smooth muscle fibers encircling the entrance to capillaries, found uniquely in the \nmesenteric999 circulation) might have squeezed shut some vessels, so the typical states of these sphincters \nfollowing cryopreservation should also be the subject of future research.",
        "The precise workings of nanorobots that perform ice excavation have not yet been detailed but don't seem \nconceptually complex.  One published estimate1000 of the power requirements for a drobot = 1 mm diameter \nnanorobot mechanically locomoting at vrobot ~ 1 mm/sec through solid ice via viscoplastic flow in which ice \ncrystal at a temperature just below freezing is deformed without breaking is Probot ~ 200,000 pW.  However, \nthis seems excessive compared to an excavation scheme in which most of the spoil is exported from the ice \nface through the utility fog \"mining worms\" and thence out of the body as still-unmelted microchunks of \nice, with the mining robots and local environment maintained at cryogenic temperatures by the suffusion of \nliquid nitrogen throughout the theater of operation. \nFor simplicity of analysis, consider an excavation robot that removes a cubic block of ice of linear \ndimension Lice by passing a cutting instrument1001 around the perimeter of the ice cube in order to free it \nfrom the larger ice face.  The cutting instrument cleaves a narrow layer of thickness tcut across all five \nunexposed sides,1002 removing spoil of volume Vspoil ~ 5 tcut Lice\n2 to release an ice cube of volume Vcube = \n(Lice - 2tcut)3 from the ice face which is then transported intact and still frozen out of the body.",
        "996 Ayoub S, Ferrari G, Gorman RC, Gorman JH, Schoen FJ, Sacks MS. Heart Valve Biomechanics and Underlying \nMechanobiology. Compr Physiol. 2016 Sep 15;6(4):1743-1780; https://www.ncbi.nlm.nih.gov/pmc/articles/PMC5537387/.  \nSee also:  https://en.wikipedia.org/wiki/Heart_valve. \n997 This may vary considerably from one patient to another, both on an individual basis and as a function of cryopreservation \nquality, and will be useful information to determine how much variation the algorithms and nanorobots must be able to handle. \n998 Sakai T, Hosoyamada Y. Are the precapillary sphincters and metarterioles universal components of the microcirculation? \nAn historical review. J Physiol Sci. 2013 Sep;63(5):319-31; https://www.ncbi.nlm.nih.gov/pmc/articles/PMC3751330/. \n999 https://en.wikipedia.org/wiki/Mesentery. \n1000 Freitas RA Jr. Nanomedicine, Volume I: Basic Capabilities, Landes Bioscience, Georgetown TX, 1999, Section 10.5.2, \n\"Viscosity and Locomotion in Ice\"; http://www.nanomedicine.com/NMI/10.5.2.htm. \n1001 Concepts in the existing nanomachinery literature include a rotating cylindrical \"core sampler\" tool and \"coarse shearing\" \ntools,* and morcellation and mincing cutting tools.+ \n  * Freitas RA Jr. Nanomedicine, Volume I: Basic Capabilities, Landes Bioscience, Georgetown TX, 1999, Section 9.3.2, \n\"Nanoscale End-Effectors and Tool Tips\"; http://www.nanomedicine.com/NMI/9.3.2.htm. \n  + Freitas RA Jr. Nanomedicine, Volume I: Basic Capabilities, Landes Bioscience, Georgetown TX, 1999, Section 9.3.5.1, \n\"Morcellation and Mincing\"; http://www.nanomedicine.com/NMI/9.3.5.1.htm. \n1002 While simple ice core augers are well-known,* there are many ways to gain cutting access to the fifth side at the bottom of \nthe cube being extracted.  For example, a starter hole can be drilled to the depth of the bottom face that is sufficiently wide to \nadmit a sideways cutting instrument, from which the rest of that cutting plane becomes readily accessible across the entire \nface.  Alternatively, the initial cut could be made at a downward angle, establishing a cutting plane ramp that zigzags deeper \nwith each traverse, thus avoiding the need to drill a starter hole for each new plane of ice (though producing slanted cubes).  \nCircumferential side-cutting devices have also been patented for medical use.+ \n  * https://en.wikipedia.org/wiki/Ice_core and https://en.wikipedia.org/wiki/Ice_drilling#Coring_augers. \n  + McGuckin JF Jr. Breast surgery method and apparatus. U.S. Patent 7,753,920, 13 Jun 2010;",
        "The energy required to free the ice cube can be conservatively estimated as the energy required to melt the \nspoil.  The energy cost to (locally) melt the spoil ice is ED,melt = r ice Hfusion,water = 3.1 x 108 J/m3, where r ice \n= 916.7 kg/m3 (the density of ice at 0 degC) and Hfusion,water = 333,550 J/kg (the heat of fusion of water at 0 \ndegC),1003 plus the energy cost to (locally) warm the ice from TLN2 = 77 K to Tice,melt ~ 273 K (~0 degC) which is \nED,warm ~ r ice cice (Tice,melt - TLN2) = 2.5 x 108 J/m3, where cice ~ 1400 J/kg-K (the average specific heat \ncapacity of ice over the indicated temperature range).1004  (Nonaqueous cryopreservative chemicals such as \nDMSO1005 and ethylene glycol1006 have lower heats of fusion and heat capacities, hence their inclusion in \nthe above calculations would only lower the total energy estimate.)  Taking the total reliquidification \nenergy as ED,liq = ED,warm + ED,melt = 5.6 x 108 J/m3 for our crude estimate of the energy cost of excavation \nyields EExcavation ~ ED,liq Vspoil = 28 pJ per ice cube of volume Vcube = 0.941 mm3 with Lice = 1 mm, tcut = 10 \nnm, and Vspoil = 0.05 mm3.  The energy cost for hand-over-hand transport of one intact microscale ice cube \nusing a telescoping manipulator arm is ~10 zJ/nm,1007 or Etransport ~ 10 pJ to move the ice cube ~1 meter to \nexit the body. \nExpending only ~28 pJ/ice cube, a Probot = 100 pW excavation nanorobot should be able to target a removal \nrate of ncubes ~ 1 ice cube per second, allowing a rate of advance through the vasculature of vclearance ~ 1 \nmm/sec.  If the average path length of a complete vascular circuit (mainly noncapillaries) is Lvasc ~ 1.5 \nm,1008 then the time required to clear ice from noncapillary vessels is on the order of tclearance ~ Lvasc / \nvclearance = 1.5 x 106 sec ~ 17 days.  Taking the ice removal rate by front-line active excavation nanorobots \nas rremoval = 1 mm3/nanorobot-sec, then the excavation fleet required to clear a 1-mm resolution vascular \nmap must include Nnanorobots,1mm = Vice,1mm / (rremoval tclearance) = 2.97 x 109 front-line nanorobots with a \ncontinuous average fleet power generation of Pfleet,1mm = Probot Nnanorobots,1mm = 0.30 W, or Nnanorobots,0.1mm = \nVice,0.1mm / (rremoval tclearance) = 4.30 x 109 nanorobots to clear a 0.1-mm resolution vascular map with \nPfleet,0.1mm = Probot Nnanorobots,0.1mm = 0.43 W.  These figures do not include the much larger number of \nnanorobots trailing behind the front-line devices that will be relatively inactive, engaging only in relatively \nlow-power hand-over-hand transport tasks.  The total number of ice cubes that are removed and must be \ntransported is Nicecubes,0.1mm ~ Vice,0.1mm / Lice\n3 = 6.449 x 1015, adding only a modest Ptransport,0.1mm = \nNicecubes,0.1mm Etransport / tclearance = 0.043 W to the continuous average fleet power requirement. \nFrozen tissue at 77 K (-196 degC) with a density of ~ 932 kg/m3 (if mostly water-ice)1009 should have a \nspecific heat capacity of ~0.63 pJ/mm3-K,1010 so even if there are many cubic microns of frozen tissue",
        "1003 https://en.wikipedia.org/wiki/Properties_of_water. \n1004 Robert C. Weast, Handbook of Chemistry and Physics, 49th Edition, CRC, Cleveland OH, 1968; \"Specific Heat of Ice,\" -\n200 degC to -2.2 degC, p. D-95.  See also:  https://www.engineeringtoolbox.com/ice-thermal-properties-d_576.html. \n1005 The heat of fusion for solid DMSO is ~ 2 x 108 J/m3 (https://en.wikipedia.org/wiki/Dimethyl_sulfoxide_(data_page)), well \nbelow the 3.1 x 108 J/m3 value for solid water-ice.  The heat capacity of liquid DMSO is ~2 x 106 J/m3-K \n(https://en.wikipedia.org/wiki/Dimethyl_sulfoxide_(data_page)), well below the 4.22 x 106 J/m3-K value for liquid water at 0 \ndegC (https://www.engineeringtoolbox.com/specific-heat-capacity-water-d_660.html). \n1006 The heat of fusion for solid ethylene glycol is ~ 1.8 x 108 J/m3 \n(https://en.wikipedia.org/wiki/Ethylene_glycol_(data_page)), well below the 3.1 x 108 J/m3 value for solid water-ice.  The heat \ncapacity of liquid ethylene glycol at 0 degC is ~2.7 x 106 J/m3-K (https://www.engineeringtoolbox.com/ethylene-glycol-\nd_146.html), well below the 4.22 x 106 J/m3-K value for liquid water at 0 degC (https://www.engineeringtoolbox.com/specific-\nheat-capacity-water-d_660.html). \n\"Approximate Quantification of the Human Arteriovenous System\"; http://www.nanomedicine.com/NMI/Tables/8.1.jpg. \n1009 Handle PH, Loerting T. Temperature-induced amorphisation of hexagonal ice. Phys Chem Chem Phys. 2015 Feb \n21;17(7):5403-5417; https://pubs.rsc.org/en/content/articlehtml/2015/cp/c4cp05587j."
    ],
    "input": "Experimental work on human tissue at cryogenic temperatures has demonstrated the ability of THz \nradiation to distinguish cancerous from noncancerous tissue in both frozen oral959 and lymphatic960 tissues, \nand to distinguish porcine striated muscle from adipose tissues frozen to below -33 degC.961  The possibility \nof identifying melanoma in frozen skin tissue has also been studied,962 and THz radiation has been used to \ncharacterize frozen brain tissue samples altered by Alzheimer's disease.963  The THz resonance of \nmethylated DNA from solid cancer cell lines, otherwise difficult to observe in aqueous solution, has been \nmeasured using the freezing technique.964   \nThe response of frozen or vitrified cryoprotectants to THz radiation has not yet been tested.  However, it \nhas been pointed out that it is the dielectric properties, not the conductive ones, that cause water to absorb \nterahertz frequencies.965  The main ingredients in the commonly used cryoprotectant solution M22 are \n                                                 \n959 Sim YC, Park JY, Ahn KM, Park C, Son JH. Terahertz imaging of excised oral cancer at frozen temperature. Biomed Opt \nExpress. 2013 Jul 23;4(8):1413-21; https://www.osapublishing.org/viewmedia.cfm?uri=boe-4-8-1413&seq=0.  Sim YC, Ahn \nKM, Park JY, Park C, Son JH. Temperature-Dependent Terahertz Imaging of Excised Oral Malignant Melanoma. IEEE J. \nBiomed. Health Inform. 2013 Apr 29;17(4):779-784; https://ieeexplore.ieee.org/document/6509416. \n960 Park JY, Choi HJ, Cheon H, Cho SW, Lee S, Son JH. Terahertz imaging of metastatic lymph nodes using spectroscopic \nintegration technique. Biomed Opt Express. 2017 Jan 25;8(2):1122-1129; \nhttps://www.osapublishing.org/viewmedia.cfm?uri=boe-8-2-1122&seq=0. \n961 Hoshina H, Hayashi A, Miyoshi N, Fukunaga Y, Otani C. Terahertz pulsed imaging of frozen biological tissues. Appl Phys \nLett. 2009 Mar 23;94(12):123901; http://www2.riken.jp/lab-www/THz-img/hoshina/PDF/Hoshina_APL_02.pdf. \n962 Vilagosh Z, Lajevardipour A, Wood AW. Computational phantom study of frozen melanoma imaging at 0.45 terahertz. \nBioelectromagnetics. 2019 Feb;40(2):118-127; https://www.ncbi.nlm.nih.gov/pubmed/30699238. \n963 Png GM, Falconer RJ, Fischer BM, Zakaria HA, Mickan SP, Middelberg AP, Abbott D. Terahertz spectroscopic \ndifferentiation of microstructures in protein gels. Opt Express. 2009 Jul 20;17(15):13102-15; \nhttps://www.osapublishing.org/viewmedia.cfm?uri=oe-17-15-13102&seq=0. \n964 Cheon H, Yang HJ, Lee SH, Kim YA, Son JH. Terahertz molecular resonance of cancer DNA. Sci Rep. 2016 Nov \n15;6:37103; https://www.nature.com/articles/srep37103. \n965 Armstrong CM. The truth about terahertz. IEEE Spectrum, 17 Aug 2012; https://spectrum.ieee.org/aerospace/military/the-\ntruth-about-terahertz. \nhttp://www2.riken.jp/lab-www/THz-img/hoshina/PDF/Hoshina_APL_02.pdf\nhttps://spectrum.ieee.org/aerospace/military/the-truth-about-terahertz\nhttps://spectrum.ieee.org/aerospace/military/the-truth-about-terahertz\n\n\nwater, dimethyl sulfoxide, ethylene glycol, and formamide.966  Comparing the dielectric constants of the \nliquid and solid (frozen) forms, we find e liq = 78 and esolid = 3.2 for water,967 e liq = 46.7 and esolid = 2.5 for \nDMSO at 1.5 GHz,968 and e liq = 37 and esolid = 1.6 for ethylene glycol at 1.5 GHz,969 which suggests that \nfrozen M22 might be as transparent to THz radiation as is water-ice.  This looks like an excellent topic for a \n (2) Diffuse optical imaging (DOI)970 is a medical imaging modality which uses near infrared light \nto generate images of the body via near-infrared spectroscopy (NIRS)971 or fluorescence-based methods.972  \nWhen used to create 3D volumetric models of the imaged material, DOI is called diffuse optical \ntomography or DOT.  The technique normally measures the optical absorption spectrum of hemoglobin that \nvaries with its oxygenation status as blood circulates, so if applied in the usual manner would likely be \ninapplicable to cryopreserved patients who lack both blood circulation and red cells containing hemoglobin \n(due to blood washout).  However, different tissues exhibit different thermal conductivity,973 so it seems \npossible in theory to discern vascular structures as distinct from nonvascular tissue. \n (3) Fourier transform infrared spectro-microtomography974 is a nondestructive 3D imaging \napproach that reveals the distribution of distinctive chemical compositions throughout an intact biological \nor materials sample, using a synchrotron-based mid-infrared beamline at the University of Wisconsin-\nMadison Synchrotron Radiation Center.  However, it is unclear if this method can be scaled up to \naccommodate 10 cm sized blocks of cryopreserved tissue. \n (4) Electrical Impedance Tomography (EID)975 is a medical imaging technique in which the \nelectrical conductivity, permittivity, and impedance of a part of the body is inferred from surface electrode \nmeasurements and used to form a tomographic image of that part.  Electrical conductivity varies \n                                                 \n966 Fahy GM, Wowk B, Wu J, Phan J, Rasch C, Chang A, Zendejas E. Cryopreservation of organs by vitrification: \nperspectives and recent advances. Cryobiology. 2004 Apr;48(2):157-78; \nhttp://www.21cm.com/pdfs/cryopreservation_advances.pdf. \n967 https://www.quora.com/What-is-the-dielectric-constant-of-water-ice. \n968 \"Dielectric Chart,\" Univ. Washington; https://depts.washington.edu/eooptic/linkfiles/dielectric_chart%5B1%5D.pdf;  \nMacklis JD, Ketterer FD. Microwave properties of cryoprotectants. Cryobiology. 1978 Dec;15(6):627-35; \nhttps://pdfs.semanticscholar.org/b64a/ed2704a698072a3d121edb863232c7956e88.pdf. \n969 \"Dielectric Constants of Common Liquids,\" The Engineering Toolbox; https://www.engineeringtoolbox.com/liquid-\ndielectric-constants-d_1263.html;  Macklis JD, Ketterer FD. Microwave properties of cryoprotectants. Cryobiology. 1978 \nDec;15(6):627-35; https://pdfs.semanticscholar.org/b64a/ed2704a698072a3d121edb863232c7956e88.pdf. \n970 https://en.wikipedia.org/wiki/Diffuse_optical_imaging. \n971 Durduran T, Choe R, Baker WB, Yodh AG. Diffuse Optics for Tissue Monitoring and Tomography. Rep Prog Phys. 2010 \nJul;73(7):076701; https://www.ncbi.nlm.nih.gov/pmc/articles/PMC4482362. \n972 Boas G. Imaging Technologies: Diffuse Optical Imaging. Athinoula A. Martinos Center for Biomedical Imaging, Jan 2005; \nhttps://web.archive.org/web/20120616155545/http://www.nmr.mgh.harvard.edu/martinos/research/technologiesDOI.php. \n973 Giering K, Minet O, Lamprecht I, Muller G. Review of thermal properties of biological tissues. SPIE PM 1995;25:45-65; \nhttps://www.researchgate.net/profile/Olaf_Minet/publication/294698829_Review_of_Thermal_Properties_of_Biological_Tiss\nues/links/5b69f556299bf14c6d951e8e/Review-of-Thermal-Properties-of-Biological-Tissues.pdf. \n974 Martin MC, Dabat-Blondeau C, Unger M, Sedlmair J, Parkinson DY, Bechtel HA, Illman B, Castro JM, Keiluweit M, \nBuschke D, Ogle B, Nasse MJ, Hirschmugl CJ. 3D spectral imaging with synchrotron Fourier transform infrared spectro-\nmicrotomography. Nat Methods. 2013 Sep;10(9):861-4; https://www.fpl.fs.fed.us/documnts/pdf2013/fpl_2013_martin001.pdf. \n975 https://en.wikipedia.org/wiki/Electrical_impedance_tomography. \nhttp://www.21cm.com/pdfs/cryopreservation_advances.pdf\nhttps://www.quora.com/What-is-the-dielectric-constant-of-water-ice\nhttps://depts.washington.edu/eooptic/linkfiles/dielectric_chart%5B1%5D.pdf\nhttps://web.archive.org/web/20120616155545/http:/www.nmr.mgh.harvard.edu/martinos/research/technologiesDOI.php\nhttps://www.researchgate.net/profile/Olaf_Minet/publication/294698829_Review_of_Thermal_Properties_of_Biological_Tissues/links/5b69f556299bf14c6d951e8e/Review-of-Thermal-Properties-of-Biological-Tissues.pdf\nhttps://www.researchgate.net/profile/Olaf_Minet/publication/294698829_Review_of_Thermal_Properties_of_Biological_Tissues/links/5b69f556299bf14c6d951e8e/Review-of-Thermal-Properties-of-Biological-Tissues.pdf\nhttps://www.fpl.fs.fed.us/documnts/pdf2013/fpl_2013_martin001.pdf\n\n\nconsiderably among various biological tissues, and sufficient conductivity of frozen tissue, perhaps loaded \nwith cryoprotectant, would have to be established for this technique to be successful.  Also, in contrast to \nthe X-rays used in Computed Tomography that travel in straight lines, electric currents travel three \ndimensionally along the paths of least resistivity, so inevitably parts of the electric current leave the \ntransverse plane, greatly complicating 3D image reconstruction.  Nevertheless, radiofrequency imaging of \ntissues for cancer detection and identification is now commonplace.976 \n4.2  Macrovascular Excavation \nOnce a 3D map of the large vessels of the vasculature of a cryopreserved human patient has been \nnoninvasively compiled (Section 4.1), the next step is to cleanly excavate the frozen water-ice or vitrified \ncryoprotectant from the interior of these vessels.  This excavation should clear ice from the lumena of all \nmajor blood vessels, lymph vessels, and cerebrospinal fluid channels and other intracerebral fluid \nchambers, probably replacing the removed contents with oxygen-free cold nitrogen gas or liquid nitrogen.  \nExcavation will extend from the heart chambers to the most distal termini of all vessels identified in the \nmap, including vessel diameters at least as small as 1 mm but ideally as small as 0.1 mm (Section 4.1). \nThe large-bore vasculature can be conveniently excavated at LN2 temperatures - either relatively quickly \nby map following (i.e., cartographic excavation;  Section 4.2.1) or more slowly by exploratory methods if \nnecessary (i.e., exploratory excavation;  Section 4.2.2).  For many cryopatients, some combination of both \nmethods may be required if the maps of the large-bore vasculature are not entirely complete. \n4.2.1  Cartographic Excavation \nExcavation nanorobots are employed to remove mainly frozen water-ice or vitrification cryoprotectant \nmaterials977 from all major blood vessels identified on the large-vessel 3D vascular map, a process that may \nbe called cartographic excavation.  Due to the presence of the map, there can be some reasonable assurance \nthat most major vessels, including the lymphatics,978 will have been identified and can be excavated, and it \nwill be possible to calculate the safest pathways between termini of broken vessels that have been bisected \nand separated by up to 0.1 mm due to cracking (Section 3.4.3).  For the few large vessels that might be \nmissed during the scan, they can be found later either by excavation upward in size from the capillary beds \nreaching the other (missing) side of the vessel, or, in the case of vessel segments completely isolated by \nseparate breaks on either side and not detected by the original scan, by capillary bed analysis that should \ndetect blocks of tissue that appear to lack sufficient vascularization, followed by exploratory excavation \n(Section 4.2.2) of those few blocks of tissue. \nIf only a 1 mm vascular map was available, this excavation would involve clearing out ~11,541 arterial \nvessels (including aorta, large arteries, main artery branches, and terminal artery branches) of lumenal \n976 Kaufman Z, Paran H, Haas I, Malinger P, Zehavi T, Karni T, Pappo I, Sandbank J, Diment J, Allweis T. Mapping breast \ntissue types by miniature radio-frequency near-field spectroscopy sensor in ex-vivo freshly excised specimens. BMC Med \nImaging. 2016 Oct 10;16(1):57; https://www.ncbi.nlm.nih.gov/pmc/articles/PMC5057390/. \n977 Some large blood clots may also need to be removed. \n\"Lymphatic System\"; http://www.nanomedicine.com/NMI/8.2.1.3.htm. \n\n\nvolume ~500 cm3, plus another ~11,541 venous vessels (including vena cava, large veins, main venous \nbranches, and terminal veins)979 of lumenal volume ~3350 cm3,980 for a blood vessel excavation volume of \n~3850 cm3, out of the total ~5400 cm3 blood volume.  The excavation must also clear out ~12 large \nlymphatic vessels (including the thoracic duct, right lymphatic duct, main trunks, and cisterna chylii) and \n~100 minor lymphatic trunks of lumenal volume ~11 cm3,981 the entire cardiac chamber volume of ~450 \ncm3, and the entire ~150 cm3 volume of cerebrospinal fluid,982 giving a total clearance volume of Vice,1mm ~ \n4461 cm3. \nIf a 0.1 mm-resolution vascular map is available, the excavation will include an additional ~4,500,000 \narterioles of lumenal volume ~70 cm3 and ~4,500,000 venules of lumenal volume ~355 cm3, increasing the \nblood vessel excavation volume by ~425 cm3 to a grand total of ~4275 cm3 for the blood vessels, out of the \ntotal ~5400 cm3 blood volume.  To this must be added ~618,700 lymphonodal collecting ducts of lumenal \nvolume ~363 cm3 and ~68,000,000 lymphatic precollecting ducts of lumenal volume ~1200 cm3, \nrepresenting another ~1563 cm3 of lymphatic volume, making a grand total of ~1574 cm3, out of the total \n~3300 cm3 lymphatic system volume.  These extra vessels add ~1988 cm3, increasing the total clearance \nvolume to Vice,0.1mm ~ 6449 cm3.  All these volumes would be ~43 times smaller983 if only the brain is \nconsidered. \nNote that these excavation volumes refer to fully-patent liquid-filled vessels in living patients and might \nchange in as yet unmeasured amounts due to:  (A) a volume increase due to the osmotic outflow of water \nfrom tissues into blood vessels during the cryopreservation process (e.g., brain blood vessels are maximally \ndilated during cryoprotectant perfusion);  (B) a volume change ranging from +9% expansion for pure water \nas it freezes at 0 degC (273 K) to -5% contraction of pure M22 \ncryoprotective solution as it solidifies during cooling from 0 degC \nto -150 degC (123 K) (see chart, Section 5.2.3.1(B));  or (C) an \nincrease or decrease in vessel mechanical patency compared to \nliving vasculature, after perfusion with cryoprotectant and \nsubsequent solidification of lumenal contents during \ncryopreservation.  Measuring and modeling the exact changes \nwould be a useful experimental project for future research. \nThe excavation nanorobots may be conceptualized as a \nloosely-space-filling utility fog984 (image, left) that advances \n                                                 \n979 The venous tree including the hepatic portal system (https://en.wikipedia.org/wiki/Hepatic_portal_system) and the \nhypophyseal portal system (https://en.wikipedia.org/wiki/Hypophyseal_portal_system), which transport venous blood between \ntwo capillary beds. \n980 Freitas RA Jr. Nanomedicine, Volume I: Basic Capabilities, Landes Bioscience, Georgetown TX, 1999, Table 8.1, \n\"Approximate Quantification of the Human Arteriovenous System\"; http://www.nanomedicine.com/NMI/Tables/8.1.jpg. \n981 Freitas RA Jr. Nanomedicine, Volume I: Basic Capabilities, Landes Bioscience, Georgetown TX, 1999, Table 8.5, \n\"Approximate Quantification of the Human Lymphatic System\"; http://www.nanomedicine.com/NMI/Tables/8.5.jpg. \n982 Freitas RA Jr. Nanomedicine, Volume I: Basic Capabilities, Landes Bioscience, Georgetown TX, 1999, Table 8.9, \"Mass, \nVolume, and Scale Size of the Organs of the Human Body\"; http://www.nanomedicine.com/NMI/Tables/8.9.jpg. \n983 [average human brain volume ~1.4 L (https://en.wikipedia.org/wiki/Brain_size)] / [average human body volume ~ 60 L \n(http://www.nanomedicine.com/NMI/8.2.5.htm)] = 1/43. \n984 Hall JS. Utility fog: A universal physical substance. Vision 21: Interdisciplinary Science and Engineering in the Era of \nCyberspace, NASA-Lewis Research Center (N94-27367), Dec 1993, pp. 115-126; \nhttps://ntrs.nasa.gov/archive/nasa/casi.ntrs.nasa.gov/19940022864.pdf.  See also:  https://www.autogeny.org/Ufog.html and \nhttps://ntrs.nasa.gov/archive/nasa/casi.ntrs.nasa.gov/19940022864.pdf\n\n\nslowly from the entry point(s) throughout the vascular space to be cleared, filling that space as it moves \nforward like an extensible \"mining worm\".  Active robots at the forward end follow the map and remove \nbits of ice, clearing the vessel lumen all the way to the cold-immobilized endothelial cell surfaces lining the \nvessel walls.  The bits of ice are transported rearward through relatively inactive robots comprising the \nbody of the \"worm\" and thence out of the body.  Excavation proceeds until all vessels identified in the map \nhave been cleared of ice and replaced with liquid nitrogen.  Entry points can include any convenient large \nvessel located near the skin surface, or accessible via open respiratory volumes, or even the heart.  During \ncryopreservation the entry point for washout is the femoral artery (for whole-body) or the carotid artery (for \nneuro) and the cannula is normally left in place,985 providing a convenient entry point for tunneling \nnanorobots. \nThe hepatic portal vein986 is a special case because it does not carry blood directly from the arterial to the \nvenous circuit, but rather connects two capillary beds, carrying blood to the liver987 from the \ngastrointestinal tract, the gallbladder, the pancreas, and the spleen.  Because the large 6-12 mm diameter988 \nportal vein is not directly accessible from large vessels on either the arterial or venous side of the \ncirculation, special arrangements might be made for its early excavation, possibly employing a targeted \nnanosyringe (Section 4.12.2.8) or nanocatheter (Section 4.12.3.1) apparatus.  The only other portal \nsystem989 found in humans, the hypophyseal portal system990 that transports hormones between the \nhypothalamus and the anterior pituitary in the brain, has venules that are 300 mm long and 32 mm in \ndiameter (in rats)991 that will be excavated along with the rest of the microvasculature (Section 4.4), hence \nrequire no special handling here.  The efferent arterioles992 in the human kidney that carry blood from the \nglomerular capillaries to a second peritubular capillary network, sometimes mistaken for the renal portal \nsystem993 that is found only in non-mammalian kidneys, are also microscale in size and will be excavated \nlater in due course (Section 4.4). \nAnother interesting minor challenge is how the nanorobots will nondestructively pass through numerous \nvenous,994 lymphatic,995 and heart996 valves, most of which consist of simple bicuspid flaps of tissue that \n                                                 \n985 https://www.alcor.org/library/alcor-human-cryopreservation-protocol/. \n986 https://en.wikipedia.org/wiki/Portal_vein. \n987 The liver receives 75% of its blood supply from the hepatic portal vein and 25% from the regular arterial circulation; \nhttps://en.wikipedia.org/wiki/Liver#Blood_supply. \n988 Wanless IR, Huang WY. \"Vascular Disorders,\" in:  Burt AD, Portmann BC, Ferrell LD, eds., MacSween's Pathology of \nthe Liver, 6th Edition, 2012, pp. 601-643; https://www.sciencedirect.com/science/article/pii/B978070203398800012X. \n989 https://en.wikipedia.org/wiki/Portal_venous_system. \n990 https://en.wikipedia.org/wiki/Hypophyseal_portal_system. \n991 Gross PM, Joneja MG, Pang JJ, Polischuk TM, Shaver SW, Wainman DS. Topography of short portal vessels in the rat \npituitary gland: a scanning electron-microscopic and morphometric study of corrosion cast replicas. Cell Tissue Res. 1993 \nApr;272(1):79-88; https://pubmed.ncbi.nlm.nih.gov/8481959/. \n992 https://en.wikipedia.org/wiki/Efferent_arteriole. \n993 https://en.wikipedia.org/wiki/Renal_portal_system. \n994 Caggiati A. The venous valves of the lower limbs. Phlebolymphology 2013;20(2):87-95; \nhttps://www.phlebolymphology.org/wp-content/uploads/2014/09/Phlebolymphology78.pdf.  See also:  \nhttps://www.jobst.com/mainnavigation/leg-health/veins-valves.html and https://en.wikipedia.org/wiki/Vein. \n995 Scallan JP, Zawieja SD, Castorena-Gonzalez JA, Davis MJ. Lymphatic pumping: mechanics, mechanisms and malfunction. \nJ Physiol. 2016 Oct 15;594(20):5749-5768; https://www.ncbi.nlm.nih.gov/pmc/articles/PMC5063934/.  See also:  \nhttps://www.phlebolymphology.org/wp-content/uploads/2014/09/Phlebolymphology78.pdf\nhttps://www.jobst.com/mainnavigation/leg-health/veins-valves.html\n\n\nwill be frozen solid in the cryopreserved patient.  Future research should determine the typical states of \nthese valves following cryopreservation.997  If valves are typically blocked open with bits of interposed ice, \nthen robot passage should be easy once the bits of ice are cleared away.  If valves are completely sealed, \nthen a small amount of valve tissue holing or trimming by the robots might be required, mindful that only a \nfew microns of clearance may be needed for successful excavation operations to proceed.  Precapillary \nsphincters998 (smooth muscle fibers encircling the entrance to capillaries, found uniquely in the \nmesenteric999 circulation) might have squeezed shut some vessels, so the typical states of these sphincters \nfollowing cryopreservation should also be the subject of future research. \nThe precise workings of nanorobots that perform ice excavation have not yet been detailed but don't seem \nconceptually complex.  One published estimate1000 of the power requirements for a drobot = 1 mm diameter \nnanorobot mechanically locomoting at vrobot ~ 1 mm/sec through solid ice via viscoplastic flow in which ice \ncrystal at a temperature just below freezing is deformed without breaking is Probot ~ 200,000 pW.  However, \nthis seems excessive compared to an excavation scheme in which most of the spoil is exported from the ice \nface through the utility fog \"mining worms\" and thence out of the body as still-unmelted microchunks of \nice, with the mining robots and local environment maintained at cryogenic temperatures by the suffusion of \nliquid nitrogen throughout the theater of operation. \nFor simplicity of analysis, consider an excavation robot that removes a cubic block of ice of linear \ndimension Lice by passing a cutting instrument1001 around the perimeter of the ice cube in order to free it \nfrom the larger ice face.  The cutting instrument cleaves a narrow layer of thickness tcut across all five \nunexposed sides,1002 removing spoil of volume Vspoil ~ 5 tcut Lice\n2 to release an ice cube of volume Vcube = \n(Lice - 2tcut)3 from the ice face which is then transported intact and still frozen out of the body. \n                                                                                                                                                 \n996 Ayoub S, Ferrari G, Gorman RC, Gorman JH, Schoen FJ, Sacks MS. Heart Valve Biomechanics and Underlying \nMechanobiology. Compr Physiol. 2016 Sep 15;6(4):1743-1780; https://www.ncbi.nlm.nih.gov/pmc/articles/PMC5537387/.  \nSee also:  https://en.wikipedia.org/wiki/Heart_valve. \n997 This may vary considerably from one patient to another, both on an individual basis and as a function of cryopreservation \nquality, and will be useful information to determine how much variation the algorithms and nanorobots must be able to handle. \n998 Sakai T, Hosoyamada Y. Are the precapillary sphincters and metarterioles universal components of the microcirculation? \nAn historical review. J Physiol Sci. 2013 Sep;63(5):319-31; https://www.ncbi.nlm.nih.gov/pmc/articles/PMC3751330/. \n999 https://en.wikipedia.org/wiki/Mesentery. \n1000 Freitas RA Jr. Nanomedicine, Volume I: Basic Capabilities, Landes Bioscience, Georgetown TX, 1999, Section 10.5.2, \n\"Viscosity and Locomotion in Ice\"; http://www.nanomedicine.com/NMI/10.5.2.htm. \n1001 Concepts in the existing nanomachinery literature include a rotating cylindrical \"core sampler\" tool and \"coarse shearing\" \ntools,* and morcellation and mincing cutting tools.+ \n  * Freitas RA Jr. Nanomedicine, Volume I: Basic Capabilities, Landes Bioscience, Georgetown TX, 1999, Section 9.3.2, \n\"Nanoscale End-Effectors and Tool Tips\"; http://www.nanomedicine.com/NMI/9.3.2.htm. \n  + Freitas RA Jr. Nanomedicine, Volume I: Basic Capabilities, Landes Bioscience, Georgetown TX, 1999, Section 9.3.5.1, \n\"Morcellation and Mincing\"; http://www.nanomedicine.com/NMI/9.3.5.1.htm. \n1002 While simple ice core augers are well-known,* there are many ways to gain cutting access to the fifth side at the bottom of \nthe cube being extracted.  For example, a starter hole can be drilled to the depth of the bottom face that is sufficiently wide to \nadmit a sideways cutting instrument, from which the rest of that cutting plane becomes readily accessible across the entire \nface.  Alternatively, the initial cut could be made at a downward angle, establishing a cutting plane ramp that zigzags deeper \nwith each traverse, thus avoiding the need to drill a starter hole for each new plane of ice (though producing slanted cubes).  \nCircumferential side-cutting devices have also been patented for medical use.+ \n  * https://en.wikipedia.org/wiki/Ice_core and https://en.wikipedia.org/wiki/Ice_drilling#Coring_augers. \n  + McGuckin JF Jr. Breast surgery method and apparatus. U.S. Patent 7,753,920, 13 Jun 2010; \n\n\nThe energy required to free the ice cube can be conservatively estimated as the energy required to melt the \nspoil.  The energy cost to (locally) melt the spoil ice is ED,melt = r ice Hfusion,water = 3.1 x 108 J/m3, where r ice \n= 916.7 kg/m3 (the density of ice at 0 degC) and Hfusion,water = 333,550 J/kg (the heat of fusion of water at 0 \ndegC),1003 plus the energy cost to (locally) warm the ice from TLN2 = 77 K to Tice,melt ~ 273 K (~0 degC) which is \nED,warm ~ r ice cice (Tice,melt - TLN2) = 2.5 x 108 J/m3, where cice ~ 1400 J/kg-K (the average specific heat \ncapacity of ice over the indicated temperature range).1004  (Nonaqueous cryopreservative chemicals such as \nDMSO1005 and ethylene glycol1006 have lower heats of fusion and heat capacities, hence their inclusion in \nthe above calculations would only lower the total energy estimate.)  Taking the total reliquidification \nenergy as ED,liq = ED,warm + ED,melt = 5.6 x 108 J/m3 for our crude estimate of the energy cost of excavation \nyields EExcavation ~ ED,liq Vspoil = 28 pJ per ice cube of volume Vcube = 0.941 mm3 with Lice = 1 mm, tcut = 10 \nnm, and Vspoil = 0.05 mm3.  The energy cost for hand-over-hand transport of one intact microscale ice cube \nusing a telescoping manipulator arm is ~10 zJ/nm,1007 or Etransport ~ 10 pJ to move the ice cube ~1 meter to \nexit the body. \nExpending only ~28 pJ/ice cube, a Probot = 100 pW excavation nanorobot should be able to target a removal \nrate of ncubes ~ 1 ice cube per second, allowing a rate of advance through the vasculature of vclearance ~ 1 \nmm/sec.  If the average path length of a complete vascular circuit (mainly noncapillaries) is Lvasc ~ 1.5 \nm,1008 then the time required to clear ice from noncapillary vessels is on the order of tclearance ~ Lvasc / \nvclearance = 1.5 x 106 sec ~ 17 days.  Taking the ice removal rate by front-line active excavation nanorobots \nas rremoval = 1 mm3/nanorobot-sec, then the excavation fleet required to clear a 1-mm resolution vascular \nmap must include Nnanorobots,1mm = Vice,1mm / (rremoval tclearance) = 2.97 x 109 front-line nanorobots with a \ncontinuous average fleet power generation of Pfleet,1mm = Probot Nnanorobots,1mm = 0.30 W, or Nnanorobots,0.1mm = \nVice,0.1mm / (rremoval tclearance) = 4.30 x 109 nanorobots to clear a 0.1-mm resolution vascular map with \nPfleet,0.1mm = Probot Nnanorobots,0.1mm = 0.43 W.  These figures do not include the much larger number of \nnanorobots trailing behind the front-line devices that will be relatively inactive, engaging only in relatively \nlow-power hand-over-hand transport tasks.  The total number of ice cubes that are removed and must be \ntransported is Nicecubes,0.1mm ~ Vice,0.1mm / Lice\n3 = 6.449 x 1015, adding only a modest Ptransport,0.1mm = \nNicecubes,0.1mm Etransport / tclearance = 0.043 W to the continuous average fleet power requirement. \nFrozen tissue at 77 K (-196 degC) with a density of ~ 932 kg/m3 (if mostly water-ice)1009 should have a \nspecific heat capacity of ~0.63 pJ/mm3-K,1010 so even if there are many cubic microns of frozen tissue \n                                                 \n1003 https://en.wikipedia.org/wiki/Properties_of_water. \n1004 Robert C. Weast, Handbook of Chemistry and Physics, 49th Edition, CRC, Cleveland OH, 1968; \"Specific Heat of Ice,\" -\n200 degC to -2.2 degC, p. D-95.  See also:  https://www.engineeringtoolbox.com/ice-thermal-properties-d_576.html. \n1005 The heat of fusion for solid DMSO is ~ 2 x 108 J/m3 (https://en.wikipedia.org/wiki/Dimethyl_sulfoxide_(data_page)), well \nbelow the 3.1 x 108 J/m3 value for solid water-ice.  The heat capacity of liquid DMSO is ~2 x 106 J/m3-K \n(https://en.wikipedia.org/wiki/Dimethyl_sulfoxide_(data_page)), well below the 4.22 x 106 J/m3-K value for liquid water at 0 \ndegC (https://www.engineeringtoolbox.com/specific-heat-capacity-water-d_660.html). \n1006 The heat of fusion for solid ethylene glycol is ~ 1.8 x 108 J/m3 \n(https://en.wikipedia.org/wiki/Ethylene_glycol_(data_page)), well below the 3.1 x 108 J/m3 value for solid water-ice.  The heat \ncapacity of liquid ethylene glycol at 0 degC is ~2.7 x 106 J/m3-K (https://www.engineeringtoolbox.com/ethylene-glycol-\nd_146.html), well below the 4.22 x 106 J/m3-K value for liquid water at 0 degC (https://www.engineeringtoolbox.com/specific-\nheat-capacity-water-d_660.html). \n\"Approximate Quantification of the Human Arteriovenous System\"; http://www.nanomedicine.com/NMI/Tables/8.1.jpg. \n1009 Handle PH, Loerting T. Temperature-induced amorphisation of hexagonal ice. Phys Chem Chem Phys. 2015 Feb \n21;17(7):5403-5417; https://pubs.rsc.org/en/content/articlehtml/2015/cp/c4cp05587j.",
    "topic": "Robert_A_Freitas_Jr_Cryostasis_Revival_The_Recovery_of_Cryonics-part1-ready.md"
}